
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>零、前言 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >零、前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x96F6;&#x3001;&#x524D;&#x8A00;">&#x96F6;&#x3001;&#x524D;&#x8A00;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="https://eloquentjavascript.net/00_intro.html" target="_blank">Introduction</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>We think we are creating the system for our own purposes. We believe we are making it in our own image... But the computer is not really like us. It is a projection of a very slim part of ourselves: that portion devoted to logic, order, rule, and clarity.</p>
<p>Ellen Ullman&#xFF0C;&#x300A;Close to the Machine: Technophilia and its Discontents&#x300B;</p>
</blockquote>
<p><img src="img/0-0.jpg" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x5173;&#x4E8E;&#x6307;&#x5BFC;&#x7535;&#x8111;&#x7684;&#x4E66;&#x3002;&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x50CF;&#x87BA;&#x4E1D;&#x5200;&#x4E00;&#x6837;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x4F46;&#x76F8;&#x6BD4;&#x4E8E;&#x87BA;&#x4E1D;&#x5200;&#x800C;&#x8A00;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x505A;&#x4F60;&#x60F3;&#x8BA9;&#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x5411;&#x4F60;&#x663E;&#x793A;&#x4F60;&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x6216;&#x50CF;&#x8BA1;&#x7B97;&#x5668;&#x4E00;&#x6837;&#x5DE5;&#x4F5C;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x76F8;&#x5E94;&#x7684;&#x5E94;&#x7528;&#x5E76;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x3002; &#x4F46;&#x5BF9;&#x4E8E;&#x72EC;&#x7279;&#x7684;&#x6216;&#x5F00;&#x653E;&#x5F0F;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x4E0D;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x7F16;&#x7A0B;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x65B9;&#x3002;&#x7F16;&#x7A0B;&#x662F;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A; - &#x5B83;&#x662F;&#x4E00;&#x7EC4;&#x7CBE;&#x786E;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x4EC0;&#x4E48;&#x3002; &#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x611A;&#x8822;&#x7684;&#xFF0C;&#x8FC2;&#x8150;&#x7684;&#x91CE;&#x517D;&#xFF0C;&#x7F16;&#x7A0B;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x662F;&#x4E4F;&#x5473;&#x548C;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x7684;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x514B;&#x670D;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x5E76;&#x4E14;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x4EAB;&#x53D7;&#x611A;&#x8822;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x7684;&#x4E25;&#x8C28;&#x601D;&#x7EF4;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x7A0B;&#x53EF;&#x4EE5;&#x662F;&#x975E;&#x5E38;&#x6709;&#x76CA;&#x7684;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5728;&#x51E0;&#x79D2;&#x949F;&#x5185;&#x5B8C;&#x6210;&#x624B;&#x52A8;&#x64CD;&#x4F5C;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x7535;&#x8111;&#x5DE5;&#x5177;&#x53BB;&#x505A;&#x5B83;&#x4EE5;&#x524D;&#x505A;&#x4E0D;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#x3002; &#x5B83;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x62BD;&#x8C61;&#x601D;&#x7EF4;&#x7684;&#x4F18;&#x79C0;&#x7EC3;&#x4E60;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x90FD;&#x662F;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B8C;&#x6210;&#x7684;&#x3002; &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x4EBA;&#x5DE5;&#x6784;&#x5EFA;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x5BFC;&#x8BA1;&#x7B97;&#x673A;&#x3002; &#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E0E;&#x7535;&#x8111;&#x6C9F;&#x901A;&#x7684;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0E;&#x6211;&#x4EEC;&#x5F7C;&#x6B64;&#x6C9F;&#x901A;&#x7684;&#x65B9;&#x5F0F;&#x76F8;&#x5DEE;&#x592A;&#x5927;&#x3002; &#x4E0E;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x4E00;&#x6837;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x4EE5;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#x8BCD;&#x8BED;&#x548C;&#x8BCD;&#x7EC4;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x57FA;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x4F8B;&#x5982; 80 &#x5E74;&#x4EE3;&#x548C; 90 &#x5E74;&#x4EE3;&#x7684; BASIC &#x548C; DOS &#x63D0;&#x793A;&#x7B26;&#xFF0C;&#x662F;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x4EA4;&#x4E92;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x3002; &#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x88AB;&#x89C6;&#x89C9;&#x754C;&#x9762;&#x53D6;&#x4EE3;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C6;&#x89C9;&#x754C;&#x9762;&#x66F4;&#x5BB9;&#x6613;&#x5B66;&#x4E60;&#xFF0C;&#x4F46;&#x63D0;&#x4F9B;&#x66F4;&#x5C11;&#x7684;&#x81EA;&#x7531;&#x3002; &#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x5728;&#x54EA;&#x91CC;&#x770B;&#x5230;&#x3002; &#x6BCF;&#x79CD;&#x73B0;&#x4EE3; Web &#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x5185;&#x7F6E;&#x4E86;&#x4E00;&#x79CD;&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5373; JavaScript&#xFF0C;&#x56E0;&#x6B64;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x5728;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x4E0A;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x5C06;&#x8BD5;&#x56FE;&#x8BA9;&#x4F60;&#x8DB3;&#x591F;&#x4E86;&#x89E3;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x4ECE;&#x800C;&#x5B8C;&#x6210;&#x6709;&#x7528;&#x548C;&#x6709;&#x8DA3;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h2 id="&#x5173;&#x4E8E;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;">&#x5173;&#x4E8E;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;</h2>
<p>&#x9664;&#x4E86;&#x8BB2;&#x89E3; JavaScript &#x4E4B;&#x5916;&#xFF0C;&#x672C;&#x4E66;&#x4E5F;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x3002;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x3002;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x89C4;&#x5219;&#x7B80;&#x5355;&#x6E05;&#x6670;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x89C4;&#x5219;&#x4E4B;&#x4E0A;&#x6784;&#x5EFA;&#x7684;&#x7A0B;&#x5E8F;&#x5374;&#x5BB9;&#x6613;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x5219;&#x548C;&#x590D;&#x6742;&#x6027;&#x3002;&#x5373;&#x4FBF;&#x7A0B;&#x5E8F;&#x662F;&#x6309;&#x7167;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8DEF;&#x53BB;&#x6784;&#x5EFA;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x8FF7;&#x5931;&#x5728;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x4F60;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x4E66;&#x4E2D;&#x7684;&#x6982;&#x5FF5;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002;&#x5982;&#x679C;&#x4F60;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4F30;&#x8BA1;&#x8FD8;&#x6709;&#x4E0D;&#x5C11;&#x4E1C;&#x897F;&#x9700;&#x8981;&#x638C;&#x63E1;&#x5462;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5C06;&#x6240;&#x5B66;&#x77E5;&#x8BC6;&#x878D;&#x4F1A;&#x8D2F;&#x901A;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x53BB;&#x591A;&#x53C2;&#x8003;&#x548C;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x8D44;&#x6599;&#x3002;</p>
<p>&#x662F;&#x5426;&#x4ED8;&#x51FA;&#x5FC5;&#x8981;&#x7684;&#x52AA;&#x529B;&#x5B8C;&#x5168;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x81EA;&#x5DF1;&#x3002;&#x5F53;&#x4F60;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x96BE;&#x70B9;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x5C31;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x4E0B;&#x7ED3;&#x8BBA;&#x3002;&#x53EA;&#x8981;&#x80FD;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x597D;&#x6837;&#x7684;&#x3002;&#x7A0D;&#x505A;&#x4F11;&#x606F;&#xFF0C;&#x590D;&#x4E60;&#x4E00;&#x4E0B;&#x6240;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x59CB;&#x7EC8;&#x786E;&#x4FDD;&#x81EA;&#x5DF1;&#x9605;&#x8BFB;&#x5E76;&#x7406;&#x89E3;&#x4E86;&#x793A;&#x4F8B;&#x7A0B;&#x5E8F;&#x548C;&#x76F8;&#x5173;&#x7684;&#x7EC3;&#x4E60;&#x3002;&#x5B66;&#x4E60;&#x662F;&#x4E00;&#x9879;&#x8270;&#x5DE8;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x4F60;&#x638C;&#x63E1;&#x7684;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x90FD;&#x5C5E;&#x4E8E;&#x4F60;&#x81EA;&#x5DF1;&#xFF0C;&#x800C;&#x4E14;&#x4ECA;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x9053;&#x8DEF;&#x4F1A;&#x6108;&#x52A0;&#x8F7B;&#x677E;&#x3002;</p>
<blockquote>
<p>&#x5F53;&#x884C;&#x52A8;&#x65E0;&#x5229;&#x53EF;&#x56FE;&#x65F6;&#xFF0C;&#x5C31;&#x6536;&#x96C6;&#x4FE1;&#x606F;&#xFF1B;&#x5F53;&#x4FE1;&#x606F;&#x65E0;&#x5229;&#x53EF;&#x56FE;&#x65F6;&#xFF0C;&#x5C31;&#x4F11;&#x606F;&#x3002;</p>
<p>Ursula K. Le Guin&#xFF0C;&#x300A;The Left Hand of Darkness&#x300B;</p>
</blockquote>
<p>&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6709;&#x5F88;&#x591A;&#x542B;&#x4E49;&#xFF1A;&#x5B83;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7F16;&#x5199;&#x7684;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x6267;&#x884C;&#x7684;&#x4E00;&#x6BB5;&#x6307;&#x4EE4;&#x96C6;&#x5408;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x5B58;&#x5F53;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x63A7;&#x5236;&#x5185;&#x5B58;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x96C6;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5F88;&#x96BE;&#x5C06;&#x7A0B;&#x5E8F;&#x4E0E;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x719F;&#x6089;&#x7684;&#x4E8B;&#x7269;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#x3002;&#x6709;&#x4E00;&#x79CD;&#x8868;&#x9762;&#x4E0A;&#x6BD4;&#x8F83;&#x6070;&#x5F53;&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x5373;&#x5C06;&#x7A0B;&#x5E8F;&#x89C6;&#x4F5C;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x7EC4;&#x4EF6;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x673A;&#x5668;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x901A;&#x8FC7;&#x5185;&#x90E8;&#x901A;&#x4FE1;&#x6765;&#x5B9E;&#x73B0;&#x6574;&#x4E2A;&#x673A;&#x5668;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x8F6C;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x4E00;&#x53F0;&#x7269;&#x7406;&#x673A;&#x5668;&#xFF0C;&#x5145;&#x5F53;&#x8FD9;&#x4E9B;&#x975E;&#x7269;&#x8D28;&#x673A;&#x5668;&#x7684;&#x8F7D;&#x4F53;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x591A;&#x4E48;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x6240;&#x4EE5;&#x6709;&#x7528;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#x3002;&#x800C;&#x7A0B;&#x5E8F;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5C06;&#x8FD9;&#x4E9B;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x52A8;&#x4F5C;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x662F;&#x601D;&#x60F3;&#x7684;&#x7ED3;&#x6676;&#x3002;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x7269;&#x8D28;&#x6295;&#x5165;&#xFF0C;&#x5B83;&#x5F88;&#x8F7B;&#x91CF;&#x7EA7;&#xFF0C;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x7684;&#x53CC;&#x624B;&#x521B;&#x9020;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x4E0D;&#x7A0D;&#x52A0;&#x6CE8;&#x610F;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x79EF;&#x548C;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x63A7;&#x5236;&#xFF0C;&#x751A;&#x81F3;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#x8005;&#x4E5F;&#x4F1A;&#x611F;&#x5230;&#x8FF7;&#x60D1;&#x3002;&#x5728;&#x53EF;&#x63A7;&#x7684;&#x8303;&#x56F4;&#x5185;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x662F;&#x7F16;&#x7A0B;&#x8FC7;&#x7A0B;&#x4E2D;&#x9996;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x90A3;&#x4E48;&#x7F8E;&#x597D;&#x3002;&#x7F16;&#x7A0B;&#x7684;&#x7CBE;&#x7CB9;&#x5C31;&#x5728;&#x4E8E;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x5730;&#x63A7;&#x5236;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x8D28;&#x91CF;&#x9AD8;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x4E0D;&#x4F1A;&#x592A;&#x9AD8;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x4E3A;&#xFF0C;&#x63A7;&#x5236;&#x7A0B;&#x5E8F;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x6280;&#x672F;&#x3002;&#x4ED6;&#x4EEC;&#x5236;&#x5B9A;&#x4E86;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x5219;&#xFF08;&#x201C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x201D;&#xFF09;&#xFF0C;&#x5E76;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x5730;&#x5446;&#x5728;&#x4ED6;&#x4EEC;&#x5B89;&#x5168;&#x533A;&#x5185;&#x3002;</p>
<p>&#x8FD9;&#x4E0D;&#x4EC5;&#x65E0;&#x804A;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002;&#x65B0;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x7F16;&#x7A0B;&#x9886;&#x57DF;&#x8FD8;&#x5F88;&#x5E74;&#x8F7B;&#xFF0C;&#x4ECD;&#x7136;&#x5728;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x5E76;&#x4E14;&#x591A;&#x6837;&#x5230;&#x8DB3;&#x4EE5;&#x4E3A;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x7559;&#x51FA;&#x7A7A;&#x95F4;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x53EF;&#x6015;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7EE7;&#x7EED;&#x72AF;&#x9519;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F60;&#x80FD;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x3002;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x662F;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x53D1;&#x5C55;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x4E00;&#x7CFB;&#x5217;&#x89C4;&#x5219;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CD;&#x8981;">&#x4E3A;&#x4EC0;&#x4E48;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CD;&#x8981;</h2>
<p>&#x5728;&#x8BA1;&#x7B97;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x4F0A;&#x59CB;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x7A0B;&#x5E8F;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>00110001 00000000 00000000
00110001 00000001 00000001
00110011 00000001 00000010
01010001 00001011 00000010
00100010 00000010 00001000
01000011 00000001 00000000
01000001 00000001 00000001
00010000 00000010 00000000
01100010 00000000 00000000
</code></pre><p>&#x8BE5;&#x7A0B;&#x5E8F;&#x8BA1;&#x7B97;&#x6570;&#x5B57; 1~10 &#x4E4B;&#x548C;&#xFF0C;&#x5E76;&#x6253;&#x5370;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;<code>1+2+...+10=55</code>&#x3002;&#x8BE5;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x5728;&#x65E9;&#x671F;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7F16;&#x7A0B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x6B63;&#x786E;&#x7684;&#x4F4D;&#x7F6E;&#x8BBE;&#x7F6E;&#x5927;&#x91CF;&#x5F00;&#x5173;&#x9635;&#x5217;&#xFF0C;&#x6216;&#x5728;&#x7EB8;&#x5E26;&#x4E0A;&#x7A7F;&#x5B54;&#x5E76;&#x5C06;&#x7EB8;&#x5E26;&#x8F93;&#x5165;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x591A;&#x4E48;&#x5197;&#x957F;&#x4E4F;&#x5473;&#x4E14;&#x6613;&#x4E8E;&#x51FA;&#x9519;&#x3002;&#x5373;&#x4FBF;&#x662F;&#x7F16;&#x5199;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x8017;&#x8D39;&#x5F88;&#x5927;&#x7CBE;&#x529B;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x3002;&#x7F16;&#x5199;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#x5219;&#x66F4;&#x662F;&#x96BE;&#x4E0A;&#x52A0;&#x96BE;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x624B;&#x52A8;&#x8F93;&#x5165;&#x8FD9;&#x4E9B;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#x7684;&#x4F4D;&#x5E8F;&#x5217;&#xFF08;1 &#x548C; 0&#xFF09;&#x6765;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x7684;&#x786E;&#x80FD;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x611F;&#x5230;&#x5F88;&#x6709;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x7ED9;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x5E26;&#x6765;&#x6781;&#x5927;&#x7684;&#x6EE1;&#x8DB3;&#x611F;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6BCF;&#x884C;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E2D;&#x6587;&#x6765;&#x63CF;&#x8FF0;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#xFF1A;</p>
<ol>
<li><p>&#x5C06;&#x6570;&#x5B57; 0 &#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x5730;&#x5740;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E; 0&#x3002;</p>
</li>
<li><p>&#x5C06;&#x6570;&#x5B57; 1 &#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 1&#x3002;</p>
</li>
<li><p>&#x5C06;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 1 &#x4E2D;&#x7684;&#x503C;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 2&#x3002;</p>
</li>
<li><p>&#x5C06;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 2 &#x4E2D;&#x7684;&#x503C;&#x51CF;&#x53BB;&#x6570;&#x5B57; 11&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 2 &#x4E2D;&#x7684;&#x503C;&#x662F; 0&#xFF0C;&#x5219;&#x8DF3;&#x8F6C;&#x5230;&#x6307;&#x4EE4; 9&#x3002;</p>
</li>
<li><p>&#x5C06;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 1 &#x4E2D;&#x7684;&#x503C;&#x52A0;&#x5230;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 0&#x3002;</p>
</li>
<li><p>&#x5C06;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 1 &#x4E2D;&#x7684;&#x503C;&#x52A0;&#x4E0A;&#x6570;&#x5B57; 1&#x3002;</p>
</li>
<li><p>&#x8DF3;&#x8F6C;&#x5230;&#x6307;&#x4EE4; 3&#x3002;</p>
</li>
<li><p>&#x8F93;&#x51FA;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x4F4D;&#x7F6E; 0 &#x4E2D;&#x7684;&#x503C;&#x3002;</p>
</li>
</ol>
<p>&#x867D;&#x8BF4;&#x8FD9;&#x5DF2;&#x7ECF;&#x6BD4;&#x4E00;&#x5927;&#x5806;&#x4F4D;&#x5E8F;&#x5217;&#x8981;&#x597D;&#x8BFB;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x4E0D;&#x6E05;&#x6670;&#x3002;&#x4F7F;&#x7528;&#x540D;&#x79F0;&#x800C;&#x4E0D;&#x662F;&#x6570;&#x5B57;&#x7528;&#x4E8E;&#x6307;&#x4EE4;&#x548C;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF1A;</p>
<pre><code> Set &#x201C;total&#x201D; to 0.
 Set &#x201C;count&#x201D; to 1.
[loop]
 Set &#x201C;compare&#x201D; to &#x201C;count&#x201D;.
 Subtract 11 from &#x201C;compare&#x201D;.
 If &#x201C;compare&#x201D; is zero, continue at [end].
 Add &#x201C;count&#x201D; to &#x201C;total&#x201D;.
 Add 1 to &#x201C;count&#x201D;.
 Continue at [loop].
[end]
 Output &#x201C;total&#x201D;.
</code></pre><p>&#x73B0;&#x5728;&#x4F60;&#x80FD;&#x770B;&#x51FA;&#x8BE5;&#x7A0B;&#x5E8F;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x5417;&#xFF1F;&#x524D;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x521D;&#x59CB;&#x5316;&#x4E24;&#x4E2A;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x7684;&#x503C;&#xFF1A;<code>total</code>&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x7D2F;&#x52A0;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x800C;<code>count</code>&#x5219;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x6570;&#x5B57;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;<code>compare</code>&#x7684;&#x90A3;&#x884C;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x5947;&#x602A;&#x3002;&#x7A0B;&#x5E8F;&#x60F3;&#x6839;&#x636E;<code>count</code>&#x662F;&#x5426;&#x7B49;&#x4E8E; 11 &#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x505C;&#x6B62;&#x8FD0;&#x884C;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x673A;&#x5668;&#x76F8;&#x5F53;&#x539F;&#x59CB;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x662F;&#x5426;&#x4E3A; 0&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x5B83;&#x505A;&#x51FA;&#x51B3;&#x7B56;&#x3002;&#x56E0;&#x6B64;&#x7A0B;&#x5E8F;&#x7528;&#x540D;&#x4E3A;<code>compare</code>&#x7684;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x5B58;&#x653E;<code>count&#x2013;11</code>&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x8BE5;&#x503C;&#x662F;&#x5426;&#x4E3A; 0 &#x51B3;&#x5B9A;&#x662F;&#x5426;&#x8DF3;&#x8F6C;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x4E24;&#x884C;&#x5C06;<code>count</code>&#x7684;&#x503C;&#x7D2F;&#x52A0;&#x5230;&#x7ED3;&#x679C;&#x4E0A;&#xFF0C;&#x5E76;&#x5C06;<code>count</code>&#x52A0; 1&#xFF0C;&#x76F4;&#x5230;<code>count</code>&#x7B49;&#x4E8E;<code>11</code>&#x4E3A;&#x6B62;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x4F7F;&#x7528; JavaScript &#x91CD;&#x65B0;&#x7F16;&#x5199;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> total = <span class="hljs-number">0</span>, count = <span class="hljs-number">1</span>;
<span class="hljs-keyword">while</span> (count &lt;= <span class="hljs-number">10</span>) {
  total += count;
  count += <span class="hljs-number">1</span>;
}
<span class="hljs-built_in">console</span>.log(total);
<span class="hljs-comment">// &#x2192; 55</span>
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x7A0B;&#x5E8F;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#x3002;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x6765;&#x56DE;&#x8DF3;&#x8F6C;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x7531;<code>while</code>&#x7ED3;&#x6784;&#x8D1F;&#x8D23;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x7ED9;&#x4E88;&#x7684;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#xFF0C;<code>while</code>&#x8BED;&#x53E5;&#x5C31;&#x4F1A;&#x4E0D;&#x505C;&#x5730;&#x6267;&#x884C;&#x5176;&#x4E0B;&#x65B9;&#x7684;&#x8BED;&#x53E5;&#x5757;&#xFF08;&#x5305;&#x88F9;&#x5728;&#x5927;&#x62EC;&#x53F7;&#x4E2D;&#xFF09;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x7ED9;&#x4E88;&#x7684;&#x6761;&#x4EF6;&#x662F;<code>count&lt;=10</code>&#xFF0C;&#x610F;&#x601D;&#x662F;&#x201C;<code>count</code>&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; 10&#x201D;&#x3002;&#x6211;&#x4EEC;&#x518D;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E34;&#x65F6;&#x7684;&#x503C;&#x5E76;&#x5C06;&#x5176;&#x4E0E; 0 &#x6BD4;&#x8F83;&#xFF0C;&#x90A3;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x5341;&#x5206;&#x70E6;&#x7410;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x9879;&#x804C;&#x8D23;&#x5C31;&#x662F;&#xFF0C;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x70E6;&#x7410;&#x65E0;&#x8DA3;&#x7684;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code>while</code>&#x8BED;&#x53E5;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>console.log</code>&#x64CD;&#x4F5C;&#x6765;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6070;&#x597D;&#x6709;<code>range</code>&#x548C;<code>sum</code>&#x8FD9;&#x7C7B;&#x65B9;&#x4FBF;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;<code>range</code>&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x6570;&#x5B57;&#x96C6;&#x5408;&#xFF0C;<code>sum</code>&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x6570;&#x5B57;&#x96C6;&#x5408;&#x4E4B;&#x548C;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(sum(range(<span class="hljs-number">1</span>, <span class="hljs-number">10</span>)));
<span class="hljs-comment">// &#x2192; 55</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x91CC;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x957F;&#x5EA6;&#x53EF;&#x957F;&#x53EF;&#x77ED;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x53EF;&#x9AD8;&#x53EF;&#x4F4E;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x7A0B;&#x5E8F;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#xFF0C;&#x800C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x7A0B;&#x5E8F;&#x5219;&#x63A5;&#x8FD1;&#x4E8E;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF1A;&#x5C06; 1~10 &#x8303;&#x56F4;&#x5185;&#x7684;&#x6570;&#x5B57;&#x4E4B;&#x548C;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF08;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x7F16;&#x5199;<code>sum</code>&#x548C;<code>range</code>&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#xFF09;&#x3002;</p>
<p>&#x4F18;&#x79C0;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x7701;&#x7565;&#x7EC6;&#x8282;&#xFF0C;&#x63D0;&#x4F9B;&#x4FBF;&#x6377;&#x7684;&#x79EF;&#x6728;&#xFF08;&#x6BD4;&#x5982;<code>while</code>&#x548C;<code>console.log</code>&#xFF09;&#xFF0C;&#x5141;&#x8BB8;&#x4F60;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x7684;&#x79EF;&#x6728;&#xFF08;&#x6BD4;&#x5982;<code>sum</code>&#x548C;<code>range</code>&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x5E76;&#x4F7F;&#x8FD9;&#x4E9B;&#x79EF;&#x6728;&#x6613;&#x4E8E;&#x7F16;&#x5199;&#x3002;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;-javascript">&#x4EC0;&#x4E48;&#x662F; JavaScript</h2>
<p>JavaScript &#x8BDE;&#x751F;&#x4E8E; 1995 &#x5E74;&#x3002;&#x8D77;&#x521D;&#xFF0C;Netscape Navigator &#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x5176;&#x8FD0;&#x7528;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#x6DFB;&#x52A0;&#x7A0B;&#x5E8F;&#x3002;&#x81EA;&#x6B64;&#x4EE5;&#x540E;&#xFF0C;&#x5404;&#x7C7B;&#x4E3B;&#x6D41;&#x56FE;&#x5F62;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x5668;&#x5747;&#x91C7;&#x7528;&#x4E86; JavaScript&#x3002;JavaScript &#x4F7F;&#x5F97;&#x73B0;&#x4EE3;&#x7F51;&#x9875;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6210;&#x4E3A;&#x53EF;&#x80FD; &#x2014;&#x2014; &#x4F7F;&#x7528; JavaScript &#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x6BCF;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8F7D;&#x5165;&#x9875;&#x9762;&#x3002;&#x4F46;&#x6709;&#x8BB8;&#x591A;&#x4F20;&#x7EDF;&#x7F51;&#x7AD9;&#x4E5F;&#x4F1A;&#x4F7F;&#x7528; JavaScript &#x6765;&#x63D0;&#x4F9B;&#x5B9E;&#x65F6;&#x4EA4;&#x4E92;&#x4EE5;&#x53CA;&#x66F4;&#x52A0;&#x667A;&#x80FD;&#x7684;&#x8868;&#x5355;&#x529F;&#x80FD;&#x3002;</p>
<p>JavaScript &#x5176;&#x5B9E;&#x548C;&#x540D;&#x4E3A;Java&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;&#x3002;&#x8D77;&#x4E86;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x76F8;&#x4F3C;&#x7684;&#x540D;&#x5B57;&#x5B8C;&#x5168;&#x662F;&#x5E02;&#x573A;&#x8003;&#x8651;&#x4F7F;&#x7136;&#xFF0C;&#x8FD9;&#x5E76;&#x975E;&#x662F;&#x4E00;&#x4E2A;&#x660E;&#x667A;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x5F53; JavaScript &#x51FA;&#x73B0;&#x65F6;&#xFF0C;Java &#x8BED;&#x8A00;&#x5DF2;&#x5728;&#x5E02;&#x573A;&#x4E0A;&#x5F97;&#x5230;&#x5927;&#x529B;&#x63A8;&#x5E7F;&#x4E14;&#x62E5;&#x6709;&#x4E86;&#x6781;&#x9AD8;&#x4EBA;&#x6C14;&#xFF0C;&#x56E0;&#x6B64;&#x67D0;&#x4E9B;&#x4EBA;&#x89C9;&#x5F97;&#x4F9D;&#x9644;&#x4E8E; Java &#x7684;&#x6210;&#x529F;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x4E3B;&#x610F;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x6446;&#x8131;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x4E86;&#x3002;</p>
<p>&#x5728; JavaScript &#x88AB;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x4E4B;&#x540E;&#xFF0C;ECMA &#x56FD;&#x9645;&#x5236;&#x8BA2;&#x4E86;&#x4E00;&#x4EFD;&#x6807;&#x51C6;&#x6587;&#x6863;&#x6765;&#x63CF;&#x8FF0; JavaScript &#x7684;&#x5DE5;&#x4F5C;&#x884C;&#x4E3A;&#xFF0C;&#x4EE5;&#x4FBF;&#x6240;&#x6709;&#x58F0;&#x79F0;&#x652F;&#x6301; JavaScript &#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x3002;&#x6807;&#x51C6;&#x5316;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8BE5;&#x6807;&#x51C6;&#x88AB;&#x79F0;&#x4E3A; ECMAScript &#x6807;&#x51C6;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x672F;&#x8BED; ECMAScript &#x548C; JavaScript &#x53EF;&#x4EE5;&#x4EA4;&#x6362;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x4E0D;&#x8FC7;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x4E24;&#x4E2A;&#x540D;&#x5B57;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x4EBA;&#x4F1A;&#x8BF4; JavaScript &#x8BED;&#x8A00;&#x7684;&#x574F;&#x8BDD;&#x3002;&#x8FD9;&#x5176;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x8A00;&#x8BBA;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5F53;&#x88AB;&#x8981;&#x6C42;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528; JavaScript &#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x89C9;&#x5F97;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x96BE;&#x4EE5;&#x9A7E;&#x9A6D;&#x3002;JavaScript &#x63A5;&#x53D7;&#x6211;&#x8F93;&#x5165;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4F7F;&#x7528;&#x548C;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x91CA;&#x4EE3;&#x7801;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7EBF;&#x7D22;&#x77E5;&#x9053;&#x6211;&#x4E4B;&#x524D;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x9700;&#x8981;&#x505A;&#x51FA;&#x66F4;&#x591A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x5C31;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF1A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x4F7F;&#x7528; JavaScript&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x81EA;&#x7531;&#x5374;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x9650;&#x5EA6;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x5176;&#x5B9E;&#x662F;&#x5E0C;&#x671B;&#x521D;&#x5B66;&#x8005;&#x66F4;&#x5BB9;&#x6613;&#x4F7F;&#x7528; JavaScript &#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x6307;&#x51FA;&#x6211;&#x4EEC;&#x9519;&#x5728;&#x4F55;&#x5904;&#xFF0C;&#x56E0;&#x6B64;&#x4ECE;&#x7A0B;&#x5E8F;&#x4E2D;&#x627E;&#x51FA;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x68D8;&#x624B;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x79CD;&#x81EA;&#x7531;&#x6027;&#x4E5F;&#x6709;&#x5176;&#x4F18;&#x52BF;&#xFF0C;&#x8BB8;&#x591A;&#x6280;&#x672F;&#x5728;&#x66F4;&#x4E3A;&#x4E25;&#x683C;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x4E0D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x5728; JavaScript &#x4E2D;&#x5219;&#x7559;&#x4E0B;&#x4E86;&#x5B9E;&#x73B0;&#x7684;&#x4F59;&#x5730;&#xFF0C;&#x6B63;&#x5982;&#x4F60;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF08;&#x6BD4;&#x5982;&#x7B2C;&#x5341;&#x7AE0;&#xFF09;&#xFF0C;&#x6709;&#x4E9B;&#x4F18;&#x52BF;&#x53EF;&#x4EE5;&#x5F25;&#x8865; JavaScript &#x7684;&#x4E00;&#x4E9B;&#x7F3A;&#x70B9;&#x3002;&#x5728;&#x6B63;&#x786E;&#x5730;&#x5B66;&#x4E60; JavaScript &#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x5DE5;&#x4F5C;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x6211;&#x771F;&#x6B63;&#x559C;&#x6B22;&#x4E0A;&#x4E86; JavaScript&#x3002;</p>
<p>JavaScript &#x7248;&#x672C;&#x4F17;&#x591A;&#x3002;&#x5927;&#x7EA6;&#x5728; 2000~2010 &#x5E74;&#x95F4;&#xFF0C;&#x8FD9;&#x6B63;&#x662F; JavaScript &#x98DE;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x65F6;&#x671F;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x6700;&#x591A;&#x7684;&#x662F; ECMAScript 3&#x3002;&#x5728;&#x6B64;&#x671F;&#x95F4;&#xFF0C;ECMA &#x7740;&#x624B;&#x5236;&#x5B9A; ECMAScript 4&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x96C4;&#x5FC3;&#x52C3;&#x52C3;&#x7684;&#x7248;&#x672C;&#xFF0C;ECMA &#x8BA1;&#x5212;&#x5728;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x4E2D;&#x52A0;&#x5165;&#x8BB8;&#x591A;&#x5F7B;&#x5E95;&#x7684;&#x6539;&#x8FDB;&#x4E0E;&#x6269;&#x5C55;&#x3002;&#x4F46;&#x7531;&#x4E8E; ECMAScript 3 &#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x8FC7;&#x4E8E;&#x6FC0;&#x8FDB;&#x7684;&#x4FEE;&#x6539;&#x5FC5;&#x7136;&#x4F1A;&#x906D;&#x9047;&#x91CD;&#x91CD;&#x963B;&#x788D;&#xFF0C;&#x6700;&#x540E; ECMA &#x4E0D;&#x5F97;&#x4E0D;&#x4E8E; 2008 &#x5E74;&#x653E;&#x5F03;&#x4E86;&#x7248;&#x672C; 4 &#x7684;&#x5236;&#x5B9A;&#x3002;&#x8FD9;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x4E0D;&#x90A3;&#x4E48;&#x96C4;&#x5FC3;&#x52C3;&#x52C3;&#x7684;&#x7248;&#x672C; 5&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x51FA;&#x73B0;&#x5728; 2009 &#x5E74;&#x3002; &#x7136;&#x540E;&#x7248;&#x672C; 6 &#x5728; 2015 &#x5E74;&#x8BDE;&#x751F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x8BA1;&#x5212;&#x7528;&#x4E8E;&#x7248;&#x672C; 4 &#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;&#x4ECE;&#x90A3;&#x4EE5;&#x540E;&#xFF0C;&#x6BCF;&#x5E74;&#x90FD;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x8BED;&#x8A00;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#x7684;&#x4E8B;&#x5B9E;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5FC5;&#x987B;&#x4E0D;&#x65AD;&#x8DDF;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x8F83;&#x8001;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x652F;&#x6301;&#x6BCF;&#x4E2A;&#x7279;&#x6027;&#x3002; &#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x5E08;&#x4F1A;&#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x7834;&#x574F;&#x73B0;&#x6709;&#x7A0B;&#x5E8F;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x65B0;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x65E7;&#x7684;&#x7A0B;&#x5E8F;&#x3002; &#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x7684;&#x662F; 2017 &#x7248;&#x7684; JavaScript&#x3002;</p>
<p>Web &#x6D4F;&#x89C8;&#x5668;&#x5E76;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8FD0;&#x884C; JavaScript &#x7684;&#x5E73;&#x53F0;&#x3002;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6BD4;&#x5982; MongoDB &#x548C; CouchDB&#xFF0C;&#x4E5F;&#x4F7F;&#x7528; JavaScript &#x4F5C;&#x4E3A;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x548C;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x3002;&#x4E00;&#x4E9B;&#x684C;&#x9762;&#x548C;&#x670D;&#x52A1;&#x5668;&#x5F00;&#x53D1;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x7279;&#x522B;&#x662F; Node.js &#x9879;&#x76EE;&#xFF08;&#x7B2C;&#x4E8C;&#x5341;&#x7AE0;&#x4ECB;&#x7ECD;&#xFF09;&#xFF0C;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x4EE5;&#x5916;&#x7684; JavaScript &#x7F16;&#x7A0B;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#x3002;</p>
<h2 id="&#x4EE3;&#x7801;&#x53CA;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;">&#x4EE3;&#x7801;&#x53CA;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;</h2>
<p>&#x4EE3;&#x7801;&#x662F;&#x7A0B;&#x5E8F;&#x7684;&#x6587;&#x672C;&#x5185;&#x5BB9;&#x3002;&#x672C;&#x4E66;&#x591A;&#x6570;&#x7AE0;&#x8282;&#x90FD;&#x4ECB;&#x7ECD;&#x4E86;&#x5927;&#x91CF;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x548C;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x662F;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5C1D;&#x8BD5;&#x4E0D;&#x8981;&#x4EC5;&#x4EC5;&#x770B;&#x4E00;&#x773C;&#x793A;&#x4F8B;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x5E76;&#x7406;&#x89E3;&#x6BCF;&#x4E2A;&#x793A;&#x4F8B;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#x5E76;&#x4E3A;&#x4EE3;&#x7801;&#x6240;&#x56F0;&#x60D1;&#xFF0C;&#x4F46;&#x6211;&#x575A;&#x4FE1;&#x4F60;&#x5F88;&#x5FEB;&#x5C31;&#x53EF;&#x4EE5;&#x719F;&#x80FD;&#x751F;&#x5DE7;&#x3002;&#x5BF9;&#x5F85;&#x4E60;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x5E94;&#x8BE5;&#x4E00;&#x6837;&#x3002;&#x9664;&#x975E;&#x4F60;&#x786E;&#x5B9E;&#x5DF2;&#x7ECF;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x8981;&#x5047;&#x8BBE;&#x4F60;&#x5DF2;&#x7ECF;&#x7406;&#x89E3;&#x4E86;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5EFA;&#x8BAE;&#x8BFB;&#x8005;&#x5E94;&#x5C1D;&#x8BD5;&#x5728;&#x5B9E;&#x9645;&#x7684; JavaScript &#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x6267;&#x884C;&#x4E60;&#x9898;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x83B7;&#x77E5;&#x4EE3;&#x7801;&#x5DE5;&#x4F5C;&#x60C5;&#x51B5;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x5E0C;&#x671B;&#x8BFB;&#x8005;&#x53BB;&#x505A;&#x66F4;&#x591A;&#x7684;&#x8BD5;&#x9A8C;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x4E60;&#x9898;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x5728; <a href="http://eloquentjavascript.net/" target="_blank">http://eloquentjavascript.net/</a> &#x4E2D;&#x67E5;&#x9605;&#x672C;&#x4E66;&#x7684;&#x5728;&#x7EBF;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x8FD0;&#x884C;&#x548C;&#x5B9E;&#x9A8C;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5728;&#x7EBF;&#x7248;&#x672C;&#x4E2D;&#x70B9;&#x51FB;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x6765;&#x7F16;&#x8F91;&#x3001;&#x8FD0;&#x884C;&#x5E76;&#x67E5;&#x770B;&#x5176;&#x4EA7;&#x751F;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x5728;&#x505A;&#x4E60;&#x9898;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <a href="http://eloquentjavascript.net/code/" target="_blank">http://eloquentjavascript.net/code/</a>&#xFF0C;&#x8BE5;&#x7F51;&#x5740;&#x4F1A;&#x63D0;&#x4F9B;&#x6BCF;&#x4E2A;&#x4E60;&#x9898;&#x7684;&#x521D;&#x59CB;&#x4EE3;&#x7801;&#xFF0C;&#x8BA9;&#x4F60;&#x4E13;&#x5FC3;&#x4E8E;&#x89E3;&#x7B54;&#x4E60;&#x9898;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60F3;&#x8981;&#x5728;&#x672C;&#x4E66;&#x63D0;&#x4F9B;&#x7684;&#x6C99;&#x7BB1;&#x4EE5;&#x5916;&#x6267;&#x884C;&#x672C;&#x4E66;&#x4EE3;&#x7801;&#xFF0C;&#x9700;&#x8981;&#x7A0D;&#x52A0;&#x6CE8;&#x610F;&#x3002;&#x8BB8;&#x591A;&#x7684;&#x793A;&#x4F8B;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55; JavaScript &#x73AF;&#x5883;&#x4E0B;&#x8FD0;&#x884C;&#x3002;&#x4F46;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x7684;&#x4EE3;&#x7801;&#x5927;&#x591A;&#x6570;&#x90FD;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x8005; Node.js&#xFF09;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x80FD;&#x5728;&#x8FD9;&#x4E9B;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#x4E0B;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BB8;&#x591A;&#x7AE0;&#x8282;&#x5B9A;&#x4E49;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4F1A;&#x4E92;&#x76F8;&#x4F9D;&#x8D56;&#x6216;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E9B;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x3002;&#x672C;&#x4E66;&#x7F51;&#x7AD9;&#x7684;&#x6C99;&#x7BB1;&#x63D0;&#x4F9B;&#x4E86; zip &#x538B;&#x7F29;&#x6587;&#x4EF6;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x8FD0;&#x884C;&#x7279;&#x5B9A;&#x7AE0;&#x8282;&#x4EE3;&#x7801;&#x6240;&#x9700;&#x7684;&#x811A;&#x672C;&#x548C;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x6982;&#x89C8;">&#x672C;&#x4E66;&#x6982;&#x89C8;</h2>
<p>&#x672C;&#x4E66;&#x5305;&#x62EC;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x524D;&#x5341;&#x4E8C;&#x7AE0;&#x8BA8;&#x8BBA; JavaScript &#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684; 8 &#x7AE0;&#x8BA8;&#x8BBA;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x5668;&#x548C; JavaScript &#x5728;&#x7F51;&#x9875;&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x5B9E;&#x8DF5;&#x3002;&#x6700;&#x540E;&#x4E24;&#x7AE0;&#x4E13;&#x95E8;&#x8BB2;&#x89E3;&#x53E6;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; JavaScript &#x7F16;&#x7A0B;&#x7684;&#x73AF;&#x5883; &#x2014;&#x2014; Node.js&#x3002;</p>
<p>&#x7EB5;&#x89C2;&#x672C;&#x4E66;&#xFF0C;&#x5171;&#x6709; 5 &#x4E2A;&#x9879;&#x76EE;&#x5B9E;&#x6218;&#x7AE0;&#xFF0C;&#x7528;&#x4E8E;&#x8BB2;&#x89E3;&#x89C4;&#x6A21;&#x8F83;&#x5927;&#x7684;&#x793A;&#x4F8B;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x7AE0;&#x6765;&#x4ED4;&#x7EC6;&#x54C1;&#x5473;&#x771F;&#x5B9E;&#x7684;&#x7F16;&#x7A0B;&#x8FC7;&#x7A0B;&#x3002;&#x6839;&#x636E;&#x9879;&#x76EE;&#x51FA;&#x73B0;&#x6B21;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x9646;&#x7EED;&#x6784;&#x5EFA;&#x9012;&#x9001;&#x673A;&#x5668;&#x4EBA;&#xFF08;7&#xFF09;&#x3001;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF08;12&#xFF09;&#x3001;&#x5E73;&#x53F0;&#x6E38;&#x620F;&#xFF08;16&#xFF09;&#x3001;&#x50CF;&#x7D20;&#x7ED8;&#x56FE;&#x7A0B;&#x5E8F;&#xFF08;19&#xFF09;&#x548C;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x7F51;&#x7AD9;&#xFF08;21&#xFF09;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4ECB;&#x7ECD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x4F7F;&#x7528;4&#x7AE0;&#x6765;&#x4ECB;&#x7ECD; JavaScript &#x8BED;&#x8A00;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF0C;&#x5305;&#x62EC;&#x7B2C;&#x4E8C;&#x7AE0;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#xFF08;&#x6BD4;&#x5982;&#x5728;&#x672C;&#x524D;&#x8A00;&#x4E2D;&#x770B;&#x5230;&#x7684;<code>while</code>&#x5355;&#x8BCD;&#xFF09;&#x3001;&#x7B2C;&#x4E09;&#x7AE0;&#x51FD;&#x6570;&#xFF08;&#x7F16;&#x5199;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x79EF;&#x6728;&#xFF09;&#x548C;&#x7B2C;&#x56DB;&#x7AE0;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x6B64;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7B2C;&#x4E94;&#x7AE0;&#x548C;&#x7B2C;&#x516D;&#x7AE0;&#x4ECB;&#x7ECD;&#x51FD;&#x6570;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x8FD0;&#x7528;&#x6280;&#x672F;&#xFF0C;&#x4EE5;&#x7F16;&#x5199;&#x66F4;&#x52A0;&#x62BD;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#x5E76;&#x4EE5;&#x6B64;&#x6765;&#x63A7;&#x5236;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x4ECB;&#x7ECD;&#x5B8C;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x5B9E;&#x6218;&#xFF08;7&#xFF09;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x4F1A;&#x7EE7;&#x7EED;&#x8BB2;&#x89E3;&#x8BED;&#x8A00;&#x90E8;&#x5206;&#xFF0C;&#x4F8B;&#x5982;&#x7B2C;&#x516B;&#x7AE0;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x548C; bug &#x4FEE;&#x590D;&#x3001;&#x7B2C;&#x4E5D;&#x7AE0;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x5904;&#x7406;&#x6587;&#x672C;&#x6570;&#x636E;&#x7684;&#x91CD;&#x8981;&#x5DE5;&#x5177;&#xFF09;&#x3001;&#x7B2C;&#x5341;&#x7AE0;&#x6A21;&#x5757;&#x5316;&#xFF08;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF09;&#x4EE5;&#x53CA;&#x7B2C;&#x5341;&#x4E00;&#x7AE0;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#xFF08;&#x5904;&#x7406;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x7684;&#x4E8B;&#x4EF6;&#xFF09;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x9879;&#x76EE;&#x5B9E;&#x6218;&#x7AE0;&#x8282;&#xFF08;12&#xFF09;&#x5219;&#x662F;&#x5BF9;&#x672C;&#x4E66;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x603B;&#x7ED3;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF08;&#x7B2C;&#x5341;&#x4E09;&#x7AE0;&#x5230;&#x7B2C;&#x5341;&#x4E5D;&#x7AE0;&#xFF09;&#xFF0C;&#x9610;&#x8FF0;&#x4E86;&#x6D4F;&#x89C8;&#x5668; JavaScript &#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x3002;&#x4F60;&#x5C06;&#x4F1A;&#x5B66;&#x5230;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x67D0;&#x4E9B;&#x5143;&#x7D20;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x7B2C;&#x5341;&#x56DB;&#x7AE0;&#x4E0E;&#x7B2C;&#x5341;&#x4E03;&#x7AE0;&#xFF09;&#xFF0C;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x7B2C;&#x5341;&#x4E94;&#x7AE0;&#xFF09;&#x548C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x7B2C;&#x5341;&#x516B;&#x7AE0;&#xFF09;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x53C8;&#x6709;&#x4E24;&#x4E2A;&#x9879;&#x76EE;&#x5B9E;&#x6218;&#x7AE0;&#x8282;&#x3002;</p>
<p>&#x6B64;&#x540E;&#xFF0C;&#x7B2C;&#x4E8C;&#x5341;&#x7AE0;&#x9610;&#x8FF0; Node.js&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x5341;&#x4E00;&#x7AE0;&#x4F7F;&#x7528;&#x8BE5;&#x5DE5;&#x5177;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7F51;&#x9875;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x7248;&#x5F0F;&#x7EA6;&#x5B9A;">&#x672C;&#x4E66;&#x7248;&#x5F0F;&#x7EA6;&#x5B9A;</h2>
<p>&#x672C;&#x4E66;&#x4E2D;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x4EE3;&#x7801;&#xFF0C;&#x7A0B;&#x5E8F;&#xFF08;&#x5305;&#x62EC;&#x4F60;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x770B;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#xFF09;&#x4EE3;&#x7801;&#x7684;&#x5B57;&#x4F53;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">factorial</span>(<span class="hljs-params">n</span>) </span>{
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">0</span>) {
    <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> factorial(n - <span class="hljs-number">1</span>) * n;
  }
}
</code></pre>
<p>&#x4E3A;&#x4E86;&#x5C55;&#x793A;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x672C;&#x4E66;&#x5E38;&#x5728;&#x4EE3;&#x7801;&#x540E;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x671F;&#x671B;&#x8F93;&#x51FA;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x524D;&#x4F1A;&#x52A0;&#x4E0A;&#x4E24;&#x4E2A;&#x53CD;&#x659C;&#x6760;&#x548C;&#x4E00;&#x4E2A;&#x7BAD;&#x5934;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(factorial(<span class="hljs-number">8</span>));
<span class="hljs-comment">// &#x2192; 40320</span>
</code></pre>
<p>&#x795D;&#x597D;&#x8FD0;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: JavaScript 编程精解 中文第三版">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.html" class="navigation navigation-next " aria-label="Next page: 一、值，类型和运算符">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"零、前言","level":"1.2","depth":1,"next":{"title":"一、值，类型和运算符","level":"1.3","depth":1,"path":"1.md","ref":"1.md","articles":[]},"previous":{"title":"JavaScript 编程精解 中文第三版","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"0.md","mtime":"2019-12-08T16:07:04.977Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

