
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>一、值，类型和运算符 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.html" />
    
    
    <link rel="prev" href="0.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >一、值，类型和运算符</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E00;&#x3001;&#x503C;&#xFF0C;&#x7C7B;&#x578B;&#x548C;&#x8FD0;&#x7B97;&#x7B26;">&#x4E00;&#x3001;&#x503C;&#xFF0C;&#x7C7B;&#x578B;&#x548C;&#x8FD0;&#x7B97;&#x7B26;</h2>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/01_values.html" target="_blank">Values, Types, and Operators</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>&#x5728;&#x673A;&#x5668;&#x7684;&#x8868;&#x9762;&#x4E4B;&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x8F6C;&#x3002; &#x5B83;&#x4E0D;&#x8D39;&#x529B;&#x5C31;&#x53EF;&#x4EE5;&#x6269;&#x5927;&#x548C;&#x7F29;&#x5C0F;&#x3002; &#x5728;&#x548C;&#x8C10;&#x7684;&#x5173;&#x7CFB;&#x4E2D;&#xFF0C;&#x7535;&#x5B50;&#x6563;&#x5F00;&#x5E76;&#x91CD;&#x65B0;&#x805A;&#x5408;&#x3002; &#x76D1;&#x89C6;&#x5668;&#x4E0A;&#x7684;&#x8868;&#x683C;&#x53EA;&#x662F;&#x6C34;&#x9762;&#x4E0A;&#x7684;&#x6D9F;&#x6F2A;&#x3002; &#x672C;&#x8D28;&#x9690;&#x85CF;&#x5728;&#x4E0B;&#x9762;&#x3002;</p>
<p>Master Yuan-Ma&#xFF0C;&#x300A;The Book of Programming&#x300B;</p>
</blockquote>
<p><img src="img/1-0.jpg" alt=""></p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x4E16;&#x754C;&#x91CC;&#x53EA;&#x6709;&#x6570;&#x636E;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6570;&#x636E; - &#x4F46;&#x4E0D;&#x80FD;&#x63D0;&#x53CA;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x7684;&#x4E1C;&#x897F;&#x3002; &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x90FD;&#x4EE5;&#x4F4D;&#x7684;&#x957F;&#x5E8F;&#x5217;&#x5B58;&#x50A8;&#xFF0C;&#x56E0;&#x6B64;&#x57FA;&#x672C;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x4F4D;&#x662F;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x4E8C;&#x503C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x901A;&#x5E38;&#x63CF;&#x8FF0;&#x4E3A;&#x96F6;&#x548C;&#x4E00;&#x3002; &#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E9B;&#x5F62;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#x9AD8;&#x7535;&#x8377;&#x6216;&#x4F4E;&#x7535;&#x8377;&#xFF0C;&#x5F3A;&#x4FE1;&#x53F7;&#x6216;&#x5F31;&#x4FE1;&#x53F7;&#xFF0C;&#x6216; CD &#x8868;&#x9762;&#x4E0A;&#x7684;&#x4EAE;&#x6591;&#x70B9;&#x6216;&#x6697;&#x6591;&#x70B9;&#x3002; &#x4EFB;&#x4F55;&#x4E00;&#x6BB5;&#x79BB;&#x6563;&#x4FE1;&#x606F;&#x90FD;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4E3A;&#x96F6;&#x548C;&#x4E00;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x4ECE;&#x800C;&#x4EE5;&#x4F4D;&#x8868;&#x793A;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4F4D;&#x6765;&#x8868;&#x793A;&#x6570;&#x5B57; 13&#x3002; &#x5B83;&#x7684;&#x539F;&#x7406;&#x4E0E;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x4E0D;&#x662F; 10 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x53EA;&#x6709; 2 &#x4E2A;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x6743;&#x91CD;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#x589E;&#x52A0; 2 &#x500D;&#x3002; &#x4EE5;&#x4E0B;&#x662F;&#x7EC4;&#x6210;&#x6570;&#x5B57; 13 &#x7684;&#x4F4D;&#xFF0C;&#x4E0B;&#x65B9;&#x663E;&#x793A;&#x6570;&#x5B57;&#x7684;&#x6743;&#x91CD;&#xFF1A;</p>
<pre><code>   0   0   0   0   1   1   0   1
 128  64  32  16   8   4   2   1
</code></pre><p>&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6570;<code>00001101</code>&#xFF0C;&#x6216;&#x8005;<code>8+4+1</code>&#xFF0C;&#x5373; 13&#x3002;</p>
<h2 id="&#x503C;">&#x503C;</h2>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x4F4D;&#x4E4B;&#x6D77; - &#x4E00;&#x7247;&#x5B83;&#x4EEC;&#x7684;&#x6D77;&#x6D0B;&#x3002; &#x5178;&#x578B;&#x7684;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6613;&#x5931;&#x6027;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5668;&#xFF08;&#x5DE5;&#x4F5C;&#x5B58;&#x50A8;&#x5668;&#xFF09;&#x4E2D;&#xFF0C;&#x6709;&#x8D85;&#x8FC7; 300 &#x4EBF;&#x4F4D;&#x3002;&#x975E;&#x6613;&#x5931;&#x6027;&#x5B58;&#x50A8;&#xFF08;&#x786C;&#x76D8;&#x6216;&#x7B49;&#x4EF7;&#x7269;&#xFF09;&#x5F80;&#x5F80;&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x4E22;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6570;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x6210;&#x4EE3;&#x8868;&#x4FE1;&#x606F;&#x7247;&#x6BB5;&#x7684;&#x5757;&#x3002; &#x5728; JavaScript &#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5757;&#x79F0;&#x4E3A;&#x503C;&#x3002; &#x867D;&#x7136;&#x6240;&#x6709;&#x503C;&#x90FD;&#x662F;&#x7531;&#x4F4D;&#x6784;&#x6210;&#x7684;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x8D77;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x51B3;&#x5B9A;&#x5176;&#x4F5C;&#x7528;&#x7684;&#x7C7B;&#x578B;&#x3002; &#x6709;&#x4E9B;&#x503C;&#x662F;&#x6570;&#x5B57;&#xFF0C;&#x6709;&#x4E9B;&#x503C;&#x662F;&#x6587;&#x672C;&#x7247;&#x6BB5;&#xFF0C;&#x6709;&#x4E9B;&#x503C;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x3002; &#x8FD9;&#x5F88;&#x65B9;&#x4FBF;&#x3002; &#x4F60;&#x4E0D;&#x5FC5;&#x4E3A;&#x4F60;&#x7684;&#x503C;&#x6536;&#x96C6;&#x5EFA;&#x7B51;&#x6750;&#x6599;&#x6216;&#x4E3A;&#x5176;&#x4ED8;&#x8D39;&#x3002; &#x4F60;&#x53EA;&#x9700;&#x8981;&#x8C03;&#x7528;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5237;&#x7684;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x5C31;&#x6709;&#x4E86;&#x5B83;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x51ED;&#x7A7A;&#x521B;&#x9020;&#x7684;&#x3002; &#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5B58;&#x50A8;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x8017;&#x5C3D;&#x5185;&#x5B58;&#x3002; &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x540C;&#x65F6;&#x9700;&#x8981;&#x5B83;&#x4EEC;&#x65F6;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002; &#x53EA;&#x8981;&#x4F60;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x503C;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x6D88;&#x5931;&#xFF0C;&#x7559;&#x4E0B;&#x5B83;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x4EE3;&#x503C;&#x7684;&#x5EFA;&#x7B51;&#x6750;&#x6599;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD; JavaScript &#x7A0B;&#x5E8F;&#x5F53;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x5143;&#x7D20;&#xFF0C;&#x5305;&#x62EC;&#x7B80;&#x5355;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x503C;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</p>
<h2 id="&#x6570;&#x5B57;">&#x6570;&#x5B57;</h2>
<p>&#x6570;&#x5B57;&#xFF08;<code>Number</code>&#xFF09;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x5373;&#x6570;&#x5B57;&#x503C;&#x3002;&#x5728; JavaScript &#x4E2D;&#x5199;&#x6210;&#x5982;&#x4E0B;&#x5F62;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-number">13</span>
</code></pre>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x5C06;&#x6570;&#x5B57; 13 &#x4EE5;&#x4F4D;&#x5E8F;&#x5217;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x653E;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x5F53;&#x4E2D;&#x3002;</p>
<p>JavaScript&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x4F4D;&#xFF08;64 &#x4F4D;&#xFF09;&#x6765;&#x5B58;&#x50A8;&#x5355;&#x4E2A;&#x6570;&#x5B57;&#x503C;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x7528; 64 &#x4F4D;&#x521B;&#x9020;&#x5F88;&#x591A;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x7684;&#x4E0D;&#x540C;&#x6570;&#x503C;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002; &#x5BF9;&#x4E8E;<code>N</code>&#x4E2A;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x7684;&#x6570;&#x503C;&#x6570;&#x91CF;&#x662F;<code>10^N</code>&#x3002; &#x4E0E;&#x4E4B;&#x7C7B;&#x4F3C;&#xFF0C;&#x7ED9;&#x5B9A; 64 &#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8868;&#x793A;<code>2^64</code>&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5927;&#x7EA6; 18 &#x4EBF;&#x4EBF;&#xFF08;18 &#x540E;&#x9762;&#x6709; 18 &#x4E2A;&#x96F6;&#xFF09;&#x3002;&#x592A;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x8FC7;&#x53BB;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x5B58;&#x5F88;&#x5C0F;&#xFF0C;&#x4EBA;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x4E00;&#x7EC4; 8 &#x4F4D;&#x6216; 16 &#x4F4D;&#x6765;&#x8868;&#x793A;&#x4ED6;&#x4EEC;&#x7684;&#x6570;&#x5B57;&#x3002; &#x8FD9;&#x4E48;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#x5F88;&#x5BB9;&#x6613;&#x610F;&#x5916;&#x5730;&#x6EA2;&#x51FA;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x6570;&#x5B57;&#x4E0D;&#x80FD;&#x653E;&#x5728;&#x7ED9;&#x5B9A;&#x7684;&#x4F4D;&#x6570;&#x4E2D;&#x3002; &#x4ECA;&#x5929;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x88C5;&#x5728;&#x53E3;&#x888B;&#x91CC;&#x7684;&#x7535;&#x8111;&#x4E5F;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x4F7F;&#x7528; 64 &#x4F4D;&#x7684;&#x5757;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x5904;&#x7406;&#x771F;&#x6B63;&#x7684;&#x5929;&#x6587;&#x6570;&#x5B57;&#x65F6;&#x624D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x6EA2;&#x51FA;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709; 18 &#x4EBF;&#x4EBF;&#x4EE5;&#x4E0B;&#x7684;&#x6574;&#x6570;&#x90FD;&#x80FD;&#x653E;&#x5728; JavaScript &#x6570;&#x503C;&#x4E2D;&#x3002; &#x8FD9;&#x4E9B;&#x4F4D;&#x4E5F;&#x5B58;&#x50A8;&#x8D1F;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x4F4D;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x6570;&#x5B57;&#x7684;&#x7B26;&#x53F7;&#x3002; &#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x8868;&#x793A;&#x975E;&#x6574;&#x6570;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x4E00;&#x4E9B;&#x4F4D;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5C0F;&#x6570;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x3002; &#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x7684;&#x5B9E;&#x9645;&#x6700;&#x5927;&#x6574;&#x6570;&#x66F4;&#x591A;&#x5730;&#x5728; 9000 &#x4E07;&#x4EBF;&#xFF08;15 &#x4E2A;&#x96F6;&#xFF09;&#x7684;&#x8303;&#x56F4;&#x5185; - &#x8FD9;&#x4ECD;&#x7136;&#x76F8;&#x5F53;&#x591A;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5C0F;&#x6570;&#x70B9;&#x6765;&#x8868;&#x793A;&#x5206;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-number">9.81</span>
</code></pre>
<p>&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x5927;&#x6216;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8F93;&#x5165;<code>e</code>&#xFF08;&#x8868;&#x793A;&#x6307;&#x6570;&#xFF09;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x6307;&#x6570;&#x6765;&#x4F7F;&#x7528;&#x79D1;&#x5B66;&#x8BB0;&#x6570;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-number">2.998e8</span>
</code></pre>
<p>&#x5373;<code>2.998 * 10^8 = 299,800,000</code>&#x3002;</p>
<p>&#x5F53;&#x8BA1;&#x7B97;&#x5C0F;&#x4E8E;&#x524D;&#x6587;&#x5F53;&#x4E2D;&#x63D0;&#x5230;&#x7684; 9000 &#x4E07;&#x4EBF;&#x7684;&#x6574;&#x6570;&#x65F6;&#xFF0C;&#x5176;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4F1A;&#x5341;&#x5206;&#x7CBE;&#x786E;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x8BA1;&#x7B97;&#x5C0F;&#x6570;&#x7684;&#x65F6;&#x5019;&#x7CBE;&#x5EA6;&#x5374;&#x4E0D;&#x9AD8;&#x3002;&#x6B63;&#x5982;&#xFF08;<code>pi</code>&#xFF09;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x6709;&#x9650;&#x4E2A;&#x6570;&#x7684;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x8868;&#x793A;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x4F7F;&#x7528; 64 &#x4F4D;&#x6765;&#x5B58;&#x50A8;&#x5206;&#x6570;&#x65F6;&#x4E5F;&#x540C;&#x6837;&#x4F1A;&#x4E22;&#x5931;&#x4E00;&#x4E9B;&#x7CBE;&#x5EA6;&#x3002;&#x867D;&#x8BF4;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x8FD9;&#x7C7B;&#x4E22;&#x5931;&#x7CBE;&#x5EA6;&#x53EA;&#x4F1A;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x5728;&#x5904;&#x7406;&#x5206;&#x6570;&#x65F6;&#xFF0C;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x8FD1;&#x4F3C;&#x503C;&#xFF0C;&#x800C;&#x975E;&#x7CBE;&#x786E;&#x503C;&#x3002;</p>
<h3 id="&#x7B97;&#x672F;">&#x7B97;&#x672F;</h3>
<p>&#x4E0E;&#x6570;&#x5B57;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x5C31;&#x662F;&#x7B97;&#x672F;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x52A0;&#x6CD5;&#x6216;&#x8005;&#x4E58;&#x6CD5;&#x4E4B;&#x7C7B;&#x7684;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x4F1A;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x5B57;&#x3002;JavaScript &#x4E2D;&#x7684;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-number">100</span> + <span class="hljs-number">4</span> * <span class="hljs-number">11</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x628A;<code>+</code>&#x548C;<code>*</code>&#x7B26;&#x53F7;&#x79F0;&#x4E3A;&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x8868;&#x793A;&#x52A0;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7B26;&#x53F7;&#x8868;&#x793A;&#x4E58;&#x6CD5;&#x3002;&#x5C06;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x7B26;&#x653E;&#x5728;&#x4E24;&#x4E2A;&#x503C;&#x4E4B;&#x95F4;&#xFF0C;&#x8BE5;&#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x4F1A;&#x4F7F;&#x7528;&#x5176;&#x65C1;&#x8FB9;&#x7684;&#x4E24;&#x4E2A;&#x503C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x610F;&#x601D;&#x662F;&#x201C;&#x5C06; 4 &#x548C; 100 &#x76F8;&#x52A0;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x4E58; 11&#x201D;&#xFF0C;&#x8FD8;&#x662F;&#x662F;&#x5728;&#x52A0;&#x6CD5;&#x4E4B;&#x524D;&#x8BA1;&#x7B97;&#x4E58;&#x6CD5;&#xFF1F; &#x6B63;&#x5982;&#x4F60;&#x53EF;&#x80FD;&#x731C;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4E58;&#x6CD5;&#x9996;&#x5148;&#x8BA1;&#x7B97;&#x3002; &#x4F46;&#x662F;&#x548C;&#x6570;&#x5B66;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x52A0;&#x6CD5;&#x5305;&#x5728;&#x5706;&#x62EC;&#x53F7;&#x4E2D;&#x6765;&#x6539;&#x53D8;&#x5B83;&#xFF1A;</p>
<pre><code class="lang-js">(<span class="hljs-number">100</span> + <span class="hljs-number">4</span>) * <span class="hljs-number">11</span>
</code></pre>
<p><code>&#x2013;</code>&#x8FD0;&#x7B97;&#x7B26;&#x8868;&#x793A;&#x51CF;&#x6CD5;&#xFF0C;<code>/</code>&#x8FD0;&#x7B97;&#x7B26;&#x5219;&#x8868;&#x793A;&#x9664;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x8FD0;&#x7B97;&#x7B26;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x62EC;&#x53F7;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x8FD0;&#x7B97;&#x987A;&#x5E8F;&#x6839;&#x636E;&#x8FD0;&#x7B97;&#x7B26;&#x4F18;&#x5148;&#x7EA7;&#x786E;&#x5B9A;&#x3002;&#x793A;&#x4F8B;&#x4E2D;&#x7684;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x7B26;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x4E8E;&#x52A0;&#x6CD5;&#x3002;&#x800C;<code>/</code>&#x8FD0;&#x7B97;&#x7B26;&#x548C;<code>*</code>&#x8FD0;&#x7B97;&#x7B26;&#x4F18;&#x5148;&#x7EA7;&#x76F8;&#x540C;&#xFF0C;<code>+</code>&#x8FD0;&#x7B97;&#x7B26;&#x548C;<code>&#x2013;</code>&#x8FD0;&#x7B97;&#x7B26;&#x4F18;&#x5148;&#x7EA7;&#x4E5F;&#x76F8;&#x540C;&#x3002;&#x5F53;&#x591A;&#x4E2A;&#x5177;&#x6709;&#x76F8;&#x540C;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x76F8;&#x90BB;&#x51FA;&#x73B0;&#x65F6;&#xFF0C;&#x8FD0;&#x7B97;&#x4ECE;&#x5DE6;&#x5411;&#x53F3;&#x6267;&#x884C;&#xFF0C;&#x6BD4;&#x5982;<code>1&#x2013;2+1</code>&#x7684;&#x8FD0;&#x7B97;&#x987A;&#x5E8F;&#x662F;<code>(1&#x2013;2)+1</code>&#x3002;</p>
<p>&#x4F60;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x8FD9;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x89C4;&#x5219;&#xFF0C;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x62EC;&#x53F7;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x7ACB;&#x5373;&#x8BA4;&#x51FA;&#x3002; <code>%</code>&#x7B26;&#x53F7;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x53D6;&#x4F59;&#x64CD;&#x4F5C;&#x3002; <code>X % Y</code>&#x662F;<code>Y</code>&#x9664;<code>X</code>&#x7684;&#x4F59;&#x6570;&#x3002; &#x4F8B;&#x5982;&#xFF0C;<code>314 % 100</code>&#x4EA7;&#x751F;<code>14</code>&#xFF0C;<code>144 % 12</code>&#x4EA7;&#x751F;<code>0</code>&#x3002; &#x4F59;&#x6570;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E0E;&#x4E58;&#x6CD5;&#x548C;&#x9664;&#x6CD5;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x76F8;&#x540C;&#x3002; &#x4F60;&#x8FD8;&#x7ECF;&#x5E38;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x8FD0;&#x7B97;&#x7B26;&#x88AB;&#x79F0;&#x4E3A;&#x6A21;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</p>
<h3 id="&#x7279;&#x6B8A;&#x6570;&#x5B57;">&#x7279;&#x6B8A;&#x6570;&#x5B57;</h3>
<p>&#x5728; JavaScript &#x4E2D;&#x6709;&#x4E09;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x503C;&#xFF0C;&#x5B83;&#x4EEC;&#x867D;&#x7136;&#x662F;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x770B;&#x8D77;&#x6765;&#x5374;&#x8DDF;&#x4E00;&#x822C;&#x7684;&#x6570;&#x5B57;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x524D;&#x4E24;&#x4E2A;&#x662F;<code>Infinity</code>&#x548C;<code>-Infinity</code>&#xFF0C;&#x5B83;&#x4EEC;&#x4EE3;&#x8868;&#x6B63;&#x65E0;&#x7A77;&#x548C;&#x8D1F;&#x65E0;&#x7A77;&#x3002; &#x201C;&#x65E0;&#x7A77;&#x51CF;&#x4E00;&#x201D;&#x4ECD;&#x7136;&#x662F;&#x201C;&#x65E0;&#x7A77;&#x201D;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002; &#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4E0D;&#x8981;&#x8FC7;&#x5206;&#x4FE1;&#x4EFB;&#x57FA;&#x4E8E;&#x65E0;&#x7A77;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x3002; &#x5B83;&#x5728;&#x6570;&#x5B66;&#x4E0A;&#x4E0D;&#x5408;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x5FEB;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x6570;&#x5B57;&#xFF1A;<code>NaN</code>&#x3002;</p>
<p><code>NaN</code>&#x4EE3;&#x8868;&#x201C;&#x4E0D;&#x662F;&#x6570;&#x5B57;&#x201D;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x662F;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x4F60;&#x5C1D;&#x8BD5;&#x8BA1;&#x7B97;<code>0/0</code>&#xFF08;&#x96F6;&#x9664;&#x96F6;&#xFF09;&#xFF0C;<code>Infinity - Infinity</code>&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6570;&#x5B57;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x4F60;&#x5C06;&#x5F97;&#x5230;&#x6B64;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x5B57;&#x7B26;&#x4E32;">&#x5B57;&#x7B26;&#x4E32;</h2>
<p>&#x4E0B;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF08;<code>String</code>&#xFF09;&#x3002; &#x5B57;&#x7B26;&#x4E32;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x6587;&#x672C;&#x3002; &#x5B83;&#x4EEC;&#x662F;&#x7528;&#x5F15;&#x53F7;&#x62EC;&#x8D77;&#x6765;&#x7684;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-string">`Down on the sea`</span>
<span class="hljs-string">&quot;Lie on the ocean&quot;</span>
<span class="hljs-string">&apos;Float on the ocean&apos;</span>
</code></pre>
<p>&#x53EA;&#x8981;&#x5B57;&#x7B26;&#x4E32;&#x5F00;&#x5934;&#x548C;&#x7ED3;&#x5C3E;&#x7684;&#x5F15;&#x53F7;&#x5339;&#x914D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x5F15;&#x53F7;&#xFF0C;&#x53CC;&#x5F15;&#x53F7;&#x6216;&#x53CD;&#x5F15;&#x53F7;&#x6765;&#x6807;&#x8BB0;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x5F15;&#x53F7;&#x4E4B;&#x95F4;&#xFF0C;&#x5E76;&#x4E14; JavaScript &#x4F1A;&#x4ECE;&#x4E2D;&#x63D0;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002; &#x4F46;&#x5C11;&#x6570;&#x5B57;&#x7B26;&#x66F4;&#x96BE;&#x3002; &#x4F60;&#x53EF;&#x80FD;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x5F15;&#x53F7;&#x4E4B;&#x95F4;&#x52A0;&#x5F15;&#x53F7;&#x3002; &#x5F53;&#x4F7F;&#x7528;&#x53CD;&#x5F15;&#x53F7;&#xFF08;<code>` </code>&#xFF09;&#x5F15;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;&#x6362;&#x884C;&#x7B26;&#xFF08;&#x5F53;&#x4F60;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x65F6;&#x83B7;&#x5F97;&#x7684;&#x5B57;&#x7B26;&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5305;&#x542B;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x8F6C;&#x4E49;&#x3002;</p>
<p>&#x82E5;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x5B58;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E0B;&#x5217;&#x89C4;&#x5219;&#xFF1A;&#x5F53;&#x53CD;&#x659C;&#x6760;&#xFF08;<code>\</code>&#xFF09;&#x51FA;&#x73B0;&#x5728;&#x5F15;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x6587;&#x672C;&#x4E2D;&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x7D27;&#x8DDF;&#x5728;&#x5176;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x5177;&#x6709;&#x7279;&#x6B8A;&#x542B;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x79F0;&#x4E4B;&#x4E3A;&#x8F6C;&#x4E49;&#x7B26;&#x3002;&#x5F53;&#x5F15;&#x53F7;&#x7D27;&#x8DDF;&#x5728;&#x53CD;&#x659C;&#x6760;&#x540E;&#x65F6;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B57;&#x7B26;&#x4E32;&#x7ED3;&#x675F;&#xFF0C;&#x800C;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x5F15;&#x53F7;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5F53;&#x5B57;&#x7B26;<code>n</code>&#x51FA;&#x73B0;&#x5728;&#x53CD;&#x659C;&#x6760;&#x540E;&#x65F6;&#xFF0C;JavaScript &#x5C06;&#x5176;&#x89E3;&#x91CA;&#x6210;&#x6362;&#x884C;&#x7B26;&#x3002;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;<code>\t</code>&#x8868;&#x793A;&#x5236;&#x8868;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-string">&quot;This is the first line\nAnd this is the second&quot;</span>
</code></pre>
<p>&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x5B9E;&#x9645;&#x8868;&#x793A;&#x7684;&#x6587;&#x672C;&#x662F;&#xFF1A;</p>
<pre><code>This is the first line
And this is the second
</code></pre><p>&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x53CD;&#x659C;&#x6760;&#x53EA;&#x662F;&#x53CD;&#x659C;&#x6760;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7279;&#x6B8A;&#x4EE3;&#x7801;&#x3002; &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x53CD;&#x659C;&#x6760;&#x5199;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x5408;&#x5E76;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5C06;&#x7559;&#x5728;&#x7ED3;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x4E2D;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x201C;<code>A newline character is written like &quot;\n&quot;.</code>&#x201D;&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-string">&quot;A newline character is written like \&quot;\\n\&quot;.&quot;</span>
</code></pre>
<p>&#x5B57;&#x7B26;&#x4E32;&#x4E5F;&#x5FC5;&#x987B;&#x5EFA;&#x6A21;&#x4E3A;&#x4E00;&#x7CFB;&#x5217;&#x4F4D;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x591F;&#x5B58;&#x5728;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#x3002; JavaScript &#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x57FA;&#x4E8E; Unicode &#x6807;&#x51C6;&#x3002; &#x8BE5;&#x6807;&#x51C6;&#x4E3A;&#x4F60;&#x51E0;&#x4E4E;&#x9700;&#x8981;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5305;&#x62EC;&#x6765;&#x81EA;&#x5E0C;&#x814A;&#x8BED;&#xFF0C;&#x963F;&#x62C9;&#x4F2F;&#x8BED;&#xFF0C;&#x65E5;&#x8BED;&#xFF0C;&#x4E9A;&#x7F8E;&#x5C3C;&#x4E9A;&#x8BED;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7684;&#x5B57;&#x7B26;&#x3002; &#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x6570;&#x5B57;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F; JavaScript &#x6240;&#x505A;&#x7684;&#x3002; &#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF1A;JavaScript &#x7684;&#x8868;&#x793A;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5143;&#x7D20;&#x4F7F;&#x7528; 16 &#x4F4D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x591A;&#x8FBE; 2 &#x7684; 16 &#x6B21;&#x65B9;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x7B26;&#x3002; &#x4F46;&#x662F;&#xFF0C;Unicode &#x5B9A;&#x4E49;&#x7684;&#x5B57;&#x7B26;&#x591A;&#x4E8E;&#x6B64; - &#x5927;&#x7EA6;&#x662F;&#x6B64;&#x5904;&#x7684;&#x4E24;&#x500D;&#x3002; &#x6240;&#x4EE5;&#x6709;&#x4E9B;&#x5B57;&#x7B26;&#xFF0C;&#x6BD4;&#x5982;&#x8BB8;&#x591A; emoji&#xFF0C;&#x5728; JavaScript &#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x5360;&#x636E;&#x4E86;&#x4E24;&#x4E2A;&#x201C;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E;&#x201D;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 5 &#x7AE0;&#x4E2D;&#x56DE;&#x6765;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5C06;&#x9664;&#x6CD5;&#xFF0C;&#x4E58;&#x6CD5;&#x6216;&#x51CF;&#x6CD5;&#x8FD0;&#x7B97;&#x7B26;&#x7528;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F46;&#x662F;<code>+</code>&#x8FD0;&#x7B97;&#x7B26;&#x5374;&#x53EF;&#x4EE5;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD0;&#x7B97;&#x7B26;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x52A0;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x8FDE;&#x63A5;&#x64CD;&#x4F5C;&#xFF1A;&#x5C06;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#x5230;&#x4E00;&#x8D77;&#x3002;&#x4EE5;&#x4E0B;&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x5B57;&#x7B26;&#x4E32;<code>&quot;concatenate&quot;</code>&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-string">&quot;con&quot;</span> + <span class="hljs-string">&quot;cat&quot;</span> + <span class="hljs-string">&quot;e&quot;</span> + <span class="hljs-string">&quot;nate&quot;</span>
</code></pre>
<p>&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x6709;&#x8BB8;&#x591A;&#x76F8;&#x5173;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5BF9;&#x5B83;&#x4EEC;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x56DE;&#x6765;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x7528;&#x5355;&#x5F15;&#x53F7;&#x6216;&#x53CC;&#x5F15;&#x53F7;&#x7F16;&#x5199;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x884C;&#x4E3A;&#x975E;&#x5E38;&#x76F8;&#x4F3C; - &#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#x662F;&#x9700;&#x8981;&#x5728;&#x5176;&#x4E2D;&#x8F6C;&#x4E49;&#x54EA;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5F15;&#x53F7;&#x3002; &#x53CD;&#x5F15;&#x53F7;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x6A21;&#x677F;&#x5B57;&#x9762;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x66F4;&#x591A;&#x7684;&#x6280;&#x5DE7;&#x3002; &#x9664;&#x4E86;&#x80FD;&#x591F;&#x8DE8;&#x8D8A;&#x884C;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x5D4C;&#x5165;&#x5176;&#x4ED6;&#x503C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-string">`half of 100 is <span class="hljs-subst">${100 / 2}</span>`</span>
</code></pre>
<p>&#x5F53;&#x4F60;&#x5728;&#x6A21;&#x677F;&#x5B57;&#x9762;&#x503C;&#x4E2D;&#x7684;<code>$ {}</code>&#x4E2D;&#x5199;&#x5165;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x5C06;&#x8BA1;&#x7B97;&#x5176;&#x7ED3;&#x679C;&#xFF0C;&#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x5305;&#x542B;&#x5728;&#x8BE5;&#x4F4D;&#x7F6E;&#x3002; &#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4EA7;&#x751F;<code>&quot;half of 100 is 50&quot;</code>&#x3002;</p>
<h2 id="&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;">&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;</h2>
<p>&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x90FD;&#x662F;&#x7528;&#x7B26;&#x53F7;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x662F;&#x7528;&#x5355;&#x8BCD;&#x8868;&#x793A;&#x7684;&#x3002;&#x6BD4;&#x5982;<code>typeof</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x503C;&#xFF0C;&#x5185;&#x5BB9;&#x662F;&#x7ED9;&#x5B9A;&#x503C;&#x7684;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> <span class="hljs-number">4.5</span>)
<span class="hljs-comment">// &#x2192; number</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> <span class="hljs-string">&quot;x&quot;</span>)
<span class="hljs-comment">// &#x2192; string</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;<code>console.log</code>&#xFF0C;&#x6765;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x6C42;&#x503C;&#x7ED3;&#x679C;&#x3002;&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x8BF7;&#x89C1;&#x4E0B;&#x4E00;&#x7AE0;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6240;&#x89C1;&#x8FC7;&#x7684;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8FD0;&#x7B97;&#x7B26;&#x90FD;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x503C;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;<code>typeof</code>&#x4EC5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x503C;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x503C;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x79F0;&#x4E3A;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x5219;&#x79F0;&#x4E3A;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x51CF;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#x65E2;&#x53EF;&#x7528;&#x4F5C;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4E5F;&#x53EF;&#x7528;&#x4F5C;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(- (<span class="hljs-number">10</span> - <span class="hljs-number">2</span>))
<span class="hljs-comment">// &#x2192; -8</span>
</code></pre>
<h2 id="&#x5E03;&#x5C14;&#x503C;">&#x5E03;&#x5C14;&#x503C;</h2>
<p>&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5B83;&#x80FD;&#x533A;&#x5206;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x662F;&#x201D;&#x548C;&#x201C;&#x5426;&#x201D;&#x6216;&#x201C;&#x5F00;&#x201D;&#x548C;&#x201C;&#x5173;&#x201D;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;JavaScript &#x62E5;&#x6709;&#x5E03;&#x5C14;&#xFF08;<code>Boolean</code>&#xFF09;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x503C;&#xFF1A;<code>true</code>&#x548C;<code>false</code>&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x5199;&#x6210;&#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#x3002;</p>
<h3 id="&#x6BD4;&#x8F83;">&#x6BD4;&#x8F83;</h3>
<p>&#x4E00;&#x79CD;&#x4EA7;&#x751F;&#x5E03;&#x5C14;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">3</span> &gt; <span class="hljs-number">2</span>)
<span class="hljs-comment">// &#x2192; true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">3</span> &lt; <span class="hljs-number">2</span>)
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p><code>&gt;</code>&#x548C;<code>&lt;</code>&#x7B26;&#x53F7;&#x5206;&#x522B;&#x8868;&#x793A;&#x201C;&#x5927;&#x4E8E;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x4E8E;&#x201D;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x7B26;&#x53F7;&#x662F;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x901A;&#x8FC7;&#x8BE5;&#x8FD0;&#x7B97;&#x7B26;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x8868;&#x793A;&#x5176;&#x8FD0;&#x7B97;&#x662F;&#x5426;&#x4E3A;&#x771F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Aardvark&quot;</span> &lt; <span class="hljs-string">&quot;Zoroaster&quot;</span>)
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>
<p>&#x5B57;&#x7B26;&#x4E32;&#x6392;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x5927;&#x81F4;&#x662F;&#x5B57;&#x5178;&#x5E8F;&#xFF0C;&#x4F46;&#x4E0D;&#x771F;&#x6B63;&#x662F;&#x4F60;&#x671F;&#x671B;&#x4ECE;&#x5B57;&#x5178;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF1A;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x603B;&#x662F;&#x6BD4;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x201C;&#x5C0F;&#x201D;&#xFF0C;&#x6240;&#x4EE5;<code>&quot;Z&quot;&lt;&quot;a&quot;</code>&#xFF0C;&#x975E;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#xFF08;<code>!</code>&#xFF0C;<code>-</code>&#x7B49;&#xFF09;&#x4E5F;&#x5305;&#x542B;&#x5728;&#x6392;&#x5E8F;&#x4E2D;&#x3002; &#x6BD4;&#x8F83;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;JavaScript &#x4ECE;&#x5DE6;&#x5411;&#x53F3;&#x904D;&#x5386;&#x5B57;&#x7B26;&#xFF0C;&#x9010;&#x4E2A;&#x6BD4;&#x8F83; Unicode &#x4EE3;&#x7801;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x7C7B;&#x4F3C;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x5219;&#x5305;&#x62EC;<code>&gt;=</code>&#xFF08;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;&#xFF09;&#xFF0C;<code>&lt;=</code>&#xFF08;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;&#xFF09;&#xFF0C;<code>==</code>&#xFF08;&#x7B49;&#x4E8E;&#xFF09;&#x548C;<code>!=</code>&#xFF08;&#x4E0D;&#x7B49;&#x4E8E;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Apple&quot;</span> == <span class="hljs-string">&quot;Orange&quot;</span>)
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p>&#x5728; JavaScript &#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x503C;&#x4E0D;&#x7B49;&#x4E8E;&#x5176;&#x81EA;&#x8EAB;&#xFF0C;&#x90A3;&#x5C31;&#x662F;<code>NaN</code>&#xFF08;Not a Number&#xFF0C;&#x975E;&#x6570;&#x503C;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-literal">NaN</span> == <span class="hljs-literal">NaN</span>)
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p><code>NaN</code>&#x7528;&#x4E8E;&#x8868;&#x793A;&#x975E;&#x6CD5;&#x8FD0;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6B63;&#x56E0;&#x5982;&#x6B64;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x975E;&#x6CD5;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x4E5F;&#x4E0D;&#x4F1A;&#x76F8;&#x7B49;&#x3002;</p>
<h3 id="&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;">&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;</h3>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x5E03;&#x5C14;&#x503C;&#x4E0A;&#x3002;JavaScript &#x652F;&#x6301;&#x4E09;&#x79CD;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x4E0E;&#xFF08;and&#xFF09;&#xFF0C;&#x6216;&#xFF08;or&#xFF09;&#x548C;&#x975E;&#xFF08;not&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x63A8;&#x7406;&#x5E03;&#x5C14;&#x503C;&#x3002;</p>
<p><code>&amp;&amp;</code>&#x8FD0;&#x7B97;&#x7B26;&#x8868;&#x793A;&#x903B;&#x8F91;&#x4E0E;&#xFF0C;&#x8BE5;&#x8FD0;&#x7B97;&#x7B26;&#x662F;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x8D4B;&#x7ED9;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x503C;&#x5747;&#x4E3A;<code>true</code>&#x65F6;&#x5176;&#x7ED3;&#x679C;&#x624D;&#x662F;&#x771F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-literal">true</span> &amp;&amp; <span class="hljs-literal">false</span>)
<span class="hljs-comment">// &#x2192; false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">true</span> &amp;&amp; <span class="hljs-literal">true</span>)
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>
<p><code>||</code>&#x8FD0;&#x7B97;&#x7B26;&#x8868;&#x793A;&#x903B;&#x8F91;&#x6216;&#x3002;&#x5F53;&#x4E24;&#x4E2A;&#x503C;&#x4E2D;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x4E3A;<code>true</code>&#x65F6;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x4E3A;&#x771F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-literal">false</span> || <span class="hljs-literal">true</span>)
<span class="hljs-comment">// &#x2192; true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">false</span> || <span class="hljs-literal">false</span>)
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p>&#x611F;&#x53F9;&#x53F7;&#xFF08;<code>!</code>&#xFF09;&#x8868;&#x793A;&#x903B;&#x8F91;&#x975E;&#xFF0C;&#x8BE5;&#x8FD0;&#x7B97;&#x7B26;&#x662F;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x7528;&#x4E8E;&#x53CD;&#x8F6C;&#x7ED9;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;<code>!true</code>&#x7684;&#x7ED3;&#x679C;&#x662F;<code>false</code>&#xFF0C;&#x800C;<code>!false</code>&#x7ED3;&#x679C;&#x662F;<code>true</code>&#x3002;</p>
<p>&#x5728;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x5E03;&#x5C14;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x5176;&#x4ED6;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x603B;&#x662F;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x62EC;&#x53F7;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53EA;&#x8981;&#x719F;&#x6089;&#x4E86;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x4E0D;&#x96BE;&#x89E3;&#x51B3;&#x4E86;&#x3002;<code>||</code>&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x4F4E;&#xFF0C;&#x5176;&#x6B21;&#x662F;<code>&amp;&amp;</code>&#xFF0C;&#x63A5;&#x7740;&#x662F;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<code>&gt;</code>&#xFF0C;<code>==</code>&#x7B49;&#xFF09;&#xFF0C;&#x6700;&#x540E;&#x662F;&#x5176;&#x4ED6;&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x4F18;&#x5148;&#x7EA7;&#x987A;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x5C3D;&#x91CF;&#x5C11;&#x7528;&#x62EC;&#x53F7;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-number">1</span> + <span class="hljs-number">1</span> == <span class="hljs-number">2</span> &amp;&amp; <span class="hljs-number">10</span> * <span class="hljs-number">10</span> &gt; <span class="hljs-number">50</span>
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x8BA8;&#x8BBA;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5B83;&#x65E2;&#x4E0D;&#x5C5E;&#x4E8E;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4E5F;&#x4E0D;&#x5C5E;&#x4E8E;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x800C;&#x662F;&#x4E09;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x540C;&#x65F6;&#x64CD;&#x4F5C;&#x4E09;&#x4E2A;&#x503C;&#xFF09;&#x3002;&#x8BE5;&#x8FD0;&#x7B97;&#x7B26;&#x7531;&#x4E00;&#x4E2A;&#x95EE;&#x53F7;&#x548C;&#x5192;&#x53F7;&#x7EC4;&#x6210;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-literal">true</span> ? <span class="hljs-number">1</span> : <span class="hljs-number">2</span>);
<span class="hljs-comment">// &#x2192; 1</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">false</span> ? <span class="hljs-number">1</span> : <span class="hljs-number">2</span>);
<span class="hljs-comment">// &#x2192; 2</span>
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x6761;&#x4EF6;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x6216;&#x8005;&#x6709;&#x65F6;&#x5019;&#x53EA;&#x662F;&#x4E09;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x8BE5;&#x8BED;&#x8A00;&#x4E2D;&#x552F;&#x4E00;&#x7684;&#x8FD9;&#x6837;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#xFF09;&#x3002; &#x95EE;&#x53F7;&#x5DE6;&#x4FA7;&#x7684;&#x503C;&#x201C;&#x6311;&#x9009;&#x201D;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x503C;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x3002; &#x5F53;&#x5B83;&#x4E3A;&#x771F;&#xFF0C;&#x5B83;&#x9009;&#x62E9;&#x4E2D;&#x95F4;&#x7684;&#x503C;&#xFF0C;&#x5F53;&#x5B83;&#x4E3A;&#x5047;&#xFF0C;&#x5219;&#x662F;&#x53F3;&#x8FB9;&#x7684;&#x503C;&#x3002;</p>
<h2 id="&#x7A7A;&#x503C;">&#x7A7A;&#x503C;</h2>
<p>&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x6B8A;&#x503C;&#xFF0C;&#x5199;&#x6210;<code>null</code>&#x548C;<code>undefined</code>&#xFF0C;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x4E0D;&#x5B58;&#x5728;&#x6709;&#x610F;&#x4E49;&#x7684;&#x503C;&#x3002; &#x5B83;&#x4EEC;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x503C;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5728; JavaScript &#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x503C;&#xFF08;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x4E2D;&#x770B;&#x5230;&#x5B9E;&#x4F8B;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x4F1A;&#x5F97;&#x5230;<code>undefined</code>&#x7684;&#x7ED3;&#x679C;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;&#x90FD;&#x5FC5;&#x987B;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#x3002;</p>
<p><code>undefined</code>&#x548C;<code>null</code>&#x4E4B;&#x95F4;&#x7684;&#x610F;&#x4E49;&#x5DEE;&#x5F02;&#x662F; JavaScript &#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x610F;&#x5916;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x5B83;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002; &#x5728;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x5F97;&#x4E0D;&#x5173;&#x6CE8;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x5C06;&#x5B83;&#x4EEC;&#x89C6;&#x4E3A;&#x51E0;&#x4E4E;&#x53EF;&#x4E92;&#x6362;&#x7684;&#x3002;</p>
<h2 id="&#x81EA;&#x52A8;&#x7C7B;&#x578B;&#x8F6C;&#x6362;">&#x81EA;&#x52A8;&#x7C7B;&#x578B;&#x8F6C;&#x6362;</h2>
<p>&#x5728;&#x5F15;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x63D0;&#x5230; JavaScript &#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x63A5;&#x53D7;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F60;&#x7ED9;&#x4ED6;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x90A3;&#x4E9B;&#x505A;&#x4E9B;&#x5947;&#x602A;&#x4E8B;&#x60C5;&#x7684;&#x7A0B;&#x5E8F;&#x3002; &#x4EE5;&#x4E0B;&#x8868;&#x8FBE;&#x5F0F;&#x5F88;&#x597D;&#x5730;&#x8BC1;&#x660E;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">8</span> * <span class="hljs-literal">null</span>)
<span class="hljs-comment">// &#x2192; 0</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;5&quot;</span> - <span class="hljs-number">1</span>)
<span class="hljs-comment">// &#x2192; 4</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;5&quot;</span> + <span class="hljs-number">1</span>)
<span class="hljs-comment">// &#x2192; 51</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;five&quot;</span> * <span class="hljs-number">2</span>)
<span class="hljs-comment">// &#x2192; NaN</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">false</span> == <span class="hljs-number">0</span>)
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>
<p>&#x5F53;&#x8FD0;&#x7B97;&#x7B26;&#x5E94;&#x7528;&#x4E8E;&#x7C7B;&#x578B;&#x201C;&#x9519;&#x8BEF;&#x201D;&#x7684;&#x503C;&#x65F6;&#xFF0C;JavaScript &#x4F1A;&#x6084;&#x6084;&#x5730;&#x5C06;&#x8BE5;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x6240;&#x9700;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E00;&#x7EC4;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x6216;&#x671F;&#x671B;&#x7684;&#x89C4;&#x5219;&#x3002; &#x8FD9;&#x79F0;&#x4E3A;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;<code>null</code>&#x53D8;&#x4E3A;<code>0</code>&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;<code>&quot;5&quot;</code>&#x53D8;&#x4E3A;<code>5</code>&#xFF08;&#x4ECE;&#x5B57;&#x7B26;&#x4E32;&#x5230;&#x6570;&#x5B57;&#xFF09;&#x3002; &#x7136;&#x800C;&#x5728;&#x7B2C;&#x4E09;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#xFF0C;<code>+</code>&#x5728;&#x6570;&#x5B57;&#x52A0;&#x6CD5;&#x4E4B;&#x524D;&#x5C1D;&#x8BD5;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x4EE5;<code>1</code>&#x88AB;&#x8F6C;&#x6362;&#x4E3A;<code>&quot;1&quot;</code>&#xFF08;&#x4ECE;&#x6570;&#x5B57;&#x5230;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x67D0;&#x4E9B;&#x4E0D;&#x80FD;&#x660E;&#x663E;&#x6620;&#x5C04;&#x4E3A;&#x6570;&#x5B57;&#x7684;&#x4E1C;&#x897F;&#xFF08;&#x5982;<code>&quot;five&quot;</code>&#x6216;<code>undefined</code>&#xFF09;&#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x5B57;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x503C;<code>NaN</code>&#x3002; <code>NaN</code>&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x4F1A;&#x4EA7;&#x751F;<code>NaN</code>&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x4E00;&#x4E2A;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x5730;&#x65B9;&#x5F97;&#x5230;&#x4E86;&#x5B83;&#xFF0C;&#x9700;&#x8981;&#x5BFB;&#x627E;&#x610F;&#x5916;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x5F53;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;<code>==</code>&#x7B26;&#x53F7;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x65F6;&#xFF0C;&#x5176;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x5F88;&#x597D;&#x9884;&#x6D4B;&#xFF1A;&#x9664;&#x4E86;<code>NaN</code>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x8981;&#x4E24;&#x4E2A;&#x503C;&#x76F8;&#x540C;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;<code>true</code>&#x3002;&#x4F46;&#x5982;&#x679C;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;JavaScript &#x5219;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x5957;&#x590D;&#x6742;&#x96BE;&#x61C2;&#x7684;&#x89C4;&#x5219;&#x6765;&#x786E;&#x5B9A;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;JavaScript &#x53EA;&#x662F;&#x5C06;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x503C;&#x8F6C;&#x6362;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x5982;&#x679C;&#x8FD0;&#x7B97;&#x7B26;&#x4E24;&#x4FA7;&#x5B58;&#x5728;<code>null</code>&#x6216;<code>undefined</code>&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x6709;&#x4E24;&#x4FA7;&#x5747;&#x4E3A;<code>null</code>&#x6216;<code>undefined</code>&#x65F6;&#x7ED3;&#x679C;&#x624D;&#x4E3A;<code>true</code>&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-literal">null</span> == <span class="hljs-literal">undefined</span>);
<span class="hljs-comment">// &#x2192; true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">null</span> == <span class="hljs-number">0</span>);
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p>&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x901A;&#x5E38;&#x5F88;&#x6709;&#x7528;&#x3002; &#x5F53;&#x4F60;&#x60F3;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x5426;&#x5177;&#x6709;&#x771F;&#x503C;&#x800C;&#x4E0D;&#x662F;<code>null</code>&#x6216;<code>undefined</code>&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;<code>==</code>&#xFF08;&#x6216;<code>!=</code>&#xFF09;&#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x5B83;&#x4E0E;<code>null</code>&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6D4B;&#x8BD5;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x5426;&#x4E25;&#x683C;&#x4E3A;&#x201C;false&#x201D;&#x5462;&#xFF1F; &#x5B57;&#x7B26;&#x4E32;&#x548C;&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x4E3A;&#x5E03;&#x5C14;&#x503C;&#x7684;&#x89C4;&#x5219;&#x8868;&#x660E;&#xFF0C;<code>0</code>&#xFF0C;<code>NaN</code>&#x548C;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF08;<code>&quot;&quot;</code>&#xFF09;&#x8BA1;&#x4E3A;<code>false</code>&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x503C;&#x90FD;&#x8BA1;&#x4E3A;<code>true</code>&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x50CF;<code>&apos;0 == false&apos;</code>&#x548C;<code>&quot;&quot; == false</code>&#x8FD9;&#x6837;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x662F;&#x771F;&#x7684;&#x3002; &#x5F53;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x53D1;&#x751F;&#x81EA;&#x52A8;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x65F6;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;<code>===</code>&#x548C;<code>!==</code>&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x662F;&#x5426;&#x4E25;&#x683C;&#x7B49;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6D4B;&#x8BD5;&#x5B83;&#x662F;&#x5426;&#x4E0D;&#x4E25;&#x683C;&#x76F8;&#x7B49;&#x3002; &#x6240;&#x4EE5;<code>&quot;&quot; === false</code>&#x5982;&#x9884;&#x671F;&#x90A3;&#x6837;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;</p>
<p>&#x6211;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x4E09;&#x5B57;&#x7B26;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x9632;&#x6B62;&#x610F;&#x5916;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x907F;&#x514D;&#x4F5C;&#x8327;&#x81EA;&#x7F1A;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;&#x4E24;&#x4FA7;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x8F83;&#x77ED;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x4E5F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x77ED;&#x8DEF;&#x7279;&#x6027;">&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x77ED;&#x8DEF;&#x7279;&#x6027;</h3>
<p>&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;<code>&amp;&amp;</code>&#x548C;<code>||</code>&#x4EE5;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002; &#x4ED6;&#x4EEC;&#x4F1A;&#x5C06;&#x5176;&#x5DE6;&#x4FA7;&#x7684;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x5E03;&#x5C14;&#x578B;&#xFF0C;&#x6765;&#x51B3;&#x5B9A;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x6839;&#x636E;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x8F6C;&#x6362;&#x7ED3;&#x679C;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x8FD4;&#x56DE;&#x539F;&#x59CB;&#x7684;&#x5DE6;&#x4FA7;&#x503C;&#x6216;&#x53F3;&#x4FA7;&#x503C;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x5DE6;&#x4FA7;&#x503C;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x4E3A;<code>true</code>&#x65F6;&#xFF0C;<code>||</code>&#x8FD0;&#x7B97;&#x7B26;&#x4F1A;&#x8FD4;&#x56DE;&#x5B83;&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;&#x53F3;&#x4FA7;&#x503C;&#x3002; &#x5F53;&#x503C;&#x4E3A;&#x5E03;&#x5C14;&#x503C;&#x65F6;&#xFF0C;&#x8FD9;&#x5177;&#x6709;&#x9884;&#x671F;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x505A;&#x7C7B;&#x4F3C;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-literal">null</span> || <span class="hljs-string">&quot;user&quot;</span>)
<span class="hljs-comment">// &#x2192; user</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Agnes&quot;</span> || <span class="hljs-string">&quot;user&quot;</span>)
<span class="hljs-comment">// &#x2192; Agnes</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6B64;&#x529F;&#x80FD;&#x7528;&#x4F5C;&#x56DE;&#x843D;&#x5230;&#x9ED8;&#x8BA4;&#x503C;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x5982;&#x679C;&#x4F60;&#x7684;&#x4E00;&#x4E2A;&#x503C;&#x53EF;&#x80FD;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;<code>||</code>&#x548C;&#x5907;&#x9009;&#x503C;&#x653E;&#x5728;&#x5B83;&#x4E4B;&#x540E;&#x3002; &#x5982;&#x679C;&#x521D;&#x59CB;&#x503C;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x4E3A;<code>false</code>&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C06;&#x5F97;&#x5230;&#x5907;&#x9009;&#x503C;&#x3002;</p>
<p><code>&amp;&amp;</code>&#x8FD0;&#x7B97;&#x7B26;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4E0E;&#x5176;&#x76F8;&#x4F3C;&#x4F46;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x5F53;&#x5DE6;&#x4FA7;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x88AB;&#x8F6C;&#x6362;&#x6210;<code>false</code>&#x65F6;&#xFF0C;<code>&amp;&amp;</code>&#x8FD0;&#x7B97;&#x7B26;&#x4F1A;&#x8FD4;&#x56DE;&#x5DE6;&#x4FA7;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;&#x53F3;&#x4FA7;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x6027;&#x662F;&#xFF0C;&#x53EA;&#x5728;&#x5FC5;&#x8981;&#x65F6;&#x6C42;&#x89E3;&#x5176;&#x53F3;&#x4FA7;&#x7684;&#x90E8;&#x5206;&#x3002; &#x5728;<code>true || X</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x7BA1;<code>X</code>&#x662F;&#x4EC0;&#x4E48; - &#x5373;&#x4F7F;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x6076;&#x610F;&#x64CD;&#x4F5C;&#x7684;&#x7A0B;&#x5E8F;&#x7247;&#x6BB5;&#xFF0C;&#x7ED3;&#x679C;&#x90FD;&#x662F;<code>true</code>&#xFF0C;&#x5E76;&#x4E14;<code>X</code>&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6C42;&#x503C;&#x3002; <code>false &amp;&amp; X</code>&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x662F;<code>false</code>&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5FFD;&#x7565;<code>X</code>&#x3002; &#x8FD9;&#x79F0;&#x4E3A;&#x77ED;&#x8DEF;&#x6C42;&#x503C;&#x3002;</p>
<p>&#x6761;&#x4EF6;&#x8FD0;&#x7B97;&#x7B26;&#x4EE5;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002; &#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x548C;&#x7B2C;&#x4E09;&#x4E2A;&#x503C;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x88AB;&#x9009;&#x4E2D;&#x7684;&#x503C;&#x624D;&#x4F1A;&#x6C42;&#x503C;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86; JavaScript &#x7684;&#x56DB;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF1A;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#x548C;&#x672A;&#x5B9A;&#x4E49;&#x503C;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x503C;&#x7684;&#x540D;&#x79F0;&#xFF08;<code>true</code>&#xFF0C;<code>null</code>&#xFF09;&#x6216;&#x503C;&#xFF08;<code>13</code>&#xFF0C;<code>&quot;abc&quot;</code>&#xFF09;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5B83;&#x4EEC;&#x3002;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x5BF9;&#x503C;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x548C;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#x3002;&#x672C;&#x7AE0;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x4E86;&#x7B97;&#x672F;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<code>+</code>&#xFF0C;<code>&#x2013;</code>&#xFF0C;<code>*</code>&#xFF0C;<code>/</code>&#x548C;<code>%</code>&#xFF09;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#x7B26;&#xFF08;<code>+</code>&#xFF09;&#xFF0C;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<code>==</code>&#xFF0C;<code>!=</code>&#xFF0C;<code>===</code>&#xFF0C;<code>!==</code>&#xFF0C;<code>&lt;</code>&#xFF0C;<code>&gt;</code>&#xFF0C;<code>&lt;=</code>&#x548C;<code>&gt;=</code>&#xFF09;&#xFF0C;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<code>&amp;&amp;</code>&#x548C;<code>||</code>&#xFF09;&#x548C;&#x4E00;&#x4E9B;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<code>&#x2013;</code>&#x8868;&#x793A;&#x8D1F;&#x6570;&#xFF0C;<code>!</code>&#x8868;&#x793A;&#x903B;&#x8F91;&#x975E;&#xFF0C;<code>typeof</code>&#x7528;&#x4E8E;&#x67E5;&#x8BE2;&#x503C;&#x7684;&#x7C7B;&#x578B;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5C06; JavaScript &#x7528;&#x4F5C;&#x4FBF;&#x643A;&#x5F0F;&#x8BA1;&#x7B97;&#x5668;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x591A;&#x3002; &#x4E0B;&#x4E00;&#x7AE0;&#x5C06;&#x5F00;&#x59CB;&#x5C06;&#x8FD9;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x7ED1;&#x5B9A;&#x5230;&#x57FA;&#x672C;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="0.html" class="navigation navigation-prev " aria-label="Previous page: 零、前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2.html" class="navigation navigation-next " aria-label="Next page: 二、程序结构">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"一、值，类型和运算符","level":"1.3","depth":1,"next":{"title":"二、程序结构","level":"1.4","depth":1,"path":"2.md","ref":"2.md","articles":[]},"previous":{"title":"零、前言","level":"1.2","depth":1,"path":"0.md","ref":"0.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"1.md","mtime":"2019-12-08T16:07:04.978Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

