
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十、模块 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11.html" />
    
    
    <link rel="prev" href="9.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >十、模块</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x3001;&#x6A21;&#x5757;">&#x5341;&#x3001;&#x6A21;&#x5757;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/10_modules.html" target="_blank">Modules</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x7F16;&#x5199;&#x6613;&#x4E8E;&#x5220;&#x9664;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6613;&#x4E8E;&#x6269;&#x5C55;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>Tef&#xFF0C;&#x300A;Programming is Terrible&#x300B;</p>
</blockquote>
<p><img src="img/10-0.jpg" alt=""></p>
<p>&#x7406;&#x60F3;&#x7684;&#x7A0B;&#x5E8F;&#x62E5;&#x6709;&#x6E05;&#x6670;&#x7684;&#x7ED3;&#x6784;&#x3002; &#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x5F88;&#x5BB9;&#x6613;&#x89E3;&#x91CA;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x8D77;&#x5230;&#x660E;&#x786E;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x5178;&#x578B;&#x7684;&#x771F;&#x5B9E;&#x7A0B;&#x5E8F;&#x4F1A;&#x6709;&#x673A;&#x5730;&#x589E;&#x957F;&#x3002; &#x65B0;&#x529F;&#x80FD;&#x968F;&#x7740;&#x65B0;&#x9700;&#x6C42;&#x7684;&#x51FA;&#x73B0;&#x800C;&#x589E;&#x52A0;&#x3002; &#x6784;&#x5EFA;&#x548C;&#x7EF4;&#x62A4;&#x7ED3;&#x6784;&#x662F;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x6709;&#x4EBA;&#x53C2;&#x4E0E;&#x8BE5;&#x8BA1;&#x5212;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x5F97;&#x5230;&#x56DE;&#x62A5;&#x3002; &#x6240;&#x4EE5;&#x5B83;&#x6613;&#x4E8E;&#x5FFD;&#x89C6;&#xFF0C;&#x5E76;&#x8BA9;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x53D8;&#x5F97;&#x6DF1;&#x6DF1;&#x5730;&#x7EA0;&#x7F20;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x4E24;&#x4E2A;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002; &#x5982;&#x679C;&#x4E00;&#x5207;&#x90FD;&#x53EF;&#x4EE5;&#x63A5;&#x89E6;&#x5230;&#x4E00;&#x5207;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x96BE;&#x5355;&#x72EC;&#x89C2;&#x5BDF;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x7247;&#x6BB5;&#x3002; &#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x5168;&#x9762;&#x7406;&#x89E3;&#x6574;&#x4E2A;&#x4E1C;&#x897F;&#x3002; &#x5176;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x7A0B;&#x5E8F;&#x7684;&#x4EFB;&#x4F55;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x8D77;&#x8BD5;&#x56FE;&#x4ECE;&#x5B83;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5C06;&#x5B83;&#x5206;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x91CD;&#x5199;&#x5B83;&#x53EF;&#x80FD;&#x8981;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x672F;&#x8BED;&#x201C;&#x5927;&#x6CE5;&#x7403;&#x201D;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x8FD9;&#x79CD;&#x5927;&#x578B;&#xFF0C;&#x65E0;&#x7ED3;&#x6784;&#x7684;&#x7A0B;&#x5E8F;&#x3002; &#x4E00;&#x5207;&#x90FD;&#x7C98;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F53;&#x4F60;&#x8BD5;&#x56FE;&#x6311;&#x9009;&#x51FA;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x4E1C;&#x897F;&#x5C31;&#x4F1A;&#x5206;&#x5D29;&#x79BB;&#x6790;&#xFF0C;&#x4F60;&#x7684;&#x624B;&#x4F1A;&#x53D8;&#x810F;&#x3002;</p>
<h2 id="&#x6A21;&#x5757;">&#x6A21;&#x5757;</h2>
<p>&#x6A21;&#x5757;&#x8BD5;&#x56FE;&#x907F;&#x514D;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002; &#x6A21;&#x5757;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7247;&#x6BB5;&#xFF0C;&#x89C4;&#x5B9A;&#x4E86;&#x5B83;&#x4F9D;&#x8D56;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4E3A;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF08;&#x5B83;&#x7684;&#x63A5;&#x53E3;&#xFF09;&#x3002;</p>
<p>&#x6A21;&#x5757;&#x63A5;&#x53E3;&#x4E0E;&#x5BF9;&#x8C61;&#x63A5;&#x53E3;&#x6709;&#x8BB8;&#x591A;&#x5171;&#x540C;&#x4E4B;&#x5904;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 6 &#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x3002;&#x5B83;&#x4EEC;&#x5411;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x63D0;&#x4F9B;&#x6A21;&#x5757;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4F7F;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4FDD;&#x6301;&#x79C1;&#x6709;&#x3002; &#x901A;&#x8FC7;&#x9650;&#x5236;&#x6A21;&#x5757;&#x5F7C;&#x6B64;&#x4EA4;&#x4E92;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x66F4;&#x50CF;&#x79EF;&#x6728;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x7EC4;&#x4EF6;&#x901A;&#x8FC7;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x8FDE;&#x63A5;&#x5668;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x800C;&#x4E0D;&#x50CF;&#x6CE5;&#x6D46;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x6DF7;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x79F0;&#x4E3A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002; &#x5F53;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x9700;&#x8981;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x7247;&#x6BB5;&#x65F6;&#xFF0C;&#x5C31;&#x8BF4;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x3002; &#x5F53;&#x6A21;&#x5757;&#x4E2D;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x4E86;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#xFF0C;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x7ED9;&#x5B9A;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x52A0;&#x8F7D;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5206;&#x79BB;&#x6A21;&#x5757;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x9700;&#x8981;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x6709;&#x4F5C;&#x7528;&#x57DF;&#x3002;</p>
<p>&#x5C06;&#x4F60;&#x7684; JavaScript &#x4EE3;&#x7801;&#x653E;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#x3002; &#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x4ECD;&#x7136;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x5168;&#x5C40;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x3002; &#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x610F;&#x6216;&#x65E0;&#x610F;&#x5E72;&#x6270;&#x5F7C;&#x6B64;&#x7684;&#x7ED1;&#x5B9A;&#x3002; &#x4F9D;&#x8D56;&#x6027;&#x7ED3;&#x6784;&#x4ECD;&#x4E0D;&#x6E05;&#x695A;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x540E;&#x9762;&#x770B;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x5408;&#x9002;&#x7684;&#x6A21;&#x5757;&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x96BE;&#x4EE5;&#x4E3A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x3002; &#x5728;&#x4F60;&#x8FD8;&#x5728;&#x63A2;&#x7D22;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x6765;&#x770B;&#x770B;&#x4EC0;&#x4E48;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x60F3;&#x8FC7;&#x591A;&#x62C5;&#x5FC3;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x53EF;&#x80FD;&#x8BA9;&#x4F60;&#x5206;&#x5FC3;&#x3002; &#x4E00;&#x65E6;&#x4F60;&#x6709;&#x4E00;&#x4E9B;&#x611F;&#x89C9;&#x53EF;&#x9760;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x540E;&#x9000;&#x4E00;&#x6B65;&#x5E76;&#x7EC4;&#x7EC7;&#x5B83;&#x7684;&#x597D;&#x65F6;&#x673A;&#x3002;</p>
<h2 id="&#x5305;">&#x5305;</h2>
<p>&#x4ECE;&#x5355;&#x72EC;&#x7684;&#x7247;&#x6BB5;&#x4E2D;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5B9E;&#x9645;&#x4E0A;&#x80FD;&#x591F;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x7247;&#x6BB5;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x5E94;&#x7528;&#x76F8;&#x540C;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5462;&#xFF1F; &#x5047;&#x8BBE;&#x6211;&#x60F3;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x7684;<code>parseINI</code>&#x51FD;&#x6570;&#x3002; &#x5982;&#x679C;&#x6E05;&#x695A;&#x8BE5;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x4EC0;&#x4E48;&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#xFF09;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x4EE3;&#x7801;&#x590D;&#x5236;&#x5230;&#x6211;&#x7684;&#x65B0;&#x9879;&#x76EE;&#x4E2D;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x53D1;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5F53;&#x65F6;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x4E2D;&#x5C06;&#x5176;&#x4FEE;&#x590D;&#xFF0C;&#x5E76;&#x5FD8;&#x8BB0;&#x5728;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x4E2D;&#x4FEE;&#x590D;&#x5B83;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x4F60;&#x5F00;&#x59CB;&#x590D;&#x5236;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x81EA;&#x5DF1;&#x5728;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x6765;&#x5230;&#x5904;&#x590D;&#x5236;&#x5E76;&#x4F7F;&#x4ED6;&#x4EEC;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5305;&#x7684;&#x767B;&#x573A;&#x65F6;&#x673A;&#x3002;&#x5305;&#x662F;&#x53EF;&#x5206;&#x53D1;&#xFF08;&#x590D;&#x5236;&#x548C;&#x5B89;&#x88C5;&#xFF09;&#x7684;&#x4E00;&#x5927;&#x5757;&#x4EE3;&#x7801;&#x3002; &#x5B83;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x5177;&#x6709;&#x5173;&#x4E8E;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x54EA;&#x4E9B;&#x5176;&#x4ED6;&#x5305;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x4E00;&#x4E2A;&#x5305;&#x901A;&#x5E38;&#x8FD8;&#x9644;&#x5E26;&#x8BF4;&#x660E;&#x5B83;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x4EE5;&#x4FBF;&#x90A3;&#x4E9B;&#x4E0D;&#x7F16;&#x5199;&#x5B83;&#x7684;&#x4EBA;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x5728;&#x5305;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x6216;&#x6DFB;&#x52A0;&#x65B0;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x5305;&#x66F4;&#x65B0;&#x3002; &#x73B0;&#x5728;&#x4F9D;&#x8D56;&#x5B83;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5305;&#xFF09;&#x53EF;&#x4EE5;&#x5347;&#x7EA7;&#x5230;&#x65B0;&#x7248;&#x672C;&#x3002;</p>
<p>&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002; &#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x6765;&#x5B58;&#x50A8;&#x548C;&#x67E5;&#x627E;&#x5305;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x4FBF;&#x5229;&#x65B9;&#x5F0F;&#x6765;&#x5B89;&#x88C5;&#x548C;&#x5347;&#x7EA7;&#x5B83;&#x4EEC;&#x3002; &#x5728; JavaScript &#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x7531; <a href="https://npmjs.org" target="_blank">NPM</a> &#x63D0;&#x4F9B;&#x3002;</p>
<p>NPM &#x662F;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#xFF1A;&#x53EF;&#x4E0B;&#x8F7D;&#xFF08;&#x548C;&#x4E0A;&#x4F20;&#xFF09;&#x5305;&#x7684;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x53EF;&#x5E2E;&#x52A9;&#x4F60;&#x5B89;&#x88C5;&#x548C;&#x7BA1;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x4E0E; Node.js &#x6346;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x64B0;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;NPM &#x4E0A;&#x6709;&#x8D85;&#x8FC7; 50 &#x4E07;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5305;&#x3002; &#x5176;&#x4E2D;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5783;&#x573E;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x4F46;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x6709;&#x7528;&#x7684;&#x516C;&#x5F00;&#x5305;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x90A3;&#x91CC;&#x627E;&#x5230;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A; INI &#x6587;&#x4EF6;&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x6784;&#x5EFA;&#x7684;&#x90A3;&#x4E2A;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5305;&#x540D;&#x79F0;<code>ini</code>&#x4E0B;&#x627E;&#x5230;&#x3002;</p>
<p>&#x7B2C; 20 &#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x4F7F;&#x7528;<code>npm</code>&#x547D;&#x4EE4;&#x884C;&#x7A0B;&#x5E8F;&#x5728;&#x5C40;&#x90E8;&#x5B89;&#x88C5;&#x8FD9;&#x4E9B;&#x5305;&#x3002;</p>
<p>&#x4F7F;&#x4F18;&#x8D28;&#x7684;&#x5305;&#x53EF;&#x4F9B;&#x4E0B;&#x8F7D;&#x662F;&#x975E;&#x5E38;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x4E00;&#x767E;&#x4EBA;&#x4E4B;&#x524D;&#x5199;&#x8FC7;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5728;&#x6309;&#x4E0B;&#x51E0;&#x4E2A;&#x952E;&#x65F6;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#xFF0C;&#x5145;&#x5206;&#x6D4B;&#x8BD5;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x7684;&#x590D;&#x5236;&#x5F88;&#x4FBF;&#x5B9C;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x65E6;&#x6709;&#x4EBA;&#x7F16;&#x5199;&#x5B83;&#xFF0C;&#x5206;&#x53D1;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x6548;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4F46;&#x9996;&#x5148;&#x628A;&#x5B83;&#x5199;&#x51FA;&#x6765;&#x662F;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x56DE;&#x5E94;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#xFF0C;&#x6216;&#x8005;&#x60F3;&#x8981;&#x63D0;&#x51FA;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x4EBA;&#xFF0C;&#x662F;&#x66F4;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x62E5;&#x6709;&#x4F60;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x7248;&#x6743;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x53EA;&#x6709;&#x7ECF;&#x8FC7;&#x4F60;&#x7684;&#x8BB8;&#x53EF;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x4EBA;&#x4E0D;&#x9519;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x53D1;&#x5E03;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x4F7F;&#x4F60;&#x5728;&#x7A0B;&#x5E8F;&#x5458;&#x4E2D;&#x51FA;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x8BB8;&#x591A;&#x5305;&#x90FD;&#x4F1A;&#x5728;&#x8BB8;&#x53EF;&#x8BC1;&#x4E0B;&#x53D1;&#x5E03;&#xFF0C;&#x660E;&#x786E;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x4EBA;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>NPM &#x4E0A;&#x7684;&#x5927;&#x591A;&#x6570;&#x4EE3;&#x7801;&#x90FD;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6388;&#x6743;&#x3002;&#x67D0;&#x4E9B;&#x8BB8;&#x53EF;&#x8BC1;&#x8981;&#x6C42;&#x4F60;&#x8FD8;&#x8981;&#x5728;&#x76F8;&#x540C;&#x8BB8;&#x53EF;&#x8BC1;&#x4E0B;&#x53D1;&#x5E03;&#x57FA;&#x4E8E;&#x90A3;&#x4E2A;&#x5305;&#x6784;&#x5EFA;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5176;&#x4ED6;&#x8981;&#x6C42;&#x4E0D;&#x9AD8;&#xFF0C;&#x53EA;&#x662F;&#x8981;&#x6C42;&#x5728;&#x5206;&#x53D1;&#x4EE3;&#x7801;&#x65F6;&#x4FDD;&#x7559;&#x8BB8;&#x53EF;&#x8BC1;&#x3002; JavaScript &#x793E;&#x533A;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x540E;&#x4E00;&#x79CD;&#x8BB8;&#x53EF;&#x8BC1;&#x3002;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5305;&#x65F6;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x4F60;&#x7559;&#x610F;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x8BB8;&#x53EF;&#x8BC1;&#x3002;</p>
<h2 id="&#x5373;&#x5174;&#x7684;&#x6A21;&#x5757;">&#x5373;&#x5174;&#x7684;&#x6A21;&#x5757;</h2>
<p>2015 &#x5E74;&#x4E4B;&#x524D;&#xFF0C;JavaScript &#x8BED;&#x8A00;&#x6CA1;&#x6709;&#x5185;&#x7F6E;&#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5C3D;&#x7BA1;&#x4EBA;&#x4EEC;&#x5DF2;&#x7ECF;&#x7528; JavaScript &#x6784;&#x5EFA;&#x4E86;&#x5341;&#x591A;&#x5E74;&#x7684;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x5728;&#x8BED;&#x8A00;&#x4E4B;&#x4E0A;&#x8BBE;&#x8BA1;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; JavaScript &#x51FD;&#x6570;&#x521B;&#x5EFA;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;&#x6A21;&#x5757;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x7528;&#x4E8E;&#x65E5;&#x671F;&#x540D;&#x79F0;&#x548C;&#x6570;&#x5B57;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#xFF08;&#x7531;<code>Date</code>&#x7684;<code>getDay</code>&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#xFF09;&#x3002; &#x5B83;&#x7684;&#x63A5;&#x53E3;&#x7531;<code>weekDay.name</code>&#x548C;<code>weekDay.number</code>&#x7EC4;&#x6210;&#xFF0C;&#x5B83;&#x5C06;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x9690;&#x85CF;&#x5728;&#x7ACB;&#x5373;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> weekDay = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">const</span> names = [<span class="hljs-string">&quot;Sunday&quot;</span>, <span class="hljs-string">&quot;Monday&quot;</span>, <span class="hljs-string">&quot;Tuesday&quot;</span>, <span class="hljs-string">&quot;Wednesday&quot;</span>,
                 <span class="hljs-string">&quot;Thursday&quot;</span>, <span class="hljs-string">&quot;Friday&quot;</span>, <span class="hljs-string">&quot;Saturday&quot;</span>];
  <span class="hljs-keyword">return</span> {
    name(number) { <span class="hljs-keyword">return</span> names[number]; },
    number(name) { <span class="hljs-keyword">return</span> names.indexOf(name); }
  };
}();

<span class="hljs-built_in">console</span>.log(weekDay.name(weekDay.number(<span class="hljs-string">&quot;Sunday&quot;</span>)));
<span class="hljs-comment">// &#x2192; Sunday</span>
</code></pre>
<p>&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x6A21;&#x5757;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x9694;&#x79BB;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x58F0;&#x660E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x5C06;&#x5176;&#x63A5;&#x53E3;&#x653E;&#x5165;&#x5168;&#x5C40;&#x8303;&#x56F4;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x5B83;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x4E5F;&#x8FD9;&#x6837;&#x505A;&#x3002; &#x5F88;&#x957F;&#x65F6;&#x95F4;&#x4EE5;&#x6765;&#xFF0C;&#x8FD9;&#x662F; Web &#x7F16;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x5B83;&#x51E0;&#x4E4E;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6210;&#x4E3A;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x63A7;&#x5236;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x52A0;&#x8F7D;&#x3002; &#x5B9E;&#x73B0;&#x5B83;&#x9700;&#x8981;&#x80FD;&#x591F;&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x6267;&#x884C;&#x4E3A;&#x4EE3;&#x7801;&#x3002; JavaScript &#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<h2 id="&#x5C06;&#x6570;&#x636E;&#x6267;&#x884C;&#x4E3A;&#x4EE3;&#x7801;">&#x5C06;&#x6570;&#x636E;&#x6267;&#x884C;&#x4E3A;&#x4EE3;&#x7801;</h2>
<p>&#x6709;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5C06;&#x6570;&#x636E;&#xFF08;&#x4EE3;&#x7801;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x4F5C;&#x4E3A;&#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x6700;&#x660E;&#x663E;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x7279;&#x6B8A;&#x8FD0;&#x7B97;&#x7B26;<code>eval</code>&#xFF0C;&#x5B83;&#x5C06;&#x5728;&#x5F53;&#x524D;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x8FD9;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4E3B;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7834;&#x574F;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#x901A;&#x5E38;&#x62E5;&#x6709;&#x7684;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x6613;&#x4E8E;&#x9884;&#x6D4B;&#x7ED9;&#x5B9A;&#x540D;&#x79F0;&#x6240;&#x5F15;&#x7528;&#x7684;&#x7ED1;&#x5B9A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> x = <span class="hljs-number">1</span>;
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">evalAndReturnX</span>(<span class="hljs-params">code</span>) </span>{
  <span class="hljs-built_in">eval</span>(code);
  <span class="hljs-keyword">return</span> x;
}

<span class="hljs-built_in">console</span>.log(evalAndReturnX(<span class="hljs-string">&quot;var x = 2&quot;</span>));
<span class="hljs-comment">// &#x2192; 2</span>
<span class="hljs-built_in">console</span>.log(x);
<span class="hljs-comment">// &#x2192; 1</span>
</code></pre>
<p>&#x5C06;&#x6570;&#x636E;&#x89E3;&#x91CA;&#x4E3A;&#x4EE3;&#x7801;&#x7684;&#x4E0D;&#x592A;&#x53EF;&#x6015;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x4F7F;&#x7528;<code>Function</code>&#x6784;&#x9020;&#x5668;&#x3002; &#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x53C2;&#x6570;&#x540D;&#x79F0;&#x5217;&#x8868;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x5B83;&#x5C06;&#x4EE3;&#x7801;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x503C;&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x83B7;&#x5F97;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x4F5C;&#x7528;&#x57DF;&#x505A;&#x51FA;&#x5947;&#x602A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<pre><code class="lang-py">let plusOne = Function(<span class="hljs-string">&quot;n&quot;</span>, <span class="hljs-string">&quot;return n + 1;&quot;</span>);
console.log(plusOne(<span class="hljs-number">4</span>));
// &#x2192; <span class="hljs-number">5</span>
</code></pre>
<p>&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#x5305;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x7528;&#x4F5C;&#x6A21;&#x5757;&#x4F5C;&#x7528;&#x57DF;&#x3002;</p>
<h2 id="commonjs">CommonJS</h2>
<p>&#x7528;&#x4E8E;&#x8FDE;&#x63A5; JavaScript &#x6A21;&#x5757;&#x7684;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A; CommonJS &#x6A21;&#x5757;&#x3002; Node.js &#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5E76;&#x4E14;&#x662F; NPM &#x4E0A;&#x5927;&#x591A;&#x6570;&#x5305;&#x4F7F;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>CommonJS &#x6A21;&#x5757;&#x7684;&#x4E3B;&#x8981;&#x6982;&#x5FF5;&#x662F;&#x79F0;&#x4E3A;<code>require</code>&#x7684;&#x51FD;&#x6570;&#x3002; &#x5F53;&#x4F60;&#x4F7F;&#x7528;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x6A21;&#x5757;&#x540D;&#x79F0;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x786E;&#x4FDD;&#x8BE5;&#x6A21;&#x5757;&#x5DF2;&#x52A0;&#x8F7D;&#x5E76;&#x8FD4;&#x56DE;&#x5176;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x52A0;&#x8F7D;&#x5668;&#x5C06;&#x6A21;&#x5757;&#x4EE3;&#x7801;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6A21;&#x5757;&#x81EA;&#x52A8;&#x5F97;&#x5230;&#x5B83;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x3002; &#x4ED6;&#x4EEC;&#x6240;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x8C03;&#x7528;<code>require</code>&#x6765;&#x8BBF;&#x95EE;&#x5B83;&#x4EEC;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x63A5;&#x53E3;&#x653E;&#x5728;&#x7ED1;&#x5B9A;&#x5230;<code>exports</code>&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x3002;</p>
<p>&#x6B64;&#x793A;&#x4F8B;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x4E86;&#x65E5;&#x671F;&#x683C;&#x5F0F;&#x5316;&#x529F;&#x80FD;&#x3002; &#x5B83;&#x4F7F;&#x7528; NPM&#x7684;&#x4E24;&#x4E2A;&#x5305;&#xFF0C;<code>ordinal</code>&#x7528;&#x4E8E;&#x5C06;&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5982;<code>&quot;1st&quot;</code>&#x548C;<code>&quot;2nd&quot;</code>&#xFF0C;&#x4EE5;&#x53CA;<code>date-names</code>&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x661F;&#x671F;&#x548C;&#x6708;&#x4EFD;&#x7684;&#x82F1;&#x6587;&#x540D;&#x79F0;&#x3002; &#x5B83;&#x5BFC;&#x51FA;&#x51FD;&#x6570;<code>formatDate</code>&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;<code>Date</code>&#x5BF9;&#x8C61;&#x548C;&#x4E00;&#x4E2A;&#x6A21;&#x677F;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x6A21;&#x677F;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x5305;&#x542B;&#x6307;&#x660E;&#x683C;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5982;<code>YYYY</code>&#x7528;&#x4E8E;&#x5168;&#x5E74;&#xFF0C;<code>Do</code>&#x7528;&#x4E8E;&#x6BCF;&#x6708;&#x7684;&#x5E8F;&#x6570;&#x65E5;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;&#x50CF;<code>&quot;MMMM Do YYYY&quot;</code>&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;,&#x6765;&#x83B7;&#x5F97;&#x50CF;<code>&quot;November 22nd 2017&quot;</code>&#x8FD9;&#x6837;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> ordinal = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;ordinal&quot;</span>);
<span class="hljs-keyword">const</span> {days, months} = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;date-names&quot;</span>);

exports.formatDate = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">date, format</span>) </span>{
  <span class="hljs-keyword">return</span> format.replace(<span class="hljs-regexp">/YYYY|M(MMM)?|Do?|dddd/g</span>, tag =&gt; {
    <span class="hljs-keyword">if</span> (tag == <span class="hljs-string">&quot;YYYY&quot;</span>) <span class="hljs-keyword">return</span> date.getFullYear();
    <span class="hljs-keyword">if</span> (tag == <span class="hljs-string">&quot;M&quot;</span>) <span class="hljs-keyword">return</span> date.getMonth();
    <span class="hljs-keyword">if</span> (tag == <span class="hljs-string">&quot;MMMM&quot;</span>) <span class="hljs-keyword">return</span> months[date.getMonth()];
    <span class="hljs-keyword">if</span> (tag == <span class="hljs-string">&quot;D&quot;</span>) <span class="hljs-keyword">return</span> date.getDate();
    <span class="hljs-keyword">if</span> (tag == <span class="hljs-string">&quot;Do&quot;</span>) <span class="hljs-keyword">return</span> ordinal(date.getDate());
    <span class="hljs-keyword">if</span> (tag == <span class="hljs-string">&quot;dddd&quot;</span>) <span class="hljs-keyword">return</span> days[date.getDay()];
  });
};
</code></pre>
<p><code>ordinal</code>&#x7684;&#x63A5;&#x53E3;&#x662F;&#x5355;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x800C;<code>date-names</code>&#x5BFC;&#x51FA;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x5BF9;&#x8C61; - <code>days</code>&#x548C;<code>months</code>&#x662F;&#x540D;&#x79F0;&#x6570;&#x7EC4;&#x3002; &#x4E3A;&#x5BFC;&#x5165;&#x7684;&#x63A5;&#x53E3;&#x521B;&#x5EFA;&#x7ED1;&#x5B9A;&#x65F6;&#xFF0C;&#x89E3;&#x6784;&#x662F;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#x3002;</p>
<p>&#x8BE5;&#x6A21;&#x5757;&#x5C06;&#x5176;&#x63A5;&#x53E3;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x5230;<code>exports</code>&#xFF0C;&#x4EE5;&#x4FBF;&#x4F9D;&#x8D56;&#x5B83;&#x7684;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5B83;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> {formatDate} = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;./format-date&quot;</span>);

<span class="hljs-built_in">console</span>.log(formatDate(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Date</span>(<span class="hljs-number">2017</span>, <span class="hljs-number">9</span>, <span class="hljs-number">13</span>),
                       <span class="hljs-string">&quot;dddd the Do&quot;</span>));
<span class="hljs-comment">// &#x2192; Friday the 13th</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x5F0F;&#x5B9A;&#x4E49;<code>require</code>&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">require</span>.cache = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">require</span>(<span class="hljs-params">name</span>) </span>{
  <span class="hljs-keyword">if</span> (!(name <span class="hljs-keyword">in</span> <span class="hljs-built_in">require</span>.cache)) {
    <span class="hljs-keyword">let</span> code = readFile(name);
    <span class="hljs-keyword">let</span> <span class="hljs-built_in">module</span> = {exports: {}};
    <span class="hljs-built_in">require</span>.cache[name] = <span class="hljs-built_in">module</span>;
    <span class="hljs-keyword">let</span> wrapper = <span class="hljs-built_in">Function</span>(<span class="hljs-string">&quot;require, exports, module&quot;</span>, code);
    wrapper(<span class="hljs-built_in">require</span>, <span class="hljs-built_in">module</span>.exports, <span class="hljs-built_in">module</span>);
  }
  <span class="hljs-keyword">return</span> <span class="hljs-built_in">require</span>.cache[name].exports;
}
</code></pre>
<p>&#x5728;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;<code>readFile</code>&#x662F;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5E76;&#x5C06;&#x5176;&#x5185;&#x5BB9;&#x4F5C;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x8FD4;&#x56DE;&#x3002;&#x6807;&#x51C6;&#x7684; JavaScript &#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684; JavaScript &#x73AF;&#x5883;&#xFF08;&#x5982;&#x6D4F;&#x89C8;&#x5668;&#x548C; Node.js&#xFF09;&#x63D0;&#x4F9B;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EA;&#x662F;&#x5047;&#x8BBE;<code>readFile</code>&#x5B58;&#x5728;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x591A;&#x6B21;&#x52A0;&#x8F7D;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x5757;&#xFF0C;<code>require</code>&#x9700;&#x8981;&#x4FDD;&#x5B58;&#xFF08;&#x7F13;&#x5B58;&#xFF09;&#x5DF2;&#x7ECF;&#x52A0;&#x8F7D;&#x7684;&#x6A21;&#x5757;&#x3002;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x6A21;&#x5757;&#x662F;&#x5426;&#x5DF2;&#x52A0;&#x8F7D;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5219;&#x52A0;&#x8F7D;&#x5B83;&#x3002;&#x8FD9;&#x6D89;&#x53CA;&#x5230;&#x8BFB;&#x53D6;&#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C06;&#x5176;&#x5305;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;<code>ordinal</code>&#x5305;&#x7684;&#x63A5;&#x53E3;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002; CommonJS &#x6A21;&#x5757;&#x7684;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x4F1A;&#x4E3A;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x63A5;&#x53E3;&#x5BF9;&#x8C61;&#xFF08;&#x7ED1;&#x5B9A;&#x5230;<code>exports</code>&#xFF09;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8986;&#x76D6;<code>module.exports</code>&#x6765;&#x66FF;&#x6362;&#x5B83;&#x3002;&#x8BB8;&#x591A;&#x6A21;&#x5757;&#x90FD;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BFC;&#x51FA;&#x5355;&#x4E2A;&#x503C;&#x800C;&#x4E0D;&#x662F;&#x63A5;&#x53E3;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5C06;<code>require</code>&#xFF0C;<code>exports</code>&#x548C;<code>module</code>&#x5B9A;&#x4E49;&#x4E3A;&#x751F;&#x6210;&#x7684;&#x5305;&#x88C5;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x5E76;&#x5728;&#x8C03;&#x7528;&#x5B83;&#x65F6;&#x4F20;&#x9012;&#x9002;&#x5F53;&#x7684;&#x503C;&#xFF09;&#xFF0C;&#x52A0;&#x8F7D;&#x5668;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x7ED1;&#x5B9A;&#x5728;&#x6A21;&#x5757;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x63D0;&#x4F9B;&#x7ED9;<code>require</code>&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7FFB;&#x8BD1;&#x4E3A;&#x5B9E;&#x9645;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x6216;&#x7F51;&#x5740;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002; &#x5F53;&#x5B83;&#x4EE5;<code>&quot;./&quot;</code>&#x6216;<code>&quot;../&quot;</code>&#x5F00;&#x5934;&#x65F6;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x76F8;&#x5BF9;&#x4E8E;&#x5F53;&#x524D;&#x6A21;&#x5757;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x3002; &#x6240;&#x4EE5;<code>&quot;./format-date&quot;</code>&#x5C31;&#x662F;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x540D;&#x4E3A;<code>format-date.js</code>&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5F53;&#x540D;&#x79F0;&#x4E0D;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#x65F6;&#xFF0C;Node.js &#x5C06;&#x6309;&#x7167;&#x8BE5;&#x540D;&#x79F0;&#x67E5;&#x627E;&#x5DF2;&#x5B89;&#x88C5;&#x7684;&#x5305;&#x3002; &#x5728;&#x672C;&#x7AE0;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x628A;&#x8FD9;&#x4E9B;&#x540D;&#x79F0;&#x89E3;&#x91CA;&#x4E3A; NPM &#x5305;&#x7684;&#x5F15;&#x7528;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 20 &#x7AE0;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x5B89;&#x88C5;&#x548C;&#x4F7F;&#x7528; NPM &#x6A21;&#x5757;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x7F16;&#x5199;&#x81EA;&#x5DF1;&#x7684; INI &#x6587;&#x4EF6;&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528; NPM &#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> {parse} = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;ini&quot;</span>);

<span class="hljs-built_in">console</span>.log(parse(<span class="hljs-string">&quot;x = 10\ny = 20&quot;</span>));
<span class="hljs-comment">// &#x2192; {x: &quot;10&quot;, y: &quot;20&quot;}</span>
</code></pre>
<h2 id="ecmascript-&#x6A21;&#x5757;">ECMAScript &#x6A21;&#x5757;</h2>
<p>CommonJS &#x6A21;&#x5757;&#x5F88;&#x597D;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E; NPM &#x4E00;&#x8D77;&#xFF0C;&#x4F7F; JavaScript &#x793E;&#x533A;&#x5F00;&#x59CB;&#x5927;&#x89C4;&#x6A21;&#x5171;&#x4EAB;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4F46;&#x4ED6;&#x4EEC;&#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;&#x9ED1;&#x9B54;&#x6CD5;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x8868;&#x793A;&#x6CD5;&#x6709;&#x70B9;&#x7B28;&#x62D9; - &#x6DFB;&#x52A0;&#x5230;<code>exports</code>&#x7684;&#x5185;&#x5BB9;&#x5728;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x4E0D;&#x53EF;&#x7528;&#x3002; &#x800C;&#x4E14;&#x56E0;&#x4E3A;<code>require</code>&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x63A5;&#x53D7;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x9762;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4E0D;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#x6A21;&#x5757;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F; 2015 &#x5E74;&#x7684; JavaScript &#x6807;&#x51C6;&#x5F15;&#x5165;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x56E0;&#x3002; &#x5B83;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A; ES &#x6A21;&#x5757;&#xFF0C;&#x5176;&#x4E2D; ES &#x4EE3;&#x8868; ECMAScript&#x3002; &#x4F9D;&#x8D56;&#x548C;&#x63A5;&#x53E3;&#x7684;&#x4E3B;&#x8981;&#x6982;&#x5FF5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x4F46;&#x7EC6;&#x8282;&#x4E0D;&#x540C;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x8868;&#x793A;&#x6CD5;&#x73B0;&#x5728;&#x5DF2;&#x6574;&#x5408;&#x5230;&#x8BE5;&#x8BED;&#x8A00;&#x4E2D;&#x3002; &#x4F60;&#x4E0D;&#x7528;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x6765;&#x8BBF;&#x95EE;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;<code>import</code>&#x5173;&#x952E;&#x5B57;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> ordinal <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;ordinal&quot;</span>;
<span class="hljs-keyword">import</span> {days, months} <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;date-names&quot;</span>;

<span class="hljs-keyword">export</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">formatDate</span>(<span class="hljs-params">date, format</span>) </span>{ <span class="hljs-comment">/* ... */</span> }
</code></pre>
<p>&#x540C;&#x6837;&#xFF0C;<code>export</code>&#x5173;&#x952E;&#x5B57;&#x7528;&#x4E8E;&#x5BFC;&#x51FA;&#x4E1C;&#x897F;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x5728;&#x51FD;&#x6570;&#xFF0C;&#x7C7B;&#x6216;&#x7ED1;&#x5B9A;&#x5B9A;&#x4E49;&#xFF08;<code>let</code>&#xFF0C;<code>const</code>&#x6216;<code>var</code>&#xFF09;&#x7684;&#x524D;&#x9762;&#x3002;</p>
<p>ES &#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x4E0D;&#x662F;&#x5355;&#x4E2A;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x7EC4;&#x547D;&#x540D;&#x7ED1;&#x5B9A;&#x3002; &#x524D;&#x9762;&#x7684;&#x6A21;&#x5757;&#x5C06;<code>formatDate</code>&#x7ED1;&#x5B9A;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002; &#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5BFC;&#x5165;&#x65F6;&#xFF0C;&#x5BFC;&#x5165;&#x7ED1;&#x5B9A;&#x800C;&#x4E0D;&#x662F;&#x503C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5BFC;&#x51FA;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x66F4;&#x6539;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x5BFC;&#x5165;&#x5B83;&#x7684;&#x6A21;&#x5757;&#x5C06;&#x770B;&#x5230;&#x5176;&#x65B0;&#x503C;&#x3002;</p>
<p>&#x5F53;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>default</code>&#x7684;&#x7ED1;&#x5B9A;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x6A21;&#x5757;&#x7684;&#x4E3B;&#x8981;&#x5BFC;&#x51FA;&#x503C;&#x3002; &#x5982;&#x679C;&#x4F60;&#x5728;&#x793A;&#x4F8B;&#x4E2D;&#x5BFC;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;<code>ordinal</code>&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x5468;&#x56F4;&#x7684;&#x5927;&#x62EC;&#x53F7;&#xFF0C;&#x5219;&#x4F1A;&#x83B7;&#x5F97;&#x5176;&#x9ED8;&#x8BA4;&#x7ED1;&#x5B9A;&#x3002; &#x9664;&#x4E86;&#x9ED8;&#x8BA4;&#x7ED1;&#x5B9A;&#x4E4B;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x540D;&#x79F0;&#x5BFC;&#x51FA;&#x5176;&#x4ED6;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x9ED8;&#x8BA4;&#x5BFC;&#x51FA;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x6216;&#x7C7B;&#x58F0;&#x660E;&#x4E4B;&#x524D;&#x7F16;&#x5199;<code>export default</code>&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> [<span class="hljs-string">&quot;Winter&quot;</span>, <span class="hljs-string">&quot;Spring&quot;</span>, <span class="hljs-string">&quot;Summer&quot;</span>, <span class="hljs-string">&quot;Autumn&quot;</span>];
</code></pre>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x8BCD;<code>as</code>&#x91CD;&#x547D;&#x540D;&#x5BFC;&#x5165;&#x7684;&#x7ED1;&#x5B9A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> {days <span class="hljs-keyword">as</span> dayNames} <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;date-names&quot;</span>;

<span class="hljs-built_in">console</span>.log(dayNames.length);
<span class="hljs-comment">// &#x2192; 7</span>
</code></pre>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;ES &#x6A21;&#x5757;&#x7684;&#x5BFC;&#x5165;&#x53D1;&#x751F;&#x5728;&#x6A21;&#x5757;&#x7684;&#x811A;&#x672C;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;<code>import</code>&#x58F0;&#x660E;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x51FD;&#x6570;&#x6216;&#x5757;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x540D;&#x79F0;&#x53EA;&#x80FD;&#x662F;&#x5E26;&#x5F15;&#x53F7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x5728;&#x64B0;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;JavaScript &#x793E;&#x533A;&#x6B63;&#x5728;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6A21;&#x5757;&#x98CE;&#x683C;&#x3002; &#x4F46;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7F13;&#x6162;&#x7684;&#x8FC7;&#x7A0B;&#x3002; &#x5728;&#x89C4;&#x5B9A;&#x683C;&#x5F0F;&#x4E4B;&#x540E;&#xFF0C;&#x82B1;&#x4E86;&#x51E0;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x548C; Node.js &#x624D;&#x5F00;&#x59CB;&#x652F;&#x6301;&#x5B83;&#x3002; &#x867D;&#x7136;&#x4ED6;&#x4EEC;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x90FD;&#x652F;&#x6301;&#x5B83;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x652F;&#x6301;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x5982;&#x4F55;&#x901A;&#x8FC7; NPM &#x5206;&#x53D1;&#x7684;&#x8BA8;&#x8BBA;&#x4ECD;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x9879;&#x76EE;&#x4F7F;&#x7528; ES &#x6A21;&#x5757;&#x7F16;&#x5199;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53D1;&#x5E03;&#x65F6;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x4E3A;&#x5176;&#x4ED6;&#x683C;&#x5F0F;&#x3002; &#x6211;&#x4EEC;&#x6B63;&#x5904;&#x4E8E;&#x5E76;&#x884C;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x7684;&#x8FC7;&#x6E21;&#x65F6;&#x671F;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x8BFB;&#x5199;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x4E4B;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<h2 id="&#x6784;&#x5EFA;&#x548C;&#x6253;&#x5305;">&#x6784;&#x5EFA;&#x548C;&#x6253;&#x5305;</h2>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8BB8;&#x591A; JavaScript &#x9879;&#x76EE;&#x90FD;&#x4E0D;&#x662F;&#x7528; JavaScript &#x7F16;&#x5199;&#x7684;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x6269;&#x5C55;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x7B2C; 8 &#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x65B9;&#x8A00;&#x3002;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#xFF0C;&#x5728;&#x8BED;&#x8A00;&#x7684;&#x67D0;&#x4E2A;&#x8BA1;&#x5212;&#x6027;&#x6269;&#x5C55;&#x6DFB;&#x52A0;&#x5230;&#x5B9E;&#x9645;&#x8FD0;&#x884C; JavaScript &#x7684;&#x5E73;&#x53F0;&#x4E4B;&#x524D;&#xFF0C;&#x4EBA;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5B83;&#x4E86;&#x3002;</p>
<p>&#x4E3A;&#x6B64;&#xFF0C;&#x4ED6;&#x4EEC;&#x7F16;&#x8BD1;&#x4ED6;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C06;&#x5176;&#x4ECE;&#x4ED6;&#x4EEC;&#x9009;&#x62E9;&#x7684; JavaScript &#x65B9;&#x8A00;&#x7FFB;&#x8BD1;&#x6210;&#x666E;&#x901A;&#x7684;&#x65E7;&#x5F0F; JavaScript&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x8FC7;&#x53BB;&#x7684; JavaScript &#x7248;&#x672C;&#xFF0C;&#x4EE5;&#x4FBF;&#x65E7;&#x7248;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5B83;&#x3002;</p>
<p>&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x5305;&#x542B;&#x7531; 200 &#x4E2A;&#x4E0D;&#x540C;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#x7684;&#x6A21;&#x5757;&#x5316;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x83B7;&#x53D6;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#x9700;&#x8981; 50 &#x6BEB;&#x79D2;&#xFF0C;&#x5219;&#x52A0;&#x8F7D;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x9700;&#x8981; 10 &#x79D2;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x52A0;&#x8F7D;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x534A;&#x3002;&#x8FD9;&#x6D6A;&#x8D39;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x4E3A;&#x6293;&#x53D6;&#x4E00;&#x4E2A;&#x5927;&#x6587;&#x4EF6;&#x5F80;&#x5F80;&#x6BD4;&#x6293;&#x53D6;&#x5F88;&#x591A;&#x5C0F;&#x6587;&#x4EF6;&#x8981;&#x5FEB;&#xFF0C;&#x6240;&#x4EE5; Web &#x7A0B;&#x5E8F;&#x5458;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x53D1;&#x5E03;&#x5230; Web &#x4E4B;&#x524D;&#xFF0C;&#x5C06;&#x4ED6;&#x4EEC;&#xFF08;&#x8D39;&#x529B;&#x5206;&#x5272;&#x6210;&#x6A21;&#x5757;&#xFF09;&#x7684;&#x7A0B;&#x5E8F;&#x56DE;&#x6EDA;&#x6210;&#x5355;&#x4E2A;&#x5927;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x88AB;&#x79F0;&#x4E3A;&#x6253;&#x5305;&#x5668;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x518D;&#x6DF1;&#x5165;&#x4E00;&#x70B9;&#x3002; &#x9664;&#x4E86;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x91CF;&#x4E4B;&#x5916;&#xFF0C;&#x6587;&#x4EF6;&#x7684;&#x5927;&#x5C0F;&#x4E5F;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x7684;&#x901F;&#x5EA6;&#x3002; &#x56E0;&#x6B64;&#xFF0C;JavaScript &#x793E;&#x533A;&#x53D1;&#x660E;&#x4E86;&#x538B;&#x7F29;&#x5668;&#x3002; &#x901A;&#x8FC7;&#x81EA;&#x52A8;&#x5220;&#x9664;&#x6CE8;&#x91CA;&#x548C;&#x7A7A;&#x767D;&#xFF0C;&#x91CD;&#x547D;&#x540D;&#x7ED1;&#x5B9A;&#x4EE5;&#x53CA;&#x7528;&#x5360;&#x7528;&#x66F4;&#x5C11;&#x7A7A;&#x95F4;&#x7684;&#x7B49;&#x6548;&#x4EE3;&#x7801;&#x66FF;&#x6362;&#x4EE3;&#x7801;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x4F7F; JavaScript &#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x5728; NPM &#x5305;&#x4E2D;&#x627E;&#x5230;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8FD0;&#x884C;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x7ECF;&#x5386;&#x4E86;&#x591A;&#x4E2A;&#x8F6C;&#x6362;&#x9636;&#x6BB5; - &#x4ECE;&#x73B0;&#x4EE3; JavaScript &#x8F6C;&#x6362;&#x4E3A;&#x5386;&#x53F2; JavaScript&#xFF0C;&#x4ECE; ES &#x6A21;&#x5757;&#x683C;&#x5F0F;&#x8F6C;&#x6362;&#x4E3A; CommonJS&#xFF0C;&#x6253;&#x5305;&#x5E76;&#x538B;&#x7F29;&#x3002; &#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5F80;&#x5F80;&#x5F88;&#x65E0;&#x804A;&#xFF0C;&#x5E76;&#x4E14;&#x53D8;&#x5316;&#x5F88;&#x5FEB;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4F60;&#x8FD0;&#x884C;&#x7684; JavaScript &#x4EE3;&#x7801;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="&#x6A21;&#x5757;&#x8BBE;&#x8BA1;">&#x6A21;&#x5757;&#x8BBE;&#x8BA1;</h2>
<p>&#x4F7F;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x5316;&#x662F;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x5FAE;&#x5999;&#x7684;&#x65B9;&#x9762;&#x3002; &#x4EFB;&#x4F55;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x529F;&#x80FD;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x5EFA;&#x6A21;&#x3002;</p>
<p>&#x826F;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x662F;&#x4E3B;&#x89C2;&#x7684; - &#x6D89;&#x53CA;&#x5230;&#x6743;&#x8861;&#x548C;&#x54C1;&#x5473;&#x95EE;&#x9898;&#x3002; &#x4E86;&#x89E3;&#x7ED3;&#x6784;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x7684;&#x4EF7;&#x503C;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x9605;&#x8BFB;&#x6216;&#x5904;&#x7406;&#x5927;&#x91CF;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x6CE8;&#x610F;&#x54EA;&#x4E9B;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x4E0D;&#x662F;&#x3002; &#x4E0D;&#x8981;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x75DB;&#x82E6;&#x7684;&#x6DF7;&#x4E71;&#x5C31;&#x662F;&#x201C;&#x5B83;&#x672C;&#x6765;&#x7684;&#x65B9;&#x5F0F;&#x201D;&#x3002; &#x901A;&#x8FC7;&#x591A;&#x52A0;&#x601D;&#x8003;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4E8B;&#x7269;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x662F;&#x6613;&#x7528;&#x6027;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x8BBE;&#x8BA1;&#x4E00;&#x4E9B;&#x65E8;&#x5728;&#x7531;&#x591A;&#x4EBA;&#x4F7F;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x751A;&#x81F3;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5728;&#x4E09;&#x4E2A;&#x6708;&#x4E4B;&#x5185;&#xFF0C;&#x5F53;&#x4F60;&#x8BB0;&#x4E0D;&#x4F4F;&#x4F60;&#x6240;&#x505A;&#x7684;&#x7EC6;&#x8282;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x63A5;&#x53E3;&#x7B80;&#x5355;&#x4E14;&#x53EF;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x8FD9;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x9075;&#x5FAA;&#x73B0;&#x6709;&#x7684;&#x60EF;&#x4F8B;&#x3002; <code>ini</code>&#x5305;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002; &#x6B64;&#x6A21;&#x5757;&#x6A21;&#x4EFF;&#x6807;&#x51C6; JSON &#x5BF9;&#x8C61;&#xFF0C;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;<code>parse</code>&#x548C;<code>stringify</code>&#xFF08;&#x7528;&#x4E8E;&#x7F16;&#x5199; INI &#x6587;&#x4EF6;&#xFF09;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x50CF; JSON &#x4E00;&#x6837;&#xFF0C;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x666E;&#x901A;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002; &#x6240;&#x4EE5;&#x63A5;&#x53E3;&#x5F88;&#x5C0F;&#x4E14;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x5728;&#x4F60;&#x4F7F;&#x7528;&#x8FC7;&#x4E00;&#x6B21;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BB0;&#x5F97;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x80FD;&#x6A21;&#x4EFF;&#x7684;&#x6807;&#x51C6;&#x51FD;&#x6570;&#x6216;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x5305;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x5355;&#x4E00;&#x7684;&#x91CD;&#x70B9;&#x4E8B;&#x9879;&#xFF0C;&#x6765;&#x4FDD;&#x6301;&#x6A21;&#x5757;&#x7684;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#x3002; &#x4F8B;&#x5982;&#xFF0C;NPM &#x4E0A;&#x7684;&#x8BB8;&#x591A; INI &#x6587;&#x4EF6;&#x89E3;&#x6790;&#x6A21;&#x5757;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x76F4;&#x63A5;&#x4ECE;&#x786C;&#x76D8;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x5E76;&#x89E3;&#x6790;&#x5B83;&#x7684;&#x529F;&#x80FD;&#x3002; &#x8FD9;&#x4F7F;&#x5F97;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4E0D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x6743;&#xFF0C;&#x5E76;&#x4E14;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x901A;&#x8FC7;&#x7EC4;&#x5408;&#x6A21;&#x5757;&#x4E0E;&#x67D0;&#x4E9B;&#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x5B83;&#x3002;</p>
<p>&#x8FD9;&#x6307;&#x5411;&#x4E86;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x65B9;&#x9762; - &#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x4E0E;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x7EC4;&#x5408;&#x3002;&#x6BD4;&#x8D77;&#x6267;&#x884C;&#x5E26;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x590D;&#x6742;&#x64CD;&#x4F5C;&#x7684;&#x66F4;&#x5927;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x8BA1;&#x7B97;&#x503C;&#x7684;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x9002;&#x7528;&#x4E8E;&#x8303;&#x56F4;&#x66F4;&#x5E7F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x575A;&#x6301;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x7684; INI &#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x5668;&#xFF0C; &#x5728;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x6765;&#x81EA;&#x5176;&#x4ED6;&#x6765;&#x6E90;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x662F;&#x65E0;&#x7528;&#x7684;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#xFF0C;&#x6709;&#x72B6;&#x6001;&#x7684;&#x5BF9;&#x8C61;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x67D0;&#x4EF6;&#x4E8B;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5B8C;&#x6210;&#xFF0C;&#x5C31;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002; NPM &#x4E0A;&#x7684;&#x51E0;&#x4E2A; INI&#x200B;&#x200B; &#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x5668;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x63A5;&#x53E3;&#x98CE;&#x683C;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8BE5;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x5230;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x6700;&#x540E;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x65B9;&#x6CD5;&#x6765;&#x83B7;&#x53D6;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x4E1C;&#x897F;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x4F20;&#x7EDF;&#x4E2D;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x7CDF;&#x7CD5;&#x3002;&#x4F60;&#x4E0D;&#x80FD;&#x8C03;&#x7528;&#x5355;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x4EEA;&#x5F0F;&#xFF0C;&#x5728;&#x5404;&#x79CD;&#x72B6;&#x6001;&#x4E2D;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x3002;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x73B0;&#x5728;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x4E2D;&#xFF0C;&#x4E0E;&#x5B83;&#x4EA4;&#x4E92;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x90FD;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x8BE5;&#x7C7B;&#x578B;&#xFF0C;&#x4ECE;&#x800C;&#x4EA7;&#x751F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684; - &#x53EA;&#x6709;&#x5C11;&#x6570;&#x975E;&#x5E38;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7531;&#x8BED;&#x8A00;&#x6807;&#x51C6;&#x63D0;&#x4F9B;&#xFF0C;&#x5E76;&#x4E14;&#x8BB8;&#x591A;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x4E00;&#x5B9A;&#x6BD4;&#x6570;&#x7EC4;&#x6216;&#x6620;&#x5C04;&#x66F4;&#x590D;&#x6742;&#x3002; &#x4F46;&#x662F;&#x5F53;&#x6570;&#x7EC4;&#x8DB3;&#x591F;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x793A;&#x4F8B;&#x662F;&#x7B2C; 7 &#x7AE0;&#x7684;&#x56FE;&#x3002;JavaScript &#x4E2D;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x660E;&#x663E;&#x7684;&#x8868;&#x793A;&#x56FE;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x5728;&#x90A3;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x5C5E;&#x6027;&#x4FDD;&#x5B58;&#x4E86;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x7EC4; - &#x53EF;&#x4EE5;&#x4ECE;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x5230;&#x8FBE;&#x7684;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002;</p>
<p>NPM &#x4E0A;&#x6709;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5BFB;&#x8DEF;&#x5305;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x90FD;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x56FE;&#x7684;&#x683C;&#x5F0F;&#x3002; &#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x5141;&#x8BB8;&#x56FE;&#x7684;&#x8FB9;&#x5E26;&#x6709;&#x6743;&#x91CD;&#xFF0C;&#x5B83;&#x662F;&#x4E0E;&#x5176;&#x76F8;&#x5173;&#x7684;&#x6210;&#x672C;&#x6216;&#x8DDD;&#x79BB;&#xFF0C;&#x8FD9;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x8868;&#x793A;&#x4E2D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5B58;&#x5728;<code>dijkstrajs</code>&#x5305;&#x3002; &#x4E00;&#x79CD;&#x8457;&#x540D;&#x7684;&#x5BFB;&#x8DEF;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0E;&#x6211;&#x4EEC;&#x7684;<code>findRoute</code>&#x51FD;&#x6570;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;&#x8FEA;&#x79D1;&#x65AF;&#x7279;&#x62C9;&#xFF08;Dijkstra&#xFF09;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x9996;&#x5148;&#x7F16;&#x5199;&#x5B83;&#x7684;&#x827E;&#x5179;&#x683C;&#x5C14;&#xB7;&#x8FEA;&#x79D1;&#x65AF;&#x7279;&#x62C9;&#xFF08;Edsger Dijkstra&#xFF09;&#x547D;&#x540D;&#x3002; <code>js</code>&#x540E;&#x7F00;&#x901A;&#x5E38;&#x4F1A;&#x6DFB;&#x52A0;&#x5230;&#x5305;&#x540D;&#x79F0;&#x4E2D;&#xFF0C;&#x4EE5;&#x8868;&#x660E;&#x5B83;&#x4EEC;&#x7528; JavaScript &#x7F16;&#x5199;&#x3002; &#x8FD9;&#x4E2A;<code>dijkstrajs</code>&#x5305;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x56FE;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x662F;&#x6570;&#x5B57; - &#x8FB9;&#x7684;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5305;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x7684;&#x56FE;&#x4EE5;&#x5B83;&#x671F;&#x671B;&#x7684;&#x683C;&#x5F0F;&#x5B58;&#x50A8;&#x3002; &#x6240;&#x6709;&#x8FB9;&#x7684;&#x6743;&#x91CD;&#x90FD;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x7B80;&#x5316;&#x6A21;&#x578B;&#x5C06;&#x6BCF;&#x6761;&#x9053;&#x8DEF;&#x89C6;&#x4E3A;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6210;&#x672C;&#xFF08;&#x4E00;&#x4E2A;&#x56DE;&#x5408;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> {find_path} = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;dijkstrajs&quot;</span>);

<span class="hljs-keyword">let</span> graph = {};
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> node <span class="hljs-keyword">of</span> <span class="hljs-built_in">Object</span>.keys(roadGraph)) {
  <span class="hljs-keyword">let</span> edges = graph[node] = {};
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> dest <span class="hljs-keyword">of</span> roadGraph[node]) {
    edges[dest] = <span class="hljs-number">1</span>;
  }
}

<span class="hljs-built_in">console</span>.log(find_path(graph, <span class="hljs-string">&quot;Post Office&quot;</span>, <span class="hljs-string">&quot;Cabin&quot;</span>));
<span class="hljs-comment">// &#x2192; [&quot;Post Office&quot;, &quot;Alice&apos;s House&quot;, &quot;Cabin&quot;]</span>
</code></pre>
<p>&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x7EC4;&#x5408;&#x7684;&#x969C;&#x788D; - &#x5F53;&#x5404;&#x79CD;&#x5305;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x63CF;&#x8FF0;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5F88;&#x56F0;&#x96BE;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x8BBE;&#x8BA1;&#x53EF;&#x7EC4;&#x5408;&#x6027;&#xFF0C;&#x8BF7;&#x67E5;&#x627E;&#x5176;&#x4ED6;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x5728;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9075;&#x5FAA;&#x4ED6;&#x4EEC;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x901A;&#x8FC7;&#x5C06;&#x4EE3;&#x7801;&#x5206;&#x79BB;&#x6210;&#x5177;&#x6709;&#x6E05;&#x6670;&#x63A5;&#x53E3;&#x548C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x5757;&#xFF0C;&#x6A21;&#x5757;&#x662F;&#x66F4;&#x5927;&#x7684;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x3002; &#x63A5;&#x53E3;&#x662F;&#x6A21;&#x5757;&#x4E2D;&#x53EF;&#x4EE5;&#x4ECE;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x770B;&#x5230;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x662F;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x7531;&#x4E8E; JavaScript &#x5386;&#x53F2;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#xFF0C;&#x56E0;&#x6B64; CommonJS &#x7CFB;&#x7EDF;&#x5EFA;&#x7ACB;&#x5728;&#x5B83;&#x4E4B;&#x4E0A;&#x3002; &#x7136;&#x540E;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x786E;&#x5B9E;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x73B0;&#x5728;&#x4E0E; CommonJS &#x7CFB;&#x7EDF;&#x4E0D;&#x517C;&#x5BB9;&#x3002;</p>
<p>&#x5305;&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x5206;&#x53D1;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x3002; NPM &#x662F; JavaScript &#x5305;&#x7684;&#x4ED3;&#x5E93;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0A;&#x9762;&#x4E0B;&#x8F7D;&#x5404;&#x79CD;&#x6709;&#x7528;&#x7684;&#xFF08;&#x548C;&#x65E0;&#x7528;&#x7684;&#xFF09;&#x5305;&#x3002;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<h3 id="&#x6A21;&#x5757;&#x5316;&#x673A;&#x5668;&#x4EBA;">&#x6A21;&#x5757;&#x5316;&#x673A;&#x5668;&#x4EBA;</h3>
<p>&#x8FD9;&#x4E9B;&#x662F;&#x7B2C; 7 &#x7AE0;&#x7684;&#x9879;&#x76EE;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x7EA6;&#x675F;&#xFF1A;</p>
<pre><code>roads
buildGraph
roadGraph
VillageState
runRobot
randomPick
randomRobot
mailRoute
routeRobot
findRoute
goalOrientedRobot
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x5C06;&#x8BE5;&#x9879;&#x76EE;&#x7F16;&#x5199;&#x4E3A;&#x6A21;&#x5757;&#x5316;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x4F1A;&#x521B;&#x5EFA;&#x54EA;&#x4E9B;&#x6A21;&#x5757;&#xFF1F; &#x54EA;&#x4E2A;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x4E8E;&#x54EA;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x63A5;&#x53E3;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF1F;</p>
<p>&#x54EA;&#x4E9B;&#x7247;&#x6BB5;&#x53EF;&#x80FD;&#x5728; NPM &#x4E0A;&#x627E;&#x5230;&#xFF1F; &#x4F60;&#x613F;&#x610F;&#x4F7F;&#x7528; NPM &#x5305;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#xFF1F;</p>
<h3 id="roads&#x6A21;&#x5757;"><code>roads</code>&#x6A21;&#x5757;</h3>
<p>&#x6839;&#x636E;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x7F16;&#x5199; CommonJS &#x6A21;&#x5757;&#xFF0C;&#x8BE5;&#x6A21;&#x5757;&#x5305;&#x542B;&#x9053;&#x8DEF;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x5C06;&#x8868;&#x793A;&#x5B83;&#x4EEC;&#x7684;&#x56FE;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5BFC;&#x51FA;&#x4E3A;<code>roadGraph</code>&#x3002; &#x5B83;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A;&#x6A21;&#x5757;<code>./graph</code>&#xFF0C;&#x5B83;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>buildGraph</code>&#xFF0C;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x56FE;&#x3002; &#x8BE5;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x6570;&#x7EC4;&#xFF08;&#x9053;&#x8DEF;&#x7684;&#x8D77;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Add dependencies and exports</span>

<span class="hljs-keyword">const</span> roads = [
  <span class="hljs-string">&quot;Alice&apos;s House-Bob&apos;s House&quot;</span>,   <span class="hljs-string">&quot;Alice&apos;s House-Cabin&quot;</span>,
  <span class="hljs-string">&quot;Alice&apos;s House-Post Office&quot;</span>,   <span class="hljs-string">&quot;Bob&apos;s House-Town Hall&quot;</span>,
  <span class="hljs-string">&quot;Daria&apos;s House-Ernie&apos;s House&quot;</span>, <span class="hljs-string">&quot;Daria&apos;s House-Town Hall&quot;</span>,
  <span class="hljs-string">&quot;Ernie&apos;s House-Grete&apos;s House&quot;</span>, <span class="hljs-string">&quot;Grete&apos;s House-Farm&quot;</span>,
  <span class="hljs-string">&quot;Grete&apos;s House-Shop&quot;</span>,          <span class="hljs-string">&quot;Marketplace-Farm&quot;</span>,
  <span class="hljs-string">&quot;Marketplace-Post Office&quot;</span>,     <span class="hljs-string">&quot;Marketplace-Shop&quot;</span>,
  <span class="hljs-string">&quot;Marketplace-Town Hall&quot;</span>,       <span class="hljs-string">&quot;Shop-Town Hall&quot;</span>
];
</code></pre>
<h3 id="&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;">&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;</h3>
<p>&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;&#x662F;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x4E2D;&#x6A21;&#x5757; A &#x4F9D;&#x8D56;&#x4E8E; B&#xFF0C;&#x5E76;&#x4E14; B &#x4E5F;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x4F9D;&#x8D56;&#x4E8E; A&#x3002;&#x8BB8;&#x591A;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x5B8C;&#x5168;&#x7981;&#x6B62;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x4F60;&#x9009;&#x62E9;&#x4F55;&#x79CD;&#x987A;&#x5E8F;&#x6765;&#x52A0;&#x8F7D;&#x6B64;&#x7C7B;&#x6A21;&#x5757;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5728;&#x5B83;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x52A0;&#x8F7D;&#x3002;</p>
<p>CommonJS &#x6A21;&#x5757;&#x5141;&#x8BB8;&#x6709;&#x9650;&#x5F62;&#x5F0F;&#x7684;&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;&#x3002; &#x53EA;&#x8981;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x4E0D;&#x4F1A;&#x66FF;&#x6362;&#x5B83;&#x4EEC;&#x7684;&#x9ED8;&#x8BA4;<code>exports</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5B8C;&#x6210;&#x52A0;&#x8F7D;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x5BF9;&#x65B9;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;&#x5C31;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x524D;&#x9762;&#x7ED9;&#x51FA;&#x7684;<code>require</code>&#x51FD;&#x6570;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;&#x3002; &#x4F60;&#x80FD;&#x770B;&#x5230;&#x5B83;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5FAA;&#x73AF;&#x5417;&#xFF1F; &#x5F53;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x6A21;&#x5757;&#x66FF;&#x4EE3;&#x5176;&#x9ED8;&#x8BA4;<code>exports</code>&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="9.html" class="navigation navigation-prev " aria-label="Previous page: 九、正则表达式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11.html" class="navigation navigation-next " aria-label="Next page: 十一、异步编程">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十、模块","level":"1.12","depth":1,"next":{"title":"十一、异步编程","level":"1.13","depth":1,"path":"11.md","ref":"11.md","articles":[]},"previous":{"title":"九、正则表达式","level":"1.11","depth":1,"path":"9.md","ref":"9.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"10.md","mtime":"2019-12-08T16:07:04.979Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

