
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十一、异步编程 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12.html" />
    
    
    <link rel="prev" href="10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >十一、异步编程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x4E00;&#x3001;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;">&#x5341;&#x4E00;&#x3001;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/11_async.html" target="_blank">Asynchronous Programming</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x5B70;&#x80FD;&#x6D4A;&#x4EE5;&#x6F84;&#xFF1F;&#x9759;&#x4E4B;&#x5F90;&#x6E05;&#xFF1B;</p>
<p>&#x5B70;&#x80FD;&#x5B89;&#x4EE5;&#x4E45;&#xFF1F;&#x52A8;&#x4E4B;&#x5F90;&#x751F;&#x3002;</p>
<p>&#x8001;&#x5B50;&#xFF0C;&#x300A;&#x9053;&#x5FB7;&#x7ECF;&#x300B;</p>
</blockquote>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x79F0;&#x4E3A;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5B83;&#x6267;&#x884C;&#x6784;&#x6210;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x4E2A;&#x6B65;&#x9AA4;&#x3002; &#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x8BA9;&#x5904;&#x7406;&#x5668;&#x5FD9;&#x788C;&#xFF0C;&#x76F4;&#x5230;&#x4ED6;&#x4EEC;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x3002; &#x5904;&#x7406;&#x6570;&#x5B57;&#x7684;&#x5FAA;&#x73AF;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x53D6;&#x51B3;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x4E0E;&#x5904;&#x7406;&#x5668;&#x4E4B;&#x5916;&#x7684;&#x4E1C;&#x897F;&#x4EA4;&#x4E92;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x6216;&#x4ECE;&#x786C;&#x76D8;&#x8BF7;&#x6C42;&#x6570;&#x636E; - &#x8FD9;&#x6BD4;&#x4ECE;&#x5185;&#x5B58;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x8981;&#x6162;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x5F53;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x8BA9;&#x5904;&#x7406;&#x5668;&#x5904;&#x4E8E;&#x95F2;&#x7F6E;&#x72B6;&#x6001;&#x662F;&#x53EF;&#x803B;&#x7684; - &#x5728;&#x6B64;&#x671F;&#x95F4;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x5DE5;&#x4F5C;&#x3002; &#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x5B83;&#x7531;&#x4F60;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#xFF0C;&#x5B83;&#x5C06;&#x5728;&#x591A;&#x4E2A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x5904;&#x7406;&#x5668;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5355;&#x4E2A;&#x7A0B;&#x5E8F;&#x5728;&#x7B49;&#x5F85;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x65F6;&#x80FD;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5E2E;&#x52A9;&#x3002;</p>
<h2 id="&#x5F02;&#x6B65;">&#x5F02;&#x6B65;</h2>
<p>&#x5728;&#x540C;&#x6B65;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E00;&#x6B21;&#x53EA;&#x53D1;&#x751F;&#x4E00;&#x4EF6;&#x4E8B;&#x3002; &#x5F53;&#x4F60;&#x8C03;&#x7528;&#x6267;&#x884C;&#x957F;&#x65F6;&#x95F4;&#x64CD;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x5728;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x65F6;&#x8FD4;&#x56DE;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002; &#x8FD9;&#x4F1A;&#x5728;&#x4F60;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x505C;&#x6B62;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x6A21;&#x578B;&#x5141;&#x8BB8;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x591A;&#x4E2A;&#x4E8B;&#x4EF6;&#x3002; &#x5F53;&#x4F60;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#x65F6;&#xFF0C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4F1A;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002; &#x5F53;&#x52A8;&#x4F5C;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x6536;&#x5230;&#x901A;&#x77E5;&#x5E76;&#x8BBF;&#x95EE;&#x7ED3;&#x679C;&#xFF08;&#x4F8B;&#x5982;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5C0F;&#x4F8B;&#x5B50;&#x6765;&#x6BD4;&#x8F83;&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#xFF1A;&#x4E00;&#x4E2A;&#x4ECE;&#x7F51;&#x7EDC;&#x83B7;&#x53D6;&#x4E24;&#x4E2A;&#x8D44;&#x6E90;&#x7136;&#x540E;&#x5408;&#x5E76;&#x7ED3;&#x679C;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5728;&#x540C;&#x6B65;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x8BF7;&#x6C42;&#x51FD;&#x6570;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x540E;&#xFF0C;&#x5B83;&#x624D;&#x8FD4;&#x56DE;&#xFF0C;&#x6267;&#x884C;&#x6B64;&#x4EFB;&#x52A1;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x9010;&#x4E2A;&#x521B;&#x5EFA;&#x8BF7;&#x6C42;&#x3002; &#x8FD9;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x4EC5;&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BF7;&#x6C42;&#x624D;&#x4F1A;&#x542F;&#x52A8;&#x3002; &#x6240;&#x82B1;&#x8D39;&#x7684;&#x603B;&#x65F6;&#x95F4;&#x81F3;&#x5C11;&#x662F;&#x4E24;&#x4E2A;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x603B;&#x548C;&#x3002;</p>
<p>&#x5728;&#x540C;&#x6B65;&#x7CFB;&#x7EDF;&#x4E2D;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x542F;&#x52A8;&#x989D;&#x5916;&#x7684;&#x63A7;&#x5236;&#x7EBF;&#x7A0B;&#x3002; &#x7EBF;&#x7A0B;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x7684;&#x6267;&#x884C;&#x53EF;&#x80FD;&#x4F1A;&#x4EA4;&#x53C9;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0E;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x5F53;&#x4E2D; - &#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x3002; &#x7B2C;&#x4E8C;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#xFF0C;&#x4E4B;&#x540E;&#x5B83;&#x4EEC;&#x91CD;&#x65B0;&#x540C;&#x6B65;&#x6765;&#x7EC4;&#x5408;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5728;&#x4E0B;&#x56FE;&#x4E2D;&#xFF0C;&#x7C97;&#x7EBF;&#x8868;&#x793A;&#x7A0B;&#x5E8F;&#x6B63;&#x5E38;&#x82B1;&#x8D39;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7EC6;&#x7EBF;&#x8868;&#x793A;&#x7B49;&#x5F85;&#x7F51;&#x7EDC;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x3002; &#x5728;&#x540C;&#x6B65;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x7ED9;&#x5B9A;&#x63A7;&#x5236;&#x7EBF;&#x7A0B;&#x7684;&#x65F6;&#x95F4;&#x7EBF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x5728;&#x5F02;&#x6B65;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BB2;&#xFF0C;&#x542F;&#x52A8;&#x7F51;&#x7EDC;&#x64CD;&#x4F5C;&#x4F1A;&#x5BFC;&#x81F4;&#x65F6;&#x95F4;&#x8F74;&#x4E2D;&#x51FA;&#x73B0;&#x5206;&#x88C2;&#x3002; &#x542F;&#x52A8;&#x8BE5;&#x52A8;&#x4F5C;&#x7684;&#x7A0B;&#x5E8F;&#x5C06;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x52A8;&#x4F5C;&#x5C06;&#x4E0E;&#x5176;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x5728;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x65F6;&#x901A;&#x77E5;&#x8BE5;&#x7A0B;&#x5E8F;&#x3002;</p>
<p><img src="img/11-1.svg" alt=""></p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x63CF;&#x8FF0;&#x5DEE;&#x5F02;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x7B49;&#x5F85;&#x52A8;&#x4F5C;&#x5B8C;&#x6210;&#x5728;&#x540C;&#x6B65;&#x6A21;&#x578B;&#x4E2D;&#x662F;&#x9690;&#x5F0F;&#x7684;&#xFF0C;&#x800C;&#x5728;&#x5F02;&#x6B65;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x63A7;&#x5236;&#x4E4B;&#x4E0B;&#xFF0C;&#x5B83;&#x662F;&#x663E;&#x5F0F;&#x7684;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x6027;&#x662F;&#x4E2A;&#x53CC;&#x5203;&#x5251;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E0D;&#x9002;&#x5408;&#x76F4;&#x7EBF;&#x63A7;&#x5236;&#x6A21;&#x578B;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x76F4;&#x7EBF;&#x63A7;&#x5236;&#x7684;&#x7A0B;&#x5E8F;&#x66F4;&#x52A0;&#x7B28;&#x62D9;&#x3002; &#x672C;&#x7AE0;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x79CD;&#x7B28;&#x62D9;&#x3002;</p>
<p>&#x4E24;&#x79CD;&#x91CD;&#x8981;&#x7684; JavaScript &#x7F16;&#x7A0B;&#x5E73;&#x53F0;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x548C; Node.js&#xFF09;&#x90FD;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F9D;&#x8D56;&#x7EBF;&#x7A0B;&#x3002; &#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF08;&#x7406;&#x89E3;&#x7A0B;&#x5E8F;&#x5728;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4E8B;&#x60C5;&#x65F6;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#xFF09;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#x3002;</p>
<h2 id="&#x4E4C;&#x9E26;&#x79D1;&#x6280;">&#x4E4C;&#x9E26;&#x79D1;&#x6280;</h2>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x4E4C;&#x9E26;&#x975E;&#x5E38;&#x806A;&#x660E;&#x3002; &#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#xFF0C;&#x63D0;&#x524D;&#x8BA1;&#x5212;&#xFF0C;&#x8BB0;&#x4F4F;&#x4E8B;&#x60C5;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x6C9F;&#x901A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6211;&#x4EEC;&#x9690;&#x85CF;&#x5F97;&#x5F88;&#x597D;&#x3002;&#x6211;&#x542C;&#x8BF4;&#x4E00;&#x4E2A;&#x6709;&#x58F0;&#x671B;&#x7684;&#xFF08;&#x4F46;&#x4E5F;&#x6709;&#x70B9;&#x53E4;&#x602A;&#x7684;&#xFF09;&#x4E13;&#x5BB6; corvids &#x8BA4;&#x4E3A;&#xFF0C;&#x4E4C;&#x9E26;&#x6280;&#x672F;&#x5E76;&#x4E0D;&#x843D;&#x540E;&#x4E8E;&#x4EBA;&#x7C7B;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x8FCE;&#x5934;&#x8D76;&#x4E0A;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x4E4C;&#x9E26;&#x6587;&#x660E;&#x80FD;&#x591F;&#x6784;&#x5EFA;&#x8BA1;&#x7B97;&#x8BBE;&#x5907;&#x3002; &#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x662F;&#x7535;&#x5B50;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x4EBA;&#x7C7B;&#x7684;&#x8BA1;&#x7B97;&#x8BBE;&#x5907;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x64CD;&#x4F5C;&#x5FAE;&#x5C0F;&#x6606;&#x866B;&#x7684;&#x884C;&#x52A8;&#xFF0C;&#x8FD9;&#x79CD;&#x6606;&#x866B;&#x662F;&#x4E0E;&#x767D;&#x8681;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x7269;&#x79CD;&#xFF0C;&#x5B83;&#x4E0E;&#x4E4C;&#x9E26;&#x5F62;&#x6210;&#x4E86;&#x5171;&#x751F;&#x5173;&#x7CFB;&#x3002; &#x9E1F;&#x7C7B;&#x4E3A;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x98DF;&#x7269;&#xFF0C;&#x5BF9;&#x4E4B;&#x5BF9;&#x5E94;&#xFF0C;&#x6606;&#x866B;&#x5EFA;&#x7ACB;&#x5E76;&#x64CD;&#x4F5C;&#x590D;&#x6742;&#x7684;&#x6B96;&#x6C11;&#x5730;&#xFF0C;&#x5728;&#x5176;&#x5185;&#x90E8;&#x7684;&#x751F;&#x7269;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6B96;&#x6C11;&#x5730;&#x901A;&#x5E38;&#x4F4D;&#x4E8E;&#x5927;&#x800C;&#x4E45;&#x8FDC;&#x7684;&#x9E1F;&#x5DE2;&#x4E2D;&#x3002; &#x9E1F;&#x7C7B;&#x548C;&#x6606;&#x866B;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7403;&#x5F62;&#x7C98;&#x571F;&#x7ED3;&#x6784;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x9690;&#x85CF;&#x5728;&#x5DE2;&#x7684;&#x6811;&#x679D;&#x4E4B;&#x95F4;&#xFF0C;&#x6606;&#x866B;&#x5728;&#x5176;&#x4E2D;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4E0E;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x901A;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E9B;&#x673A;&#x5668;&#x4F7F;&#x7528;&#x5149;&#x4FE1;&#x53F7;&#x3002; &#x9E1F;&#x7C7B;&#x5728;&#x7279;&#x6B8A;&#x7684;&#x901A;&#x8BAF;&#x830E;&#x4E2D;&#x5D4C;&#x5165;&#x53CD;&#x5149;&#x6750;&#x6599;&#x7247;&#x6BB5;&#xFF0C;&#x6606;&#x866B;&#x6821;&#x51C6;&#x8FD9;&#x4E9B;&#x53CD;&#x5149;&#x6750;&#x6599;&#x5C06;&#x5149;&#x7EBF;&#x53CD;&#x5C04;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x7F16;&#x7801;&#x4E3A;&#x4E00;&#x7CFB;&#x5217;&#x5FEB;&#x901F;&#x95EA;&#x5149;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EA;&#x6709;&#x5177;&#x6709;&#x5B8C;&#x6574;&#x89C6;&#x89C9;&#x8FDE;&#x63A5;&#x7684;&#x5DE2;&#x624D;&#x80FD;&#x6C9F;&#x901A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x670B;&#x53CB; corvid &#x4E13;&#x5BB6;&#x5DF2;&#x7ECF;&#x7ED8;&#x5236;&#x4E86; Rh&#xF4;ne &#x6CB3;&#x7554;&#x7684; Hi&#xE8;res-sur-Amby &#x6751;&#x7684;&#x4E4C;&#x9E26;&#x9E1F;&#x5DE2;&#x7F51;&#x7EDC;&#x3002; &#x8FD9;&#x5F20;&#x5730;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x9E1F;&#x5DE2;&#x53CA;&#x5176;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x9707;&#x60CA;&#x7684;&#x8D8B;&#x540C;&#x8FDB;&#x5316;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E4C;&#x9E26;&#x8BA1;&#x7B97;&#x673A;&#x8FD0;&#x884C; JavaScript&#x3002; &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E3A;&#x4ED6;&#x4EEC;&#x7F16;&#x5199;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x7F51;&#x7EDC;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="img/11-2.png" alt=""></p>
<h2 id="&#x56DE;&#x8C03;">&#x56DE;&#x8C03;</h2>
<p>&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x6267;&#x884C;&#x6162;&#x52A8;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x989D;&#x5916;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x52A8;&#x4F5C;&#x5F00;&#x59CB;&#xFF0C;&#x5F53;&#x5B83;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x7ED3;&#x679C;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728; Node.js &#x548C;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x90FD;&#x53EF;&#x7528;&#x7684;<code>setTimeout</code>&#x51FD;&#x6570;&#xFF0C;&#x7B49;&#x5F85;&#x7ED9;&#x5B9A;&#x7684;&#x6BEB;&#x79D2;&#x6570;&#xFF08;&#x4E00;&#x79D2;&#x4E3A;&#x4E00;&#x5343;&#x6BEB;&#x79D2;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js">setTimeout(() =&gt; <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Tick&quot;</span>), <span class="hljs-number">500</span>);
</code></pre>
<p>&#x7B49;&#x5F85;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x5728;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#x66F4;&#x65B0;&#x52A8;&#x753B;&#x6216;&#x68C0;&#x67E5;&#x67D0;&#x4EF6;&#x4E8B;&#x662F;&#x5426;&#x82B1;&#x8D39;&#x6BD4;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x5728;&#x4E00;&#x884C;&#x4E2D;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5FC5;&#x987B;&#x4E0D;&#x65AD;&#x4F20;&#x9012;&#x65B0;&#x51FD;&#x6570;&#x6765;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#x7684;&#x8BA1;&#x7B97;&#x5EF6;&#x7EED;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x4E4C;&#x9E26;&#x9E1F;&#x5DE2;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x523B;&#x5728;&#x5C0F;&#x6811;&#x679D;&#x4E0A;&#xFF0C;&#x4EE5;&#x4FBF;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x68C0;&#x7D22;&#x3002;&#x96D5;&#x523B;&#x6216;&#x67E5;&#x627E;&#x4E00;&#x6BB5;&#x6570;&#x636E;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x957F;&#x671F;&#x5B58;&#x50A8;&#x7684;&#x63A5;&#x53E3;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5B58;&#x50A8;&#x5668;&#x6309;&#x7167;&#x540D;&#x79F0;&#x5B58;&#x50A8; JSON &#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x7247;&#x6BB5;&#x3002;&#x4E4C;&#x9E26;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x5B83;&#x9690;&#x85CF;&#x98DF;&#x7269;&#x7684;&#x5730;&#x65B9;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x540D;&#x79F0;&#x4E3A;<code>&quot;food caches&quot;</code>&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x6307;&#x5411;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7247;&#x6BB5;&#x7684;&#x540D;&#x79F0;&#x6570;&#x7EC4;&#xFF0C;&#x63CF;&#x8FF0;&#x5B9E;&#x9645;&#x7684;&#x7F13;&#x5B58;&#x3002;&#x4E3A;&#x4E86;&#x5728; Big Oak &#x9E1F;&#x5DE2;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x67E5;&#x627E;&#x98DF;&#x7269;&#x7F13;&#x5B58;&#xFF0C;&#x4E4C;&#x9E26;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> {bigOak} <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./crow-tech&quot;</span>;

bigOak.readStorage(<span class="hljs-string">&quot;food caches&quot;</span>, caches =&gt; {
  <span class="hljs-keyword">let</span> firstCache = caches[<span class="hljs-number">0</span>];
  bigOak.readStorage(firstCache, info =&gt; {
    <span class="hljs-built_in">console</span>.log(info);
  });
});
</code></pre>
<p>&#xFF08;&#x6240;&#x6709;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x5DF2;&#x4ECE;&#x4E4C;&#x9E26;&#x8BED;&#x7FFB;&#x8BD1;&#x6210;&#x82F1;&#x8BED;&#x3002;&#xFF09;</p>
<p>&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x7F29;&#x8FDB;&#x7EA7;&#x522B;&#x968F;&#x7740;&#x6BCF;&#x4E2A;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x800C;&#x589E;&#x52A0;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6700;&#x7EC8;&#x4F1A;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x3002; &#x505A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x52A8;&#x4F5C;&#xFF0C;&#x4F1A;&#x53D8;&#x5F97;&#x6709;&#x70B9;&#x7B28;&#x62D9;&#x3002;</p>
<p>&#x4E4C;&#x9E26;&#x9E1F;&#x5DE2;&#x8BA1;&#x7B97;&#x673A;&#x4E3A;&#x4F7F;&#x7528;&#x8BF7;&#x6C42;-&#x54CD;&#x5E94;&#x5BF9;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x800C;&#x6784;&#x5EFA;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#xFF0C;&#x786E;&#x8BA4;&#x6536;&#x5230;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x5BF9;&#x6D88;&#x606F;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#x7684;&#x56DE;&#x590D;&#x3002;</p>
<p>&#x6BCF;&#x6761;&#x6D88;&#x606F;&#x90FD;&#x6807;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002; &#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x4E3A;&#x7279;&#x5B9A;&#x7684;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x8FD9;&#x6837;&#x7684;&#x8BF7;&#x6C42;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x8C03;&#x7528;&#x5904;&#x7406;&#x5668;&#x6765;&#x4EA7;&#x751F;&#x54CD;&#x5E94;&#x3002;</p>
<p><code>&quot;./crow-tech&quot;</code>&#x6A21;&#x5757;&#x6240;&#x5BFC;&#x51FA;&#x7684;&#x63A5;&#x53E3;&#x4E3A;&#x901A;&#x4FE1;&#x63D0;&#x4F9B;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x51FD;&#x6570;&#x3002; &#x9E1F;&#x5DE2;&#x62E5;&#x6709;<code>send</code>&#x65B9;&#x6CD5;&#x6765;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002; &#x5B83;&#x63A5;&#x53D7;&#x76EE;&#x6807;&#x9E1F;&#x5DE2;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x8BF7;&#x6C42;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x8BF7;&#x6C42;&#x7684;&#x5185;&#x5BB9;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x524D;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F5C;&#x4E3A;&#x5176;&#x7B2C;&#x56DB;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x54CD;&#x5E94;&#x5230;&#x8FBE;&#x65F6;&#x8C03;&#x7528;&#x3002;</p>
<pre><code class="lang-js">bigOak.send(<span class="hljs-string">&quot;Cow Pasture&quot;</span>, <span class="hljs-string">&quot;note&quot;</span>, <span class="hljs-string">&quot;Let&apos;s caw loudly at 7PM&quot;</span>,
            () =&gt; <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Note delivered.&quot;</span>));
</code></pre>
<p>&#x4F46;&#x4E3A;&#x4E86;&#x4F7F;&#x9E1F;&#x5DE2;&#x80FD;&#x591F;&#x63A5;&#x6536;&#x8BE5;&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x5B9A;&#x4E49;&#x540D;&#x4E3A;<code>&quot;note&quot;</code>&#x7684;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#x3002; &#x5904;&#x7406;&#x8BF7;&#x6C42;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x4EC5;&#x8981;&#x5728;&#x8FD9;&#x53F0;&#x9E1F;&#x5DE2;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x8FD0;&#x884C;&#x5728;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x6B64;&#x7C7B;&#x6D88;&#x606F;&#x7684;&#x9E1F;&#x5DE2;&#x4E0A;&#x3002; &#x6211;&#x4EEC;&#x53EA;&#x5047;&#x5B9A;&#x4E00;&#x53EA;&#x4E4C;&#x9E26;&#x98DE;&#x8FC7;&#x53BB;&#xFF0C;&#x5E76;&#x5C06;&#x6211;&#x4EEC;&#x7684;&#x5904;&#x7406;&#x5668;&#x4EE3;&#x7801;&#x5B89;&#x88C5;&#x5728;&#x6240;&#x6709;&#x7684;&#x9E1F;&#x5DE2;&#x4E2D;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> {defineRequestType} <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./crow-tech&quot;</span>;

defineRequestType(<span class="hljs-string">&quot;note&quot;</span>, (nest, content, source, done) =&gt; {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">`<span class="hljs-subst">${nest.name}</span> received note: <span class="hljs-subst">${content}</span>`</span>);
  done();
});
</code></pre>
<p><code>defineRequestType</code>&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#x3002;&#x8BE5;&#x793A;&#x4F8B;&#x6DFB;&#x52A0;&#x4E86;&#x5BF9;<code>&quot;note&quot;</code>&#x8BF7;&#x6C42;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x5411;&#x7ED9;&#x5B9A;&#x7684;&#x9E1F;&#x5DE2;&#x53D1;&#x9001;&#x5907;&#x6CE8;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x73B0;&#x8C03;&#x7528;<code>console.log</code>&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x8BF7;&#x6C42;&#x5230;&#x8FBE;&#x3002;&#x9E1F;&#x5DE2;&#x6709;<code>name</code>&#x5C5E;&#x6027;&#xFF0C;&#x4FDD;&#x5B58;&#x4ED6;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#x3002;</p>
<p>&#x7ED9;<code>handler</code>&#x7684;&#x7B2C;&#x56DB;&#x4E2A;&#x53C2;&#x6570;done&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5728;&#x5B8C;&#x6210;&#x8BF7;&#x6C42;&#x65F6;&#x5FC5;&#x987B;&#x8C03;&#x7528;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x5904;&#x7406;&#x5668;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4F5C;&#x4E3A;&#x54CD;&#x5E94;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x5668;&#x672C;&#x8EAB;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x3002;&#x6267;&#x884C;&#x5F02;&#x6B65;&#x5DE5;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#x901A;&#x5E38;&#x4F1A;&#x5728;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;&#x8FD4;&#x56DE;&#xFF0C;&#x5B89;&#x6392;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5728;&#x5B8C;&#x6210;&#x65F6;&#x8C03;&#x7528;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5F02;&#x6B65;&#x673A;&#x5236; - &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570; - &#x5728;&#x54CD;&#x5E94;&#x53EF;&#x7528;&#x65F6;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x5F02;&#x6B65;&#x6027;&#x662F;&#x4F20;&#x67D3;&#x7684;&#x3002;&#x4EFB;&#x4F55;&#x8C03;&#x7528;&#x5F02;&#x6B65;&#x7684;&#x51FD;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x672C;&#x8EAB;&#x90FD;&#x5FC5;&#x987B;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x673A;&#x5236;&#x6765;&#x4F20;&#x9012;&#x5176;&#x7ED3;&#x679C;&#x3002;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x6BD4;&#x7B80;&#x5355;&#x5730;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x503C;&#x66F4;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x6240;&#x4EE5;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6784;&#x5EFA;&#x7A0B;&#x5E8F;&#x7684;&#x8F83;&#x5927;&#x90E8;&#x5206;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x3002;</p>
<h2 id="promise"><code>Promise</code></h2>
<p>&#x5F53;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x53EF;&#x4EE5;&#x7528;&#x503C;&#x8868;&#x793A;&#x65F6;&#xFF0C;&#x5904;&#x7406;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x901A;&#x5E38;&#x66F4;&#x5BB9;&#x6613;&#x3002; &#x5728;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x6392;&#x5C06;&#x6765;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x672A;&#x6765;&#x4E8B;&#x4EF6;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6807;&#x51C6;&#x7C7B;<code>Promise</code>&#x7684;&#x7528;&#x9014;&#x3002; <code>Promise</code>&#x662F;&#x4E00;&#x79CD;&#x5F02;&#x6B65;&#x884C;&#x4E3A;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x5B8C;&#x6210;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x5F53;&#x503C;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x901A;&#x77E5;&#x4EFB;&#x4F55;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x521B;&#x5EFA;<code>Promise</code>&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x8C03;&#x7528;<code>Promise.resolve</code>&#x3002; &#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x786E;&#x4FDD;&#x4F60;&#x7ED9;&#x5B83;&#x7684;&#x503C;&#x5305;&#x542B;&#x5728;&#x4E00;&#x4E2A;<code>Promise</code>&#x4E2D;&#x3002; &#x5982;&#x679C;&#x5B83;&#x5DF2;&#x7ECF;&#x662F;<code>Promise</code>&#xFF0C;&#x90A3;&#x4E48;&#x4EC5;&#x4EC5;&#x8FD4;&#x56DE;&#x5B83; - &#x5426;&#x5219;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;<code>Promise</code>&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4F60;&#x7684;&#x503C;&#x7ACB;&#x5373;&#x7ED3;&#x675F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> fifteen = <span class="hljs-built_in">Promise</span>.resolve(<span class="hljs-number">15</span>);
fifteen.then(value =&gt; <span class="hljs-built_in">console</span>.log(<span class="hljs-string">`Got <span class="hljs-subst">${value}</span>`</span>));
<span class="hljs-comment">// &#x2192; Got 15</span>
</code></pre>
<p>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;<code>Promise</code>&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x7684;<code>then</code>&#x65B9;&#x6CD5;&#x3002; &#x5B83;&#x6CE8;&#x518C;&#x4E86;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5F53;<code>Promise</code>&#x89E3;&#x6790;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x591A;&#x4E2A;&#x56DE;&#x8C03;&#x6DFB;&#x52A0;&#x5230;&#x5355;&#x4E2A;<code>Promise</code>&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x5728;<code>Promise</code>&#x89E3;&#x6790;&#xFF08;&#x5B8C;&#x6210;&#xFF09;&#x540E;&#x6DFB;&#x52A0;&#x5B83;&#x4EEC;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x4F46;&#x90A3;&#x4E0D;&#x662F;<code>then</code>&#x65B9;&#x6CD5;&#x6240;&#x505A;&#x7684;&#x4E00;&#x5207;&#x3002; &#x5B83;&#x8FD4;&#x56DE;&#x53E6;&#x4E00;&#x4E2A;<code>Promise</code>&#xFF0C;&#x5B83;&#x89E3;&#x6790;&#x5904;&#x7406;&#x5668;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x8FD4;&#x56DE;<code>Promise</code>&#xFF0C;&#x5219;&#x7B49;&#x5F85;&#x8BE5;<code>Promise</code>&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x6790;&#x4E3A;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5C06;<code>Promise</code>&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#xFF0C;&#x5C06;&#x503C;&#x8F6C;&#x5316;&#x4E3A;&#x5F02;&#x6B65;&#x73B0;&#x5B9E;&#xFF0C;&#x662F;&#x6709;&#x7528;&#x5904;&#x7684;&#x3002; &#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x503C;&#x5C31;&#x5728;&#x90A3;&#x91CC;&#x3002;promised &#x7684;&#x503C;&#x662F;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x6216;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x503C;&#x3002; &#x6839;&#x636E;<code>Promise</code>&#x5B9A;&#x4E49;&#x7684;&#x8BA1;&#x7B97;&#x5BF9;&#x8FD9;&#x4E9B;&#x5305;&#x88C5;&#x503C;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x5E76;&#x5728;&#x503C;&#x53EF;&#x7528;&#x65F6;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x521B;&#x5EFA;<code>Promise</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;<code>Promise</code>&#x7528;&#x4F5C;&#x6784;&#x9020;&#x5668;&#x3002; &#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x70B9;&#x5947;&#x602A;&#x7684;&#x63A5;&#x53E3; - &#x6784;&#x9020;&#x5668;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x4F1A;&#x7ACB;&#x5373;&#x8C03;&#x7528;&#xFF0C;&#x5E76;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x89E3;&#x6790;&#x8FD9;&#x4E2A;<code>Promise</code>&#x3002; &#x5B83;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;<code>resolve</code>&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x53EA;&#x6709;&#x521B;&#x5EFA;<code>Promise</code>&#x7684;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x89E3;&#x6790;&#x5B83;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3A;<code>readStorage</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x57FA;&#x4E8E;<code>Promise</code>&#x7684;&#x63A5;&#x53E3;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">storage</span>(<span class="hljs-params">nest, name</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(resolve =&gt; {
    nest.readStorage(name, result =&gt; resolve(result));
  });
}

storage(bigOak, <span class="hljs-string">&quot;enemies&quot;</span>)
  .then(value =&gt; <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Got&quot;</span>, value));
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x503C;&#x3002; &#x8FD9;&#x662F;<code>Promise</code>&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x70B9; - &#x5B83;&#x4EEC;&#x7B80;&#x5316;&#x4E86;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x7684;&#x4F7F;&#x7528;&#x3002; &#x57FA;&#x4E8E;<code>Promise</code>&#x7684;&#x51FD;&#x6570;&#x4E0D;&#x9700;&#x8981;&#x4F20;&#x9012;&#x56DE;&#x8C03;&#xFF0C;&#x800C;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;&#x5E38;&#x89C4;&#x51FD;&#x6570;&#xFF1A;&#x5B83;&#x4EEC;&#x5C06;&#x8F93;&#x5165;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x5E76;&#x8FD4;&#x56DE;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#x662F;&#x8F93;&#x51FA;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x53EF;&#x7528;&#x3002;</p>
<h2 id="&#x6545;&#x969C;">&#x6545;&#x969C;</h2>
<blockquote>
<p>&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x8FD9;&#x6BB5;&#x5982;&#x679C;&#x6709;&#x914D;&#x5957;&#x4EE3;&#x7801;&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#xFF0C;&#x6240;&#x4EE5;&#x51D1;&#x5408;&#x770B;&#x5427;&#x3002;</p>
</blockquote>
<p>&#x5E38;&#x89C4;&#x7684; JavaScript &#x8BA1;&#x7B97;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x800C;&#x5931;&#x8D25;&#x3002; &#x5F02;&#x6B65;&#x8BA1;&#x7B97;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x3002; &#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x6216;&#x8005;&#x4F5C;&#x4E3A;&#x5F02;&#x6B65;&#x8BA1;&#x7B97;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x67D0;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x7684;&#x56DE;&#x8C03;&#x98CE;&#x683C;&#x4E2D;&#x6700;&#x7D27;&#x8FEB;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x786E;&#x4FDD;&#x5C06;&#x6545;&#x969C;&#x6B63;&#x786E;&#x5730;&#x62A5;&#x544A;&#x7ED9;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x7EA6;&#x5B9A;&#x662F;&#xFF0C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x793A;&#x64CD;&#x4F5C;&#x5931;&#x8D25;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x5305;&#x542B;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x65F6;&#x751F;&#x6210;&#x7684;&#x503C;&#x3002; &#x8FD9;&#x79CD;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x68C0;&#x67E5;&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x6536;&#x5230;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x5F15;&#x8D77;&#x7684;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x6240;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x90FD;&#x4F1A;&#x88AB;&#x6355;&#x83B7;&#x5E76;&#x63D0;&#x4F9B;&#x7ED9;&#x6B63;&#x786E;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p><code>Promise</code>&#x4F7F;&#x8FD9;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5B83;&#x4EEC;&#xFF08;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x5B8C;&#x6210;&#xFF09;&#x6216;&#x62D2;&#x7EDD;&#xFF08;&#x6545;&#x969C;&#xFF09;&#x3002;&#x53EA;&#x6709;&#x5728;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x8C03;&#x7528;&#x89E3;&#x6790;&#x5904;&#x7406;&#x5668;&#xFF08;&#x4F7F;&#x7528;<code>then</code>&#x6CE8;&#x518C;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x62D2;&#x7EDD;&#x4F1A;&#x81EA;&#x52A8;&#x4F20;&#x64AD;&#x7ED9;&#x7531;<code>then</code>&#x8FD4;&#x56DE;&#x7684;&#x65B0;<code>Promise</code>&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x8FD9;&#x4F1A;&#x81EA;&#x52A8;&#x4F7F;<code>then</code>&#x8C03;&#x7528;&#x4EA7;&#x751F;&#x7684;<code>Promise</code>&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x94FE;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x6574;&#x4E2A;&#x94FE;&#x7684;&#x7ED3;&#x679C;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x62D2;&#x7EDD;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x8C03;&#x7528;&#x5931;&#x8D25;&#x4F4D;&#x7F6E;&#x4E4B;&#x540E;&#x7684;&#x4EFB;&#x4F55;&#x5E38;&#x89C4;&#x5904;&#x7406;&#x5668;&#x3002;</p>
<p>&#x5C31;&#x50CF;<code>Promise</code>&#x7684;&#x89E3;&#x6790;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x62D2;&#x7EDD;&#x5B83;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x62D2;&#x7EDD;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5F53;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x5BFC;&#x81F4;&#x62D2;&#x7EDD;&#x65F6;&#xFF0C;&#x5F02;&#x5E38;&#x503C;&#x5C06;&#x7528;&#x4F5C;&#x539F;&#x56E0;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x5904;&#x7406;&#x5668;&#x8FD4;&#x56DE;&#x88AB;&#x62D2;&#x7EDD;&#x7684;<code>Promise</code>&#x65F6;&#xFF0C;&#x62D2;&#x7EDD;&#x6D41;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;<code>Promise</code>&#x3002;<code>Promise.reject</code>&#x51FD;&#x6570;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#xFF0C;&#x7ACB;&#x5373;&#x88AB;&#x62D2;&#x7EDD;&#x7684;<code>Promise</code>&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x660E;&#x786E;&#x5730;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x62D2;&#x7EDD;&#xFF0C;<code>Promise</code>&#x6709;&#x4E00;&#x4E2A;<code>catch</code>&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5F53;<code>Promise</code>&#x88AB;&#x62D2;&#x7EDD;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x5904;&#x7406;&#x6B63;&#x5E38;&#x89E3;&#x6790;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x8FD9;&#x4E5F;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;<code>then</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x7684;<code>Promise</code>&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x6B63;&#x5E38;&#x89E3;&#x6790;&#xFF0C;&#x5B83;&#x5C06;&#x89E3;&#x6790;&#x539F;&#x59CB;<code>Promise</code>&#x7684;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;<code>catch</code>&#x5904;&#x7406;&#x5668;&#x7684;&#x7ED3;&#x679C;&#x3002; &#x5982;&#x679C;<code>catch</code>&#x5904;&#x7406;&#x5668;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x65B0;&#x7684;<code>Promise</code>&#x4E5F;&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x7B80;&#x5199;&#xFF0C;<code>then</code>&#x8FD8;&#x63A5;&#x53D7;&#x62D2;&#x7EDD;&#x5904;&#x7406;&#x5668;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x4E2D;&#xFF0C;&#x88C5;&#x914D;&#x8FD9;&#x4E24;&#x79CD;&#x7684;&#x5904;&#x7406;&#x5668;&#x3002;</p>
<p>&#x4F20;&#x9012;&#x7ED9;<code>Promise</code>&#x6784;&#x9020;&#x5668;&#x7684;&#x51FD;&#x6570;&#x63A5;&#x6536;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4E0E;&#x89E3;&#x6790;&#x51FD;&#x6570;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x62D2;&#x7EDD;&#x65B0;&#x7684;<code>Promise</code>&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>then</code>&#x548C;<code>catch</code>&#x521B;&#x5EFA;&#x7684;<code>Promise</code>&#x503C;&#x7684;&#x94FE;&#x6761;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x5F02;&#x6B65;&#x503C;&#x6216;&#x5931;&#x8D25;&#x6CBF;&#x7740;&#x5B83;&#x79FB;&#x52A8;&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#x3002; &#x7531;&#x4E8E;&#x8FD9;&#x79CD;&#x94FE;&#x6761;&#x901A;&#x8FC7;&#x6CE8;&#x518C;&#x5904;&#x7406;&#x5668;&#x6765;&#x521B;&#x5EFA;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x94FE;&#x6761;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x5904;&#x7406;&#x5668;&#x6216;&#x4E0E;&#x5176;&#x5173;&#x8054;&#x7684;&#x62D2;&#x7EDD;&#x5904;&#x7406;&#x5668;&#xFF08;&#x6216;&#x4E24;&#x8005;&#x90FD;&#x6709;&#xFF09;&#x3002; &#x4E0D;&#x5339;&#x914D;&#x7ED3;&#x679C;&#x7C7B;&#x578B;&#xFF08;&#x6210;&#x529F;&#x6216;&#x5931;&#x8D25;&#xFF09;&#x7684;&#x5904;&#x7406;&#x5668;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#x3002; &#x4F46;&#x662F;&#x90A3;&#x4E9B;&#x5339;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#x51B3;&#x5B9A;&#x4E86;&#x4E0B;&#x4E00;&#x6B21;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x503C; -- &#x8FD4;&#x56DE;&#x975E;<code>Promise</code>&#x503C;&#x65F6;&#x6210;&#x529F;&#xFF0C;&#x5F53;&#x5B83;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x65F6;&#x62D2;&#x7EDD;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x5B83;&#x8FD4;&#x56DE;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x65F6;&#x662F;<code>Promise</code>&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x73AF;&#x5883;&#x5904;&#x7406;&#x672A;&#x6355;&#x83B7;&#x7684;&#x5F02;&#x5E38;&#x4E00;&#x6837;&#xFF0C;JavaScript &#x73AF;&#x5883;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x672A;&#x5904;&#x7406;<code>Promise</code>&#x62D2;&#x7EDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x62A5;&#x544A;&#x4E3A;&#x9519;&#x8BEF;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x662F;&#x56F0;&#x96BE;&#x7684;">&#x7F51;&#x7EDC;&#x662F;&#x56F0;&#x96BE;&#x7684;</h2>
<p>&#x5076;&#x5C14;&#xFF0C;&#x4E4C;&#x9E26;&#x7684;&#x955C;&#x50CF;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5149;&#x7EBF;&#x6765;&#x4F20;&#x8F93;&#x4FE1;&#x53F7;&#xFF0C;&#x6216;&#x8005;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x963B;&#x6321;&#x4E86;&#x4FE1;&#x53F7;&#x7684;&#x8DEF;&#x5F84;&#x3002; &#x4FE1;&#x53F7;&#x53EF;&#x80FD;&#x53D1;&#x9001;&#x4E86;&#xFF0C;&#x4F46;&#x4ECE;&#x672A;&#x6536;&#x5230;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x53EA;&#x4F1A;&#x5BFC;&#x81F4;&#x63D0;&#x4F9B;&#x7ED9;<code>send</code>&#x7684;&#x56DE;&#x8C03;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x505C;&#x6B62;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x95EE;&#x9898;&#x3002; &#x5982;&#x679C;&#x5728;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x56DE;&#x5E94;&#x7684;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#xFF0C;&#x8BF7;&#x6C42;&#x4F1A;&#x8D85;&#x65F6;&#x5E76;&#x62A5;&#x544A;&#x6545;&#x969C;&#xFF0C;&#x90A3;&#x5C31;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F20;&#x8F93;&#x6545;&#x969C;&#x662F;&#x968F;&#x673A;&#x4E8B;&#x6545;&#xFF0C;&#x4F8B;&#x5982;&#x6C7D;&#x8F66;&#x7684;&#x524D;&#x706F;&#x4F1A;&#x5E72;&#x6270;&#x5149;&#x4FE1;&#x53F7;&#xFF0C;&#x53EA;&#x9700;&#x91CD;&#x8BD5;&#x8BF7;&#x6C42;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x5176;&#x6210;&#x529F;&#x3002; &#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x5B83;&#x65F6;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x8BF7;&#x6C42;&#x51FD;&#x6570;&#x5728;&#x653E;&#x5F03;&#x4E4B;&#x524D;&#x81EA;&#x52A8;&#x91CD;&#x8BD5;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x51E0;&#x6B21;&#x3002;</p>
<p>&#x800C;&#x4E14;&#xFF0C;&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;<code>Promise</code>&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x8BF7;&#x6C42;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>Promise</code>&#x3002; &#x5BF9;&#x4E8E;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x56DE;&#x8C03;&#x548C;<code>Promise</code>&#x662F;&#x7B49;&#x540C;&#x7684;&#x3002; &#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x6253;&#x5305;&#xFF0C;&#x6765;&#x516C;&#x5F00;&#x57FA;&#x4E8E;<code>Promise</code>&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x8BF7;&#x6C42;&#x53CA;&#x5176;&#x54CD;&#x5E94;&#x5DF2;&#x6210;&#x529F;&#x4F20;&#x9012;&#xFF0C;&#x54CD;&#x5E94;&#x4E5F;&#x53EF;&#x80FD;&#x8868;&#x660E;&#x5931;&#x8D25; - &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#x6216;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x4F1A;&#x5F15;&#x53D1;&#x9519;&#x8BEF;&#x3002; &#x4E3A;&#x4E86;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#xFF0C;<code>send</code>&#x548C;<code>defineRequestType</code>&#x9075;&#x5FAA;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x60EF;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x4F20;&#x9012;&#x7ED9;&#x56DE;&#x8C03;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x6545;&#x969C;&#x539F;&#x56E0;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x7531;&#x6211;&#x4EEC;&#x7684;&#x5305;&#x88C5;&#x7FFB;&#x8BD1;&#x6210;<code>Promise</code>&#x7684;&#x89E3;&#x6790;&#x548C;&#x62D2;&#x7EDD;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Timeout</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Error</span> </span>{}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">request</span>(<span class="hljs-params">nest, target, type, content</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>((resolve, reject) =&gt; {
    <span class="hljs-keyword">let</span> done = <span class="hljs-literal">false</span>;
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">attempt</span>(<span class="hljs-params">n</span>) </span>{
      nest.send(target, type, content, (failed, value) =&gt; {
        done = <span class="hljs-literal">true</span>;
        <span class="hljs-keyword">if</span> (failed) reject(failed);
        <span class="hljs-keyword">else</span> resolve(value);
      });
      setTimeout(() =&gt; {
        <span class="hljs-keyword">if</span> (done) <span class="hljs-keyword">return</span>;
        <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (n &lt; <span class="hljs-number">3</span>) attempt(n + <span class="hljs-number">1</span>);
        <span class="hljs-keyword">else</span> reject(<span class="hljs-keyword">new</span> Timeout(<span class="hljs-string">&quot;Timed out&quot;</span>));
      }, <span class="hljs-number">250</span>);
    }
    attempt(<span class="hljs-number">1</span>);
  });
}
</code></pre>
<p>&#x56E0;&#x4E3A;<code>Promise</code>&#x53EA;&#x80FD;&#x89E3;&#x6790;&#xFF08;&#x6216;&#x62D2;&#x7EDD;&#xFF09;&#x4E00;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002; &#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;<code>resolve</code>&#x6216;<code>reject</code>&#x4F1A;&#x51B3;&#x5B9A;<code>Promise</code>&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x4E14;&#x4EFB;&#x4F55;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x8C03;&#x7528;&#xFF08;&#x4F8B;&#x5982;&#x8BF7;&#x6C42;&#x7ED3;&#x675F;&#x540E;&#x5230;&#x8FBE;&#x7684;&#x8D85;&#x65F6;&#xFF0C;&#x6216;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x7ED3;&#x675F;&#x540E;&#x8FD4;&#x56DE;&#x7684;&#x8BF7;&#x6C42;&#xFF09;&#x90FD;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x5F02;&#x6B65;&#x5FAA;&#x73AF;&#xFF0C;&#x5BF9;&#x4E8E;&#x91CD;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x51FD;&#x6570; - &#x5E38;&#x89C4;&#x5FAA;&#x73AF;&#x4E0D;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x505C;&#x6B62;&#x5E76;&#x7B49;&#x5F85;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x3002; <code>attempt</code>&#x51FD;&#x6570;&#x5C1D;&#x8BD5;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x4E00;&#x6B21;&#x3002; &#x5B83;&#x8FD8;&#x8BBE;&#x7F6E;&#x4E86;&#x8D85;&#x65F6;&#xFF0C;&#x5982;&#x679C; 250 &#x6BEB;&#x79D2;&#x540E;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#xFF0C;&#x5219;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x7B2C;&#x56DB;&#x6B21;&#x5C1D;&#x8BD5;&#xFF0C;&#x5219;&#x4EE5;<code>Timeout</code>&#x5B9E;&#x4F8B;&#x4E3A;&#x7406;&#x7531;&#x62D2;&#x7EDD;&#x8BE5;<code>Promise</code>&#x3002;</p>
<p>&#x6BCF;&#x56DB;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#x91CD;&#x8BD5;&#x4E00;&#x6B21;&#xFF0C;&#x4E00;&#x79D2;&#x949F;&#x540E;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x5C31;&#x653E;&#x5F03;&#xFF0C;&#x8FD9;&#x7EDD;&#x5BF9;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x3002; &#x751A;&#x81F3;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x786E;&#x5B9E;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x4F46;&#x5904;&#x7406;&#x5668;&#x82B1;&#x8D39;&#x4E86;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x8BF7;&#x6C42;&#x5C06;&#x88AB;&#x591A;&#x6B21;&#x4F20;&#x9012;&#x3002; &#x6211;&#x4EEC;&#x4F1A;&#x7F16;&#x5199;&#x6211;&#x4EEC;&#x7684;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5E76;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898; - &#x91CD;&#x590D;&#x7684;&#x6D88;&#x606F;&#x5E94;&#x8BE5;&#x662F;&#x65E0;&#x5BB3;&#x7684;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4E0D;&#x4F1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x7EA7;&#x7684;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x3002; &#x4F46;&#x6CA1;&#x5173;&#x7CFB; - &#x5728;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#xFF0C;&#x4E4C;&#x9E26;&#x6CA1;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x9884;&#x671F;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B8C;&#x5168;&#x9694;&#x79BB;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x56DE;&#x8C03;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#xFF0C;&#x5E76;&#x4E3A;<code>defineRequestType</code>&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5305;&#x88C5;&#x5668;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5904;&#x7406;&#x5668;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>Promise</code>&#x6216;&#x660E;&#x786E;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x8FDE;&#x63A5;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x56DE;&#x8C03;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">requestType</span>(<span class="hljs-params">name, handler</span>) </span>{
  defineRequestType(name, (nest, content, source,
                           callback) =&gt; {
    <span class="hljs-keyword">try</span> {
      <span class="hljs-built_in">Promise</span>.resolve(handler(nest, content, source))
        .then(response =&gt; callback(<span class="hljs-literal">null</span>, response),
              failure =&gt; callback(failure));
    } <span class="hljs-keyword">catch</span> (exception) {
      callback(exception);
    }
  });
}
</code></pre>
<p>&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x8FD8;&#x4E0D;&#x662F;<code>Promise</code>&#xFF0C;<code>Promise.resolve</code>&#x7528;&#x4E8E;&#x5C06;&#x8F6C;&#x6362;&#x4E3A;<code>Promise</code>&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x7684;&#x8C03;&#x7528;&#x5FC5;&#x987B;&#x5305;&#x88C5;&#x5728;<code>try</code>&#x5757;&#x4E2D;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x76F4;&#x63A5;&#x5F15;&#x53D1;&#x7684;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x90FD;&#x4F1A;&#x88AB;&#x63D0;&#x4F9B;&#x7ED9;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002; &#x8FD9;&#x5F88;&#x597D;&#x5730;&#x8BF4;&#x660E;&#x4E86;&#x4F7F;&#x7528;&#x539F;&#x59CB;&#x56DE;&#x8C03;&#x6B63;&#x786E;&#x5904;&#x7406;&#x9519;&#x8BEF;&#x7684;&#x96BE;&#x5EA6; - &#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8BB0;&#x6B63;&#x786E;&#x5904;&#x7406;&#x7C7B;&#x4F3C;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x6545;&#x969C;&#x5C06;&#x65E0;&#x6CD5;&#x62A5;&#x544A;&#x7ED9;&#x6B63;&#x786E;&#x7684;&#x56DE;&#x8C03;&#x3002;<code>Promise</code>&#x4F7F;&#x5176;&#x5927;&#x90E8;&#x5206;&#x662F;&#x81EA;&#x52A8;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x6613;&#x51FA;&#x9519;&#x3002;</p>
<h2 id="promise&#x7684;&#x96C6;&#x5408;"><code>Promise</code>&#x7684;&#x96C6;&#x5408;</h2>
<p>&#x6BCF;&#x53F0;&#x9E1F;&#x5DE2;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x5176;<code>neighbors</code>&#x5C5E;&#x6027;&#x4E2D;&#xFF0C;&#x90FD;&#x4FDD;&#x5B58;&#x4E86;&#x4F20;&#x8F93;&#x8DDD;&#x79BB;&#x5185;&#x7684;&#x5176;&#x4ED6;&#x9E1F;&#x5DE2;&#x7684;&#x6570;&#x7EC4;&#x3002; &#x4E3A;&#x4E86;&#x68C0;&#x67E5;&#x5F53;&#x524D;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5C1D;&#x8BD5;&#x5411;&#x6BCF;&#x4E2A;&#x9E1F;&#x5DE2;&#x53D1;&#x9001;&#x4E00;&#x4E2A;<code>&quot;ping&quot;</code>&#x8BF7;&#x6C42;&#xFF08;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5730;&#x8BF7;&#x6C42;&#x54CD;&#x5E94;&#x7684;&#x8BF7;&#x6C42;&#xFF09;&#xFF0C;&#x5E76;&#x67E5;&#x770B;&#x54EA;&#x4E9B;&#x8FD4;&#x56DE;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x5904;&#x7406;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;<code>Promise</code>&#x96C6;&#x5408;&#x65F6;&#xFF0C;<code>Promise.all</code>&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x5F88;&#x6709;&#x7528;&#x3002; &#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>Promise</code>&#xFF0C;&#x7B49;&#x5F85;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6240;&#x6709;<code>Promise</code>&#x89E3;&#x6790;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x6790;&#x8FD9;&#x4E9B;<code>Promise</code>&#x4EA7;&#x751F;&#x7684;&#x503C;&#x7684;&#x6570;&#x7EC4;&#xFF08;&#x4E0E;&#x539F;&#x59CB;&#x6570;&#x7EC4;&#x7684;&#x987A;&#x5E8F;&#x76F8;&#x540C;&#xFF09;&#x3002; &#x5982;&#x679C;&#x4EFB;&#x4F55;<code>Promise</code>&#x88AB;&#x62D2;&#x7EDD;&#xFF0C;<code>Promise.all</code>&#x7684;&#x7ED3;&#x679C;&#x672C;&#x8EAB;&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<pre><code class="lang-js">requestType(<span class="hljs-string">&quot;ping&quot;</span>, () =&gt; <span class="hljs-string">&quot;pong&quot;</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">availableNeighbors</span>(<span class="hljs-params">nest</span>) </span>{
  <span class="hljs-keyword">let</span> requests = nest.neighbors.map(neighbor =&gt; {
    <span class="hljs-keyword">return</span> request(nest, neighbor, <span class="hljs-string">&quot;ping&quot;</span>)
      .then(() =&gt; <span class="hljs-literal">true</span>, () =&gt; <span class="hljs-literal">false</span>);
  });
  <span class="hljs-keyword">return</span> <span class="hljs-built_in">Promise</span>.all(requests).then(result =&gt; {
    <span class="hljs-keyword">return</span> nest.neighbors.filter((_, i) =&gt; result[i]);
  });
}
</code></pre>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x90BB;&#x5C45;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x6574;&#x4E2A;&#x7EC4;&#x5408;<code>Promise</code>&#x5931;&#x8D25;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x65F6;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x90BB;&#x5C45;&#x96C6;&#x5408;&#x4E0A;&#x6620;&#x5C04;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x53D8;&#x6210;&#x8BF7;&#x6C42;<code>Promise</code>&#xFF0C;&#x5E76;&#x9644;&#x52A0;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x5904;&#x7406;&#x5668;&#x4F7F;&#x6210;&#x529F;&#x7684;&#x8BF7;&#x6C42;&#x4EA7;&#x751F;<code>true</code>&#xFF0C;&#x62D2;&#x7EDD;&#x7684;&#x4EA7;&#x751F;<code>false</code>&#x3002;</p>
<p>&#x5728;&#x7EC4;&#x5408;<code>Promise</code>&#x7684;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C;<code>filter</code>&#x7528;&#x4E8E;&#x4ECE;<code>neighbors</code>&#x6570;&#x7EC4;&#x4E2D;&#x5220;&#x9664;&#x5BF9;&#x5E94;&#x503C;&#x4E3A;<code>false</code>&#x7684;&#x5143;&#x7D20;&#x3002; &#x8FD9;&#x5229;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;<code>filter</code>&#x5C06;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x4F5C;&#x4E3A;&#x5176;&#x8FC7;&#x6EE4;&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF08;<code>map</code>&#xFF0C;<code>some</code>&#x548C;&#x7C7B;&#x4F3C;&#x7684;&#x9AD8;&#x9636;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x4E5F;&#x4E00;&#x6837;&#xFF09;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x6CDB;&#x6D2A;">&#x7F51;&#x7EDC;&#x6CDB;&#x6D2A;</h2>
<p>&#x9E1F;&#x5DE2;&#x4EC5;&#x4EC5;&#x53EF;&#x4EE5;&#x90BB;&#x5C45;&#x901A;&#x4FE1;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x51CF;&#x5C11;&#x4E86;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5B9E;&#x7528;&#x6027;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5C06;&#x4FE1;&#x606F;&#x5E7F;&#x64AD;&#x5230;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x8BBE;&#x7F6E;&#x4E00;&#x79CD;&#x81EA;&#x52A8;&#x8F6C;&#x53D1;&#x7ED9;&#x90BB;&#x5C45;&#x7684;&#x8BF7;&#x6C42;&#x3002; &#x7136;&#x540E;&#x8FD9;&#x4E9B;&#x90BB;&#x5C45;&#x8F6C;&#x53D1;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x90BB;&#x5C45;&#xFF0C;&#x76F4;&#x5230;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> {everywhere} <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./crow-tech&quot;</span>;

everywhere(nest =&gt; {
  nest.state.gossip = [];
});

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">sendGossip</span>(<span class="hljs-params">nest, message, exceptFor = null</span>) </span>{
  nest.state.gossip.push(message);
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> neighbor <span class="hljs-keyword">of</span> nest.neighbors) {
    <span class="hljs-keyword">if</span> (neighbor == exceptFor) <span class="hljs-keyword">continue</span>;
    request(nest, neighbor, <span class="hljs-string">&quot;gossip&quot;</span>, message);
  }
}

requestType(<span class="hljs-string">&quot;gossip&quot;</span>, (nest, message, source) =&gt; {
  <span class="hljs-keyword">if</span> (nest.state.gossip.includes(message)) <span class="hljs-keyword">return</span>;
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">`<span class="hljs-subst">${nest.name}</span> received gossip &apos;<span class="hljs-subst">${
               message}</span>&apos; from <span class="hljs-subst">${source}</span>`</span>);
  sendGossip(nest, message, source);
});
</code></pre>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x6C38;&#x8FDC;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x6BCF;&#x4E2A;&#x9E1F;&#x5DE2;&#x90FD;&#x4FDD;&#x7559;&#x4E00;&#x7EC4;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x7684;&#x95F2;&#x8BDD;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x4E3A;&#x4E86;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>everywhere</code>&#x51FD;&#x6570;&#xFF08;&#x5B83;&#x5728;&#x6BCF;&#x4E2A;&#x9E1F;&#x5DE2;&#x4E0A;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#xFF09;&#x5411;&#x9E1F;&#x5DE2;&#x7684;&#x72B6;&#x6001;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x5C06;&#x4FDD;&#x5B58;&#x9E1F;&#x5DE2;&#x5C40;&#x90E8;&#x72B6;&#x6001;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x91CD;&#x590D;&#x7684;&#x95F2;&#x8BDD;&#x6D88;&#x606F;&#xFF0C;&#x5B83;&#x4F1A;&#x5FFD;&#x7565;&#x5B83;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x76F2;&#x76EE;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x8FD9;&#x5F88;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x3002; &#x4F46;&#x662F;&#x5F53;&#x5B83;&#x6536;&#x5230;&#x4E00;&#x6761;&#x65B0;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x5174;&#x594B;&#x5730;&#x544A;&#x8BC9;&#x5B83;&#x7684;&#x6240;&#x6709;&#x90BB;&#x5C45;&#xFF0C;&#x9664;&#x4E86;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x7684;&#x90A3;&#x4E2A;&#x90BB;&#x5C45;&#x3002;</p>
<p>&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x4E00;&#x6761;&#x65B0;&#x7684;&#x95F2;&#x8BDD;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x64AD;&#xFF0C;&#x5982;&#x5728;&#x6C34;&#x4E2D;&#x7684;&#x58A8;&#x6C34;&#x4E00;&#x6837;&#x3002; &#x5373;&#x4F7F;&#x4E00;&#x4E9B;&#x8FDE;&#x63A5;&#x76EE;&#x524D;&#x4E0D;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x6761;&#x901A;&#x5F80;&#x6307;&#x5B9A;&#x9E1F;&#x5DE2;&#x7684;&#x66FF;&#x4EE3;&#x8DEF;&#x7EBF;&#xFF0C;&#x95F2;&#x8BDD;&#x5C06;&#x901A;&#x8FC7;&#x90A3;&#x91CC;&#x5230;&#x8FBE;&#x5B83;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;&#x6CDB;&#x6D2A; - &#x5B83;&#x7528;&#x4E00;&#x6761;&#x4FE1;&#x606F;&#x5145;&#x6EE1;&#x7F51;&#x7EDC;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x62E5;&#x6709;&#x5B83;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>sendGossip</code>&#x770B;&#x770B;&#x6751;&#x5B50;&#x91CC;&#x7684;&#x6D88;&#x606F;&#x6D41;&#x3002;</p>
<pre><code class="lang-js">sendGossip(bigOak, <span class="hljs-string">&quot;Kids with airgun in the park&quot;</span>);
</code></pre>
<h2 id="&#x6D88;&#x606F;&#x8DEF;&#x7531;">&#x6D88;&#x606F;&#x8DEF;&#x7531;</h2>
<p>&#x5982;&#x679C;&#x7ED9;&#x5B9A;&#x8282;&#x70B9;&#x60F3;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x901A;&#x4FE1;&#xFF0C;&#x6CDB;&#x6D2A;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x7279;&#x522B;&#x662F;&#x5F53;&#x7F51;&#x7EDC;&#x5F88;&#x5927;&#x65F6;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x65E0;&#x7528;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E3A;&#x6D88;&#x606F;&#x8BBE;&#x7F6E;&#x8282;&#x70B9;&#x5230;&#x8282;&#x70B9;&#x7684;&#x4F20;&#x8F93;&#x65B9;&#x5F0F;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x4EEC;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002; &#x8FD9;&#x6837;&#x505A;&#x7684;&#x56F0;&#x96BE;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x5E03;&#x5C40;&#x7684;&#x77E5;&#x8BC6;&#x3002; &#x4E3A;&#x4E86;&#x5411;&#x8FDC;&#x65B9;&#x7684;&#x9E1F;&#x5DE2;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x90BB;&#x8FD1;&#x7684;&#x9E1F;&#x5DE2;&#x66F4;&#x9760;&#x8FD1;&#x5176;&#x76EE;&#x7684;&#x5730;&#x3002; &#x4EE5;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x9001;&#x5B83;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x597D;&#x5904;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x9E1F;&#x5DE2;&#x53EA;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x76F4;&#x63A5;&#x90BB;&#x5C45;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x6CA1;&#x6709;&#x8BA1;&#x7B97;&#x8DEF;&#x7EBF;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x9E1F;&#x5DE2;&#x3002; &#x5F53;&#x653E;&#x5F03;&#x6216;&#x5EFA;&#x9020;&#x65B0;&#x7684;&#x9E1F;&#x5DE2;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x5141;&#x8BB8;&#x5B83;&#x968F;&#x65F6;&#x95F4;&#x6539;&#x53D8;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x6CDB;&#x6D2A;&#xFF0C;&#x4F46;&#x4E0D;&#x68C0;&#x67E5;&#x7ED9;&#x5B9A;&#x7684;&#x6D88;&#x606F;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#xFF0C;&#x800C;&#x662F;&#x68C0;&#x67E5;&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x9E1F;&#x5DE2;&#x6765;&#x8BF4;&#xFF0C;&#x90BB;&#x5C45;&#x7684;&#x65B0;&#x96C6;&#x5408;&#xFF0C;&#x662F;&#x5426;&#x5339;&#x914D;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x7684;&#x5F53;&#x524D;&#x96C6;&#x5408;&#x3002;</p>
<pre><code class="lang-js">requestType(<span class="hljs-string">&quot;connections&quot;</span>, (nest, {name, neighbors},
                            source) =&gt; {
  <span class="hljs-keyword">let</span> connections = nest.state.connections;
  <span class="hljs-keyword">if</span> (<span class="hljs-built_in">JSON</span>.stringify(connections.get(name)) ==
      <span class="hljs-built_in">JSON</span>.stringify(neighbors)) <span class="hljs-keyword">return</span>;
  connections.set(name, neighbors);
  broadcastConnections(nest, name, source);
});

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">broadcastConnections</span>(<span class="hljs-params">nest, name, exceptFor = null</span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> neighbor <span class="hljs-keyword">of</span> nest.neighbors) {
    <span class="hljs-keyword">if</span> (neighbor == exceptFor) <span class="hljs-keyword">continue</span>;
    request(nest, neighbor, <span class="hljs-string">&quot;connections&quot;</span>, {
      name,
      neighbors: nest.state.connections.get(name)
    });
  }
}

everywhere(nest =&gt; {
  nest.state.connections = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>;
  nest.state.connections.set(nest.name, nest.neighbors);
  broadcastConnections(nest, nest.name);
});
</code></pre>
<p>&#x8BE5;&#x6BD4;&#x8F83;&#x4F7F;&#x7528;<code>JSON.stringify</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x8C61;&#x6216;&#x6570;&#x7EC4;&#x4E0A;&#x7684;<code>==</code>&#x53EA;&#x6709;&#x5728;&#x4E24;&#x8005;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x65F6;&#x624D;&#x8FD4;&#x56DE;<code>true</code>&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6240;&#x9700;&#x7684;&#x3002; &#x6BD4;&#x8F83; JSON &#x5B57;&#x7B26;&#x4E32;&#x662F;&#x6BD4;&#x8F83;&#x5176;&#x5185;&#x5BB9;&#x7684;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x800C;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x8282;&#x70B9;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x5E7F;&#x64AD;&#x5B83;&#x4EEC;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x5B83;&#x4EEC;&#x5E94;&#x8BE5;&#x7ACB;&#x5373;&#x4E3A;&#x6BCF;&#x4E2A;&#x9E1F;&#x5DE2;&#x63D0;&#x4F9B;&#x5F53;&#x524D;&#x7F51;&#x7EDC;&#x56FE;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x9664;&#x975E;&#x6709;&#x4E00;&#x4E9B;&#x9E1F;&#x5DE2;&#x5B8C;&#x5168;&#x65E0;&#x6CD5;&#x5230;&#x8FBE;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x56FE;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x627E;&#x5230;&#x91CC;&#x9762;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x6761;&#x901A;&#x5F80;&#x6D88;&#x606F;&#x76EE;&#x7684;&#x5730;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5C06;&#x5B83;&#x53D1;&#x9001;&#x5230;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;<code>findRoute</code>&#x51FD;&#x6570;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x7684;<code>findRoute</code>&#xFF0C;&#x5B83;&#x641C;&#x7D22;&#x5230;&#x8FBE;&#x7F51;&#x7EDC;&#x4E2D;&#x7ED9;&#x5B9A;&#x8282;&#x70B9;&#x7684;&#x8DEF;&#x7EBF;&#x3002; &#x4F46;&#x4E0D;&#x662F;&#x8FD4;&#x56DE;&#x6574;&#x4E2A;&#x8DEF;&#x7EBF;&#xFF0C;&#x800C;&#x662F;&#x8FD4;&#x56DE;&#x4E0B;&#x4E00;&#x6B65;&#x3002; &#x4E0B;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x5C06;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x6709;&#x5173;&#x7F51;&#x7EDC;&#x7684;&#x5F53;&#x524D;&#x4FE1;&#x606F;&#xFF0C;&#x6765;&#x51B3;&#x5B9A;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x54EA;&#x91CC;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">findRoute</span>(<span class="hljs-params">from, to, connections</span>) </span>{
  <span class="hljs-keyword">let</span> work = [{at: <span class="hljs-keyword">from</span>, via: <span class="hljs-literal">null</span>}];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; work.length; i++) {
    <span class="hljs-keyword">let</span> {at, via} = work[i];
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> next <span class="hljs-keyword">of</span> connections.get(at) || []) {
      <span class="hljs-keyword">if</span> (next == to) <span class="hljs-keyword">return</span> via;
      <span class="hljs-keyword">if</span> (!work.some(w =&gt; w.at == next)) {
        work.push({at: next, via: via || next});
      }
    }
  }
  <span class="hljs-keyword">return</span> <span class="hljs-literal">null</span>;
}
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x957F;&#x9014;&#x4FE1;&#x606F;&#x7684;&#x51FD;&#x6570;&#x3002; &#x5982;&#x679C;&#x8BE5;&#x6D88;&#x606F;&#x88AB;&#x53D1;&#x9001;&#x7ED9;&#x76F4;&#x63A5;&#x90BB;&#x5C45;&#xFF0C;&#x5B83;&#x5C06;&#x7167;&#x5E38;&#x53D1;&#x9001;&#x3002; &#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5219;&#x5C06;&#x5176;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;<code>&quot;route&quot;</code>&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#xFF0C;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x5230;&#x66F4;&#x63A5;&#x8FD1;&#x76EE;&#x6807;&#x7684;&#x90BB;&#x5C45;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x8BE5;&#x90BB;&#x5C45;&#x91CD;&#x590D;&#x76F8;&#x540C;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">routeRequest</span>(<span class="hljs-params">nest, target, type, content</span>) </span>{
  <span class="hljs-keyword">if</span> (nest.neighbors.includes(target)) {
    <span class="hljs-keyword">return</span> request(nest, target, type, content);
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">let</span> via = findRoute(nest.name, target,
                        nest.state.connections);
    <span class="hljs-keyword">if</span> (!via) <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">`No route to <span class="hljs-subst">${target}</span>`</span>);
    <span class="hljs-keyword">return</span> request(nest, via, <span class="hljs-string">&quot;route&quot;</span>,
                   {target, type, content});
  }
}

requestType(<span class="hljs-string">&quot;route&quot;</span>, (nest, {target, type, content}) =&gt; {
  <span class="hljs-keyword">return</span> routeRequest(nest, target, type, content);
});
</code></pre>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x6559;&#x5802;&#x5854;&#x697C;&#x7684;&#x9E1F;&#x5DE2;&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x8DDD;&#x79BB;&#x6709;&#x56DB;&#x8DF3;&#x3002;</p>
<pre><code class="lang-js">routeRequest(bigOak, <span class="hljs-string">&quot;Church Tower&quot;</span>, <span class="hljs-string">&quot;note&quot;</span>,
             <span class="hljs-string">&quot;Incoming jackdaws!&quot;</span>);
</code></pre>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x539F;&#x59CB;&#x901A;&#x4FE1;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6784;&#x5EFA;&#x4E86;&#x51E0;&#x5C42;&#x529F;&#x80FD;&#xFF0C;&#x6765;&#x4F7F;&#x5176;&#x4FBF;&#x4E8E;&#x4F7F;&#x7528;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#xFF08;&#x5C3D;&#x7BA1;&#x662F;&#x7B80;&#x5316;&#x7684;&#xFF09;&#x771F;&#x5B9E;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x7684;&#x5F88;&#x597D;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E2A;&#x663E;&#x7740;&#x7279;&#x70B9;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x53EF;&#x9760; - &#x5EFA;&#x7ACB;&#x5728;&#x5B83;&#x4EEC;&#x4E4B;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x62BD;&#x8C61;&#x51FA;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x3002;&#x6240;&#x4EE5;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x901A;&#x5E38;&#x5173;&#x4E8E;&#x9884;&#x6D4B;&#x548C;&#x5904;&#x7406;&#x6545;&#x969C;&#x3002;</p>
<h2 id="async&#x51FD;&#x6570;"><code>async</code>&#x51FD;&#x6570;</h2>
<p>&#x4E3A;&#x4E86;&#x5B58;&#x50A8;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF0C;&#x636E;&#x4E86;&#x89E3;&#x4E4C;&#x9E26;&#x5728;&#x9E1F;&#x5DE2;&#x4E2D;&#x590D;&#x5236;&#x5B83;&#x3002; &#x8FD9;&#x6837;&#xFF0C;&#x5F53;&#x4E00;&#x53EA;&#x9E70;&#x6467;&#x6BC1;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x65F6;&#xFF0C;&#x4FE1;&#x606F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x68C0;&#x7D22;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x9E1F;&#x5DE2;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x80FD;&#x4F1A;&#x8BE2;&#x95EE;&#x7F51;&#x7EDC;&#x4E2D;&#x5176;&#x4ED6;&#x968F;&#x673A;&#x9E1F;&#x5DE2;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<pre><code class="lang-js">requestType(<span class="hljs-string">&quot;storage&quot;</span>, (nest, name) =&gt; storage(nest, name));

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">findInStorage</span>(<span class="hljs-params">nest, name</span>) </span>{
  <span class="hljs-keyword">return</span> storage(nest, name).then(found =&gt; {
    <span class="hljs-keyword">if</span> (found != <span class="hljs-literal">null</span>) <span class="hljs-keyword">return</span> found;
    <span class="hljs-keyword">else</span> <span class="hljs-keyword">return</span> findInRemoteStorage(nest, name);
  });
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">network</span>(<span class="hljs-params">nest</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-built_in">Array</span>.from(nest.state.connections.keys());
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">findInRemoteStorage</span>(<span class="hljs-params">nest, name</span>) </span>{
  <span class="hljs-keyword">let</span> sources = network(nest).filter(n =&gt; n != nest.name);
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">next</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">if</span> (sources.length == <span class="hljs-number">0</span>) {
      <span class="hljs-keyword">return</span> <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Not found&quot;</span>));
    } <span class="hljs-keyword">else</span> {
      <span class="hljs-keyword">let</span> source = sources[<span class="hljs-built_in">Math</span>.floor(<span class="hljs-built_in">Math</span>.random() *
                                      sources.length)];
      sources = sources.filter(n =&gt; n != source);
      <span class="hljs-keyword">return</span> routeRequest(nest, source, <span class="hljs-string">&quot;storage&quot;</span>, name)
        .then(value =&gt; value != <span class="hljs-literal">null</span> ? value : next(),
              next);
    }
  }
  <span class="hljs-keyword">return</span> next();
}
</code></pre>
<p>&#x56E0;&#x4E3A;<code>connections</code>&#x662F;&#x4E00;&#x4E2A;<code>Map</code>&#xFF0C;<code>Object.keys</code>&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002; &#x5B83;&#x6709;&#x4E00;&#x4E2A;<code>key</code>&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5668;&#x800C;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x3002; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Array.from</code>&#x51FD;&#x6570;&#x5C06;&#x8FED;&#x4EE3;&#x5668;&#xFF08;&#x6216;&#x53EF;&#x8FED;&#x4EE3;&#x5BF9;&#x8C61;&#xFF09;&#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x4F7F;&#x7528;<code>Promise</code>&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E9B;&#x76F8;&#x5F53;&#x7B28;&#x62D9;&#x7684;&#x4EE3;&#x7801;&#x3002; &#x591A;&#x4E2A;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x4EE5;&#x4E0D;&#x6E05;&#x6670;&#x7684;&#x65B9;&#x5F0F;&#x94FE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x3002; &#x6211;&#x4EEC;&#x518D;&#x6B21;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x51FD;&#x6570;&#xFF08;<code>next</code>&#xFF09;&#x6765;&#x5EFA;&#x6A21;&#x9E1F;&#x5DE2;&#x4E0A;&#x7684;&#x904D;&#x5386;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x5B9E;&#x9645;&#x4E0A;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x5B8C;&#x5168;&#x7EBF;&#x6027;&#x7684; - &#x5728;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x603B;&#x662F;&#x7B49;&#x5F85;&#x5148;&#x524D;&#x7684;&#x52A8;&#x4F5C;&#x5B8C;&#x6210;&#x3002; &#x5728;&#x540C;&#x6B65;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x8868;&#x8FBE;&#x4F1A;&#x66F4;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x597D;&#x6D88;&#x606F;&#x662F; JavaScript &#x5141;&#x8BB8;&#x4F60;&#x7F16;&#x5199;&#x4F2A;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x3002; &#x5F02;&#x6B65;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x9690;&#x5F0F;&#x8FD4;&#x56DE;<code>Promise</code>&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E3B;&#x4F53;&#x4E2D;&#xFF0C;&#x4EE5;&#x770B;&#x8D77;&#x6765;&#x540C;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x7B49;&#x5F85;&#x5176;&#x4ED6;<code>Promise</code>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x91CD;&#x5199;<code>findInStorage</code>&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">findInStorage</span>(<span class="hljs-params">nest, name</span>) </span>{
  <span class="hljs-keyword">let</span> local = <span class="hljs-keyword">await</span> storage(nest, name);
  <span class="hljs-keyword">if</span> (local != <span class="hljs-literal">null</span>) <span class="hljs-keyword">return</span> local;

  <span class="hljs-keyword">let</span> sources = network(nest).filter(n =&gt; n != nest.name);
  <span class="hljs-keyword">while</span> (sources.length &gt; <span class="hljs-number">0</span>) {
    <span class="hljs-keyword">let</span> source = sources[<span class="hljs-built_in">Math</span>.floor(<span class="hljs-built_in">Math</span>.random() *
                                    sources.length)];
    sources = sources.filter(n =&gt; n != source);
    <span class="hljs-keyword">try</span> {
      <span class="hljs-keyword">let</span> found = <span class="hljs-keyword">await</span> routeRequest(nest, source, <span class="hljs-string">&quot;storage&quot;</span>,
                                     name);
      <span class="hljs-keyword">if</span> (found != <span class="hljs-literal">null</span>) <span class="hljs-keyword">return</span> found;
    } <span class="hljs-keyword">catch</span> (_) {}
  }
  <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Not found&quot;</span>);
}
</code></pre>
<p>&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x7531;<code>function</code>&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x524D;&#x7684;<code>async</code>&#x6807;&#x8BB0;&#x3002; &#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x540D;&#x79F0;&#x524D;&#x9762;&#x7F16;&#x5199;<code>async</code>&#x6765;&#x505A;&#x6210;&#x5F02;&#x6B65;&#x7684;&#x3002; &#x5F53;&#x8C03;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>Promise</code>&#x3002; &#x53EA;&#x8981;&#x4E3B;&#x4F53;&#x8FD4;&#x56DE;&#x4E86;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;<code>Promise</code>&#x5C31;&#x89E3;&#x6790;&#x4E86;&#x3002; &#x5982;&#x679C;&#x5B83;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x5219;<code>Promise</code>&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<pre><code class="lang-js">findInStorage(bigOak, <span class="hljs-string">&quot;events on 2017-12-21&quot;</span>)
  .then(<span class="hljs-built_in">console</span>.log);
</code></pre>
<p>&#x5728;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;<code>await</code>&#x8FD9;&#x4E2A;&#x8BCD;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x524D;&#x9762;&#xFF0C;&#x7B49;&#x5F85;&#x89E3;<code>Promise</code>&#x88AB;&#x89E3;&#x6790;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x4E0D;&#x518D;&#x50CF;&#x5E38;&#x89C4;&#x7684; JavaScript &#x51FD;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x8FD0;&#x884C;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x6709;&#x4EFB;&#x4F55;&#x5E26;&#x6709;<code>await</code>&#x7684;&#x5730;&#x65B9;&#x51BB;&#x7ED3;&#xFF0C;&#x5E76;&#x5728;&#x7A0D;&#x540E;&#x6062;&#x590D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x79CD;&#x6807;&#x8BB0;&#x901A;&#x5E38;&#x6BD4;&#x76F4;&#x63A5;&#x4F7F;&#x7528;<code>Promise</code>&#x66F4;&#x65B9;&#x4FBF;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x4E0D;&#x9002;&#x5408;&#x540C;&#x6B65;&#x6A21;&#x578B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x52A8;&#x4F5C;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x5C06;<code>await</code>&#x548C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;<code>Promise</code>&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;</p>
<h2 id="&#x751F;&#x6210;&#x5668;">&#x751F;&#x6210;&#x5668;</h2>
<p>&#x51FD;&#x6570;&#x6682;&#x505C;&#x7136;&#x540E;&#x518D;&#x6B21;&#x6062;&#x590D;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x662F;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x6240;&#x72EC;&#x6709;&#x7684;&#x3002; JavaScript &#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x751F;&#x6210;&#x5668;&#x51FD;&#x6570;&#x7684;&#x7279;&#x6027;&#x3002; &#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;<code>Promise</code>&#x3002;</p>
<p>&#x5F53;&#x7528;<code>function*</code>&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF08;&#x5728;&#x51FD;&#x6570;&#x540E;&#x9762;&#x52A0;&#x661F;&#x53F7;&#xFF09;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x5668;&#x3002; &#x5F53;&#x4F60;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x5668;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 6 &#x7AE0;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x5B83;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">powers</span>(<span class="hljs-params">n</span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> current = n;; current *= n) {
    <span class="hljs-keyword">yield</span> current;
  }
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> power <span class="hljs-keyword">of</span> powers(<span class="hljs-number">3</span>)) {
  <span class="hljs-keyword">if</span> (power &gt; <span class="hljs-number">50</span>) <span class="hljs-keyword">break</span>;
  <span class="hljs-built_in">console</span>.log(power);
}
<span class="hljs-comment">// &#x2192; 3</span>
<span class="hljs-comment">// &#x2192; 9</span>
<span class="hljs-comment">// &#x2192; 27</span>
</code></pre>
<p>&#x6700;&#x521D;&#xFF0C;&#x5F53;&#x4F60;&#x8C03;&#x7528;<code>powers</code>&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x5728;&#x5F00;&#x5934;&#x88AB;&#x51BB;&#x7ED3;&#x3002; &#x6BCF;&#x6B21;&#x5728;&#x8FED;&#x4EE3;&#x5668;&#x4E0A;&#x8C03;&#x7528;<code>next</code>&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x90FD;&#x4F1A;&#x8FD0;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x78B0;&#x5230;<code>yield</code>&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x4F1A;&#x6682;&#x505C;&#x5B83;&#xFF0C;&#x5E76;&#x4F7F;&#x5F97;&#x4EA7;&#x751F;&#x7684;&#x503C;&#x6210;&#x4E3A;&#x7531;&#x8FED;&#x4EE3;&#x5668;&#x4EA7;&#x751F;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x5F53;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#xFF08;&#x793A;&#x4F8B;&#x4E2D;&#x7684;&#x90A3;&#x4E2A;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#xFF09;&#xFF0C;&#x8FED;&#x4EE3;&#x5668;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x751F;&#x6210;&#x5668;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x7F16;&#x5199;&#x8FED;&#x4EE3;&#x5668;&#x901A;&#x5E38;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002; &#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E2A;&#x751F;&#x6210;&#x5668;&#x7F16;&#x5199;<code>group</code>&#x7C7B;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#xFF08;&#x6765;&#x81EA;&#x7B2C; 6 &#x7AE0;&#x7684;&#x7EC3;&#x4E60;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-js">Group.prototype[<span class="hljs-built_in">Symbol</span>.iterator] = <span class="hljs-function"><span class="hljs-keyword">function</span>*(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-keyword">this</span>.members.length; i++) {
    <span class="hljs-keyword">yield</span> <span class="hljs-keyword">this</span>.members[i];
  }
};
</code></pre>
<p>&#x4E0D;&#x518D;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6765;&#x4FDD;&#x5B58;&#x8FED;&#x4EE3;&#x72B6;&#x6001; - &#x751F;&#x6210;&#x5668;&#x6BCF;&#x6B21;<code>yield</code>&#x65F6;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x5176;&#x672C;&#x5730;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;<code>yield</code>&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x76F4;&#x63A5;&#x51FA;&#x73B0;&#x5728;&#x751F;&#x6210;&#x5668;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4F60;&#x5B9A;&#x4E49;&#x7684;&#x5185;&#x90E8;&#x51FD;&#x6570;&#x4E2D;&#x3002; &#x751F;&#x6210;&#x5668;&#x5728;&#x8FD4;&#x56DE;&#xFF08;<code>yield</code>&#xFF09;&#x65F6;&#x4FDD;&#x5B58;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x662F;&#x5B83;&#x7684;&#x672C;&#x5730;&#x73AF;&#x5883;&#x548C;&#x5B83;<code>yield</code>&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x751F;&#x6210;&#x5668;&#x3002; &#x5B83;&#x5728;&#x8C03;&#x7528;&#x65F6;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;<code>Promise</code>&#xFF0C;&#x5F53;&#x5B83;&#x8FD4;&#x56DE;&#xFF08;&#x5B8C;&#x6210;&#xFF09;&#x65F6;&#x88AB;&#x89E3;&#x6790;&#xFF0C;&#x5E76;&#x5728;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x65F6;&#x88AB;&#x62D2;&#x7EDD;&#x3002; &#x6BCF;&#x5F53;&#x5B83;<code>yield</code>&#xFF08;<code>await</code>&#xFF09;&#x4E00;&#x4E2A;<code>Promise</code>&#x65F6;&#xFF0C;&#x8BE5;<code>Promise</code>&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x503C;&#x6216;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#xFF09;&#x5C31;&#x662F;<code>await</code>&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;">&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</h2>
<p>&#x5F02;&#x6B65;&#x7A0B;&#x5E8F;&#x662F;&#x9010;&#x7247;&#x6BB5;&#x6267;&#x884C;&#x7684;&#x3002; &#x6BCF;&#x4E2A;&#x7247;&#x6BB5;&#x53EF;&#x80FD;&#x4F1A;&#x542F;&#x52A8;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x8C03;&#x5EA6;&#x4EE3;&#x7801;&#x5728;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x6216;&#x5931;&#x8D25;&#x65F6;&#x6267;&#x884C;&#x3002; &#x5728;&#x8FD9;&#x4E9B;&#x7247;&#x6BB5;&#x4E4B;&#x95F4;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x5904;&#x4E8E;&#x7A7A;&#x95F2;&#x72B6;&#x6001;&#xFF0C;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x88AB;&#x8C03;&#x5EA6;&#x5B83;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x8C03;&#x7528;&#x3002; &#x5982;&#x679C;&#x6211;&#x4ECE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x8C03;&#x7528;<code>setTimeout</code>&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x65F6;&#x8BE5;&#x51FD;&#x6570;&#x5DF2;&#x7ECF;&#x8FD4;&#x56DE;&#x3002; &#x5F53;&#x56DE;&#x8C03;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x63A7;&#x5236;&#x6743;&#x4E0D;&#x4F1A;&#x56DE;&#x5230;&#x8C03;&#x5EA6;&#x5B83;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x884C;&#x4E3A;&#x53D1;&#x751F;&#x5728;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x7A7A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5806;&#x6808;&#x4E0A;&#x3002; &#x8FD9;&#x662F;&#x6CA1;&#x6709;<code>Promise</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x7BA1;&#x7406;&#x5F02;&#x5E38;&#x5F88;&#x96BE;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002; &#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x4EE5;&#x51E0;&#x4E4E;&#x4E3A;&#x7A7A;&#x7684;&#x5806;&#x6808;&#x5F00;&#x59CB;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x5B83;&#x4EEC;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x4F60;&#x7684;<code>catch</code>&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x5728;&#x5806;&#x6808;&#x4E2D;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">try</span> {
  setTimeout(() =&gt; {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Woosh&quot;</span>);
  }, <span class="hljs-number">20</span>);
} <span class="hljs-keyword">catch</span> (_) {
  <span class="hljs-comment">// This will not run</span>
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Caught!&quot;</span>);
}
</code></pre>
<p>&#x65E0;&#x8BBA;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x591A;&#x4E48;&#x7D27;&#x5BC6;&#xFF08;&#x4F8B;&#x5982;&#x8D85;&#x65F6;&#x6216;&#x4F20;&#x5165;&#x8BF7;&#x6C42;&#xFF09;&#xFF0C;JavaScript &#x73AF;&#x5883;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x770B;&#x4F5C;&#x5728;&#x7A0B;&#x5E8F;&#x5468;&#x56F4;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x5927;&#x5FAA;&#x73AF;&#xFF0C;&#x79F0;&#x4E3A;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002; &#x5F53;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E2A;&#x5FAA;&#x73AF;&#x5C31;&#x4F1A;&#x505C;&#x6B62;&#x3002; &#x4F46;&#x968F;&#x7740;&#x4E8B;&#x4EF6;&#x6765;&#x4E34;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x88AB;&#x9010;&#x4E2A;&#x6267;&#x884C;&#x3002; &#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x4E24;&#x4EF6;&#x4E8B;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF0C;&#x8FD0;&#x884C;&#x7F13;&#x6162;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x5EF6;&#x8FDF;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x8D85;&#x65F6;&#xFF0C;&#x4F46;&#x662F;&#x4E4B;&#x540E;&#x5360;&#x7528;&#x65F6;&#x95F4;&#xFF0C;&#x76F4;&#x5230;&#x8D85;&#x65F6;&#x7684;&#x9884;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x5BFC;&#x81F4;&#x8D85;&#x65F6;&#x5EF6;&#x8FDF;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> start = <span class="hljs-built_in">Date</span>.now();
setTimeout(() =&gt; {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Timeout ran at&quot;</span>, <span class="hljs-built_in">Date</span>.now() - start);
}, <span class="hljs-number">20</span>);
<span class="hljs-keyword">while</span> (<span class="hljs-built_in">Date</span>.now() &lt; start + <span class="hljs-number">50</span>) {}
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Wasted time until&quot;</span>, <span class="hljs-built_in">Date</span>.now() - start);
<span class="hljs-comment">// &#x2192; Wasted time until 50</span>
<span class="hljs-comment">// &#x2192; Timeout ran at 55</span>
</code></pre>
<p><code>Promise</code>&#x603B;&#x662F;&#x4F5C;&#x4E3A;&#x65B0;&#x4E8B;&#x4EF6;&#x6765;&#x89E3;&#x6790;&#x6216;&#x62D2;&#x7EDD;&#x3002; &#x5373;&#x4F7F;&#x5DF2;&#x7ECF;&#x89E3;&#x6790;&#x4E86;<code>Promise</code>&#xFF0C;&#x7B49;&#x5F85;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x5728;&#x5F53;&#x524D;&#x811A;&#x672C;&#x5B8C;&#x6210;&#x540E;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">Promise</span>.resolve(<span class="hljs-string">&quot;Done&quot;</span>).then(<span class="hljs-built_in">console</span>.log);
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Me first!&quot;</span>);
<span class="hljs-comment">// &#x2192; Me first!</span>
<span class="hljs-comment">// &#x2192; Done</span>
</code></pre>
<p>&#x5728;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x5728;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5404;&#x79CD;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x4E8B;&#x4EF6;&#x3002;</p>
<h2 id="&#x5F02;&#x6B65;&#x7684;-bug">&#x5F02;&#x6B65;&#x7684; bug</h2>
<p>&#x5F53;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x540C;&#x6B65;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x9664;&#x4E86;&#x90A3;&#x4E9B;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x6240;&#x505A;&#x7684;&#x5916;&#xFF0C;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x4EFB;&#x4F55;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x3002; &#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x540C;&#x7684; - &#x5B83;&#x4EEC;&#x5728;&#x6267;&#x884C;&#x671F;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x7A7A;&#x767D;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002; &#x6211;&#x4EEC;&#x4E4C;&#x9E26;&#x7684;&#x7231;&#x597D;&#x4E4B;&#x4E00;&#x662F;&#x8BA1;&#x7B97;&#x6574;&#x4E2A;&#x6751;&#x5E84;&#x6BCF;&#x5E74;&#x5B75;&#x5316;&#x7684;&#x96CF;&#x9E21;&#x6570;&#x91CF;&#x3002; &#x9E1F;&#x5DE2;&#x5C06;&#x8FD9;&#x4E00;&#x6570;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002; &#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C1D;&#x8BD5;&#x679A;&#x4E3E;&#x7ED9;&#x5B9A;&#x5E74;&#x4EFD;&#x7684;&#x6240;&#x6709;&#x9E1F;&#x5DE2;&#x7684;&#x8BA1;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">anyStorage</span>(<span class="hljs-params">nest, source, name</span>) </span>{
  <span class="hljs-keyword">if</span> (source == nest.name) <span class="hljs-keyword">return</span> storage(nest, name);
  <span class="hljs-keyword">else</span> <span class="hljs-keyword">return</span> routeRequest(nest, source, <span class="hljs-string">&quot;storage&quot;</span>, name);
}

<span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">chicks</span>(<span class="hljs-params">nest, year</span>) </span>{
  <span class="hljs-keyword">let</span> list = <span class="hljs-string">&quot;&quot;</span>;
  <span class="hljs-keyword">await</span> <span class="hljs-built_in">Promise</span>.all(network(nest).map(<span class="hljs-keyword">async</span> name =&gt; {
    list += <span class="hljs-string">`<span class="hljs-subst">${name}</span>: <span class="hljs-subst">${
      await anyStorage(nest, name, `chicks in ${year}</span>`</span>)
    }\n<span class="hljs-string">`;
  }));
  return list;
}
</span></code></pre>
<p><code>async name =&gt;</code>&#x90E8;&#x5206;&#x5C55;&#x793A;&#x4E86;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x5355;&#x8BCD;<code>async</code>&#x653E;&#x5728;&#x5B83;&#x4EEC;&#x524D;&#x9762;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7BAD;&#x5934;&#x51FD;&#x6570;&#x53D8;&#x6210;&#x5F02;&#x6B65;&#x7684;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x770B;&#x4E0A;&#x53BB;&#x6709;&#x95EE;&#x9898;......&#x5B83;&#x5C06;&#x5F02;&#x6B65;&#x7BAD;&#x5934;&#x51FD;&#x6570;&#x6620;&#x5C04;&#x5230;&#x9E1F;&#x5DE2;&#x96C6;&#x5408;&#x4E0A;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x7EC4;<code>Promise</code>&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;<code>Promise.all</code>&#xFF0C;&#x5728;&#x8FD4;&#x56DE;&#x5B83;&#x4EEC;&#x6784;&#x5EFA;&#x7684;&#x5217;&#x8868;&#x4E4B;&#x524D;&#x7B49;&#x5F85;&#x6240;&#x6709;<code>Promise</code>&#x3002;</p>
<p>&#x4F46;&#x5B83;&#x6709;&#x4E25;&#x91CD;&#x95EE;&#x9898;&#x3002; &#x5B83;&#x603B;&#x662F;&#x53EA;&#x8FD4;&#x56DE;&#x4E00;&#x884C;&#x8F93;&#x51FA;&#xFF0C;&#x5217;&#x51FA;&#x54CD;&#x5E94;&#x6700;&#x6162;&#x7684;&#x9E1F;&#x5DE2;&#x3002;</p>
<pre><code class="lang-js">chicks(bigOak, <span class="hljs-number">2017</span>).then(<span class="hljs-built_in">console</span>.log);
</code></pre>
<p>&#x4F60;&#x80FD;&#x89E3;&#x91CA;&#x4E3A;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;</p>
<p>&#x95EE;&#x9898;&#x5728;&#x4E8E;<code>+=</code>&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x5B83;&#x5728;&#x8BED;&#x53E5;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x65F6;&#x63A5;&#x53D7;<code>list</code>&#x7684;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5F53;<code>await</code>&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x5C06;<code>list</code>&#x7ED1;&#x5B9A;&#x8BBE;&#x4E3A;&#x8BE5;&#x503C;&#x52A0;&#x4E0A;&#x65B0;&#x589E;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x8BED;&#x53E5;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x5B83;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x95F4;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x95F4;&#x9694;&#x3002; <code>map</code>&#x8868;&#x8FBE;&#x5F0F;&#x5728;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x6DFB;&#x52A0;&#x5230;&#x5217;&#x8868;&#x4E4B;&#x524D;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;<code>+ =</code>&#x64CD;&#x4F5C;&#x7B26;&#x90FD;&#x4EE5;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x5728;&#x5B58;&#x50A8;&#x68C0;&#x7D22;&#x5B8C;&#x6210;&#x65F6;&#x7ED3;&#x675F;&#xFF0C;&#x5C06;<code>list</code>&#x8BBE;&#x7F6E;&#x4E3A;&#x5355;&#x884C;&#x5217;&#x8868; - &#x5411;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x6DFB;&#x52A0;&#x90A3;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4ECE;&#x6620;&#x5C04;&#x7684;<code>Promise</code>&#x4E2D;&#x8FD4;&#x56DE;&#x884C;&#xFF0C;&#x5E76;&#x5BF9;<code>Promise.all</code>&#x7684;&#x7ED3;&#x679C;&#x8C03;&#x7528;<code>join</code>&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x66F4;&#x6539;&#x7ED1;&#x5B9A;&#x6765;&#x6784;&#x5EFA;&#x5217;&#x8868;&#x3002; &#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x8BA1;&#x7B97;&#x65B0;&#x503C;&#x6BD4;&#x6539;&#x53D8;&#x73B0;&#x6709;&#x503C;&#x7684;&#x9519;&#x8BEF;&#x66F4;&#x5C11;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">chicks</span>(<span class="hljs-params">nest, year</span>) </span>{
  <span class="hljs-keyword">let</span> lines = network(nest).map(<span class="hljs-keyword">async</span> name =&gt; {
    <span class="hljs-keyword">return</span> name + <span class="hljs-string">&quot;: &quot;</span> +
      <span class="hljs-keyword">await</span> anyStorage(nest, name, <span class="hljs-string">`chicks in <span class="hljs-subst">${year}</span>`</span>);
  });
  <span class="hljs-keyword">return</span> (<span class="hljs-keyword">await</span> <span class="hljs-built_in">Promise</span>.all(lines)).join(<span class="hljs-string">&quot;\n&quot;</span>);
}
</code></pre>
<p>&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#x51FA;&#x6765;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x4F7F;&#x7528;<code>await</code>&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x95F4;&#x9694;&#x5728;&#x54EA;&#x91CC;&#x51FA;&#x73B0;&#x3002; JavaScript &#x7684;&#x663E;&#x5F0F;&#x5F02;&#x6B65;&#x6027;&#xFF08;&#x65E0;&#x8BBA;&#x662F;&#x901A;&#x8FC7;&#x56DE;&#x8C03;&#xFF0C;<code>Promise</code>&#x8FD8;&#x662F;<code>await</code>&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x95F4;&#x9694;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x7B49;&#x5F85;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x8FD9;&#x4E9B;&#x52A8;&#x4F5C;&#x671F;&#x95F4;&#x51BB;&#x7ED3;&#x7A0B;&#x5E8F;&#x3002; JavaScript &#x73AF;&#x5883;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x5728;&#x52A8;&#x4F5C;&#x5B8C;&#x6210;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002; &#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x8C03;&#x5EA6;&#x8FD9;&#x6837;&#x7684;&#x56DE;&#x8C03;&#xFF0C;&#x4F7F;&#x5176;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x4F9D;&#x6B21;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x4EEC;&#x7684;&#x6267;&#x884C;&#x4E0D;&#x4F1A;&#x91CD;&#x53E0;&#x3002;</p>
<p><code>Promise</code>&#x548C;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x4F7F;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x66F4;&#x5BB9;&#x6613;&#x3002;<code>Promise</code>&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4EE3;&#x8868;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x7F16;&#x5199;&#x540C;&#x6B65;&#x7A0B;&#x5E8F;&#x4E00;&#x6837;&#x7F16;&#x5199;&#x5F02;&#x6B65;&#x7A0B;&#x5E8F;&#x3002;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<h3 id="&#x8DDF;&#x8E2A;&#x624B;&#x672F;&#x5200;">&#x8DDF;&#x8E2A;&#x624B;&#x672F;&#x5200;</h3>
<p>&#x6751;&#x91CC;&#x7684;&#x4E4C;&#x9E26;&#x62E5;&#x6709;&#x4E00;&#x628A;&#x8001;&#x5F0F;&#x7684;&#x624B;&#x672F;&#x5200;&#xFF0C;&#x4ED6;&#x4EEC;&#x5076;&#x5C14;&#x4F1A;&#x7528;&#x4E8E;&#x7279;&#x6B8A;&#x7684;&#x4EFB;&#x52A1; - &#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5207;&#x5F00;&#x7EB1;&#x95E8;&#x6216;&#x5305;&#x88C5;&#x3002; &#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x8FFD;&#x8E2A;&#x5230;&#x624B;&#x672F;&#x5200;&#xFF0C;&#x6BCF;&#x6B21;&#x5C06;&#x624B;&#x672F;&#x5200;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x65F6;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x6DFB;&#x52A0;&#x5230;&#x62E5;&#x6709;&#x5B83;&#x548C;&#x62FF;&#x8D70;&#x5B83;&#x7684;&#x9E1F;&#x5DE2;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#xFF0C;&#x540D;&#x79F0;&#x4E3A;<code>&quot;scalpel&quot;</code>&#xFF0C;&#x503C;&#x4E3A;&#x65B0;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x627E;&#x5230;&#x624B;&#x672F;&#x5200;&#x5C31;&#x662F;&#x8DDF;&#x8E2A;&#x5B58;&#x50A8;&#x5668;&#x6761;&#x76EE;&#x7684;&#x75D5;&#x8FF9;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x9E1F;&#x5DE2;&#x6307;&#x5411;&#x5B83;&#x672C;&#x8EAB;&#x3002;</p>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x51FD;&#x6570;<code>locateScalpel</code>&#xFF0C;&#x5B83;&#x4ECE;&#x5B83;&#x8FD0;&#x884C;&#x7684;&#x9E1F;&#x5DE2;&#x5F00;&#x59CB;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;<code>anyStorage</code>&#x51FD;&#x6570;&#xFF0C;&#x6765;&#x8BBF;&#x95EE;&#x4EFB;&#x610F;&#x9E1F;&#x5DE2;&#x4E2D;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x3002; &#x624B;&#x672F;&#x5200;&#x5DF2;&#x7ECF;&#x79FB;&#x52A8;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x6BCF;&#x4E2A;&#x9E1F;&#x5DE2;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x90FD;&#x6709;&#x4E00;&#x4E2A;<code>&quot;scalpel&quot;</code>&#x6761;&#x76EE;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x518D;&#x6B21;&#x5199;&#x5165;&#x76F8;&#x540C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;<code>async</code>&#x548C;<code>await</code>&#x3002;</p>
<p>&#x5728;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x8BF7;&#x6C42;&#x6545;&#x969C;&#x662F;&#x5426;&#x6B63;&#x786E;&#x663E;&#x793A;&#x4E3A;&#x62D2;&#x7EDD;&#xFF1F; &#x5982;&#x4F55;&#x5B9E;&#x73B0;&#xFF1F;</p>
<pre><code class="lang-js"><span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">locateScalpel</span>(<span class="hljs-params">nest</span>) </span>{
  <span class="hljs-comment">// Your code here.</span>
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">locateScalpel2</span>(<span class="hljs-params">nest</span>) </span>{
  <span class="hljs-comment">// Your code here.</span>
}

locateScalpel(bigOak).then(<span class="hljs-built_in">console</span>.log);
<span class="hljs-comment">// &#x2192; Butcher Shop</span>
</code></pre>
<h3 id="&#x6784;&#x5EFA;promiseall">&#x6784;&#x5EFA;<code>Promise.all</code></h3>
<p>&#x7ED9;&#x5B9A;<code>Promise</code>&#x7684;&#x6570;&#x7EC4;&#xFF0C;<code>Promise.all</code>&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>Promise</code>&#xFF0C;&#x7B49;&#x5F85;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6240;&#x6709;<code>Promise</code>&#x5B8C;&#x6210;&#x3002; &#x7136;&#x540E;&#x5B83;&#x6210;&#x529F;&#xFF0C;&#x4EA7;&#x751F;&#x7ED3;&#x679C;&#x503C;&#x7684;&#x6570;&#x7EC4;&#x3002; &#x5982;&#x679C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;<code>Promise</code>&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x4E2A;<code>Promise</code>&#x4E5F;&#x5931;&#x8D25;&#xFF0C;&#x6545;&#x969C;&#x539F;&#x56E0;&#x6765;&#x81EA;&#x90A3;&#x4E2A;&#x5931;&#x8D25;&#x7684;<code>Promise</code>&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>Promise_all</code>&#x7684;&#x5E38;&#x89C4;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x5728;<code>Promise</code>&#x6210;&#x529F;&#x6216;&#x5931;&#x8D25;&#x540E;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x518D;&#x6B21;&#x6210;&#x529F;&#x6216;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x4E14;&#x89E3;&#x6790;&#x5B83;&#x7684;&#x51FD;&#x6570;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x8C03;&#x7528;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4F60;&#x5904;&#x7406;<code>Promise</code>&#x7684;&#x6545;&#x969C;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Promise_all</span>(<span class="hljs-params">promises</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>((resolve, reject) =&gt; {
    <span class="hljs-comment">// Your code here.</span>
  });
}

<span class="hljs-comment">// Test code.</span>
Promise_all([]).then(array =&gt; {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;This should be []:&quot;</span>, array);
});
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">soon</span>(<span class="hljs-params">val</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(resolve =&gt; {
    setTimeout(() =&gt; resolve(val), <span class="hljs-built_in">Math</span>.random() * <span class="hljs-number">500</span>);
  });
}
Promise_all([soon(<span class="hljs-number">1</span>), soon(<span class="hljs-number">2</span>), soon(<span class="hljs-number">3</span>)]).then(array =&gt; {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;This should be [1, 2, 3]:&quot;</span>, array);
});
Promise_all([soon(<span class="hljs-number">1</span>), <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-string">&quot;X&quot;</span>), soon(<span class="hljs-number">3</span>)])
  .then(array =&gt; {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;We should not get here&quot;</span>);
  })
  .catch(error =&gt; {
    <span class="hljs-keyword">if</span> (error != <span class="hljs-string">&quot;X&quot;</span>) {
      <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Unexpected failure:&quot;</span>, error);
    }
  });
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10.html" class="navigation navigation-prev " aria-label="Previous page: 十、模块">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12.html" class="navigation navigation-next " aria-label="Next page: 十二、项目：编程语言">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十一、异步编程","level":"1.13","depth":1,"next":{"title":"十二、项目：编程语言","level":"1.14","depth":1,"path":"12.md","ref":"12.md","articles":[]},"previous":{"title":"十、模块","level":"1.12","depth":1,"path":"10.md","ref":"10.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"11.md","mtime":"2019-12-08T16:07:04.981Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

