
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十二、项目：编程语言 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="13.html" />
    
    
    <link rel="prev" href="11.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >十二、项目：编程语言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x5341;&#x4E8C;&#x3001;&#x9879;&#x76EE;&#xFF1A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;">&#x5341;&#x4E8C;&#x3001;&#x9879;&#x76EE;&#xFF1A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</h2>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="https://eloquentjavascript.net/12_language.html" target="_blank">Project: A Programming Language</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>&#x786E;&#x5B9A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x542B;&#x4E49;&#x7684;&#x6C42;&#x503C;&#x5668;&#x53EA;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>Hal Abelson &#x548C; Gerald Sussman&#xFF0C;&#x300A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x7684;&#x6784;&#x9020;&#x548C;&#x89E3;&#x91CA;&#x300B;</p>
</blockquote>
<p><img src="img/12-0.jpg" alt=""></p>
<p>&#x6784;&#x5EFA;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0D;&#x4EC5;&#x7B80;&#x5355;&#xFF08;&#x53EA;&#x8981;&#x4F60;&#x7684;&#x8981;&#x6C42;&#x4E0D;&#x8981;&#x592A;&#x9AD8;&#x5C31;&#x597D;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x4EBA;&#x5BCC;&#x6709;&#x542F;&#x53D1;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x672C;&#x7AE0;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x4F60;&#x80FD;&#x53D1;&#x73B0;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x96BE;&#x4E8B;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x611F;&#x5230;&#x67D0;&#x4E9B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x806A;&#x660E;&#x65E0;&#x6BD4;&#xFF0C;&#x800C;&#x4E14;&#x5341;&#x5206;&#x590D;&#x6742;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x90FD;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x3002;&#x4E0D;&#x8FC7;&#x7ECF;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x9605;&#x8BFB;&#x548C;&#x5B9E;&#x9A8C;&#xFF0C;&#x6211;&#x5C31;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x5176;&#x5B9E;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x4E2D;&#x90A3;&#x4E48;&#x590D;&#x6742;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x521B;&#x9020;&#x4E00;&#x95E8;&#x540D;&#x4E3A; Egg &#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x95E8;&#x5C0F;&#x5DE7;&#x800C;&#x7B80;&#x5355;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x8DB3;&#x591F;&#x5F3A;&#x5927;&#x5230;&#x80FD;&#x63CF;&#x8FF0;&#x4F60;&#x6240;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x57FA;&#x4E8E;&#x51FD;&#x6570;&#x7684;&#x7B80;&#x5355;&#x62BD;&#x8C61;&#x3002;</p>
<h2 id="&#x89E3;&#x6790;">&#x89E3;&#x6790;</h2>
<p>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x4E2D;&#x6700;&#x76F4;&#x89C2;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x8BED;&#x6CD5;&#xFF08;syntax&#xFF09;&#x6216;&#x7B26;&#x53F7;&#x3002;&#x89E3;&#x6790;&#x5668;&#x662F;&#x4E00;&#x79CD;&#x7A0B;&#x5E8F;&#xFF0C;&#x8D1F;&#x8D23;&#x8BFB;&#x5165;&#x6587;&#x672C;&#x7247;&#x6BB5;&#xFF08;&#x5305;&#x542B;&#x7A0B;&#x5E8F;&#x7684;&#x6587;&#x672C;&#xFF09;&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x7CFB;&#x5217;&#x4E0E;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x82E5;&#x6587;&#x672C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x6CD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x89E3;&#x6790;&#x5668;&#x5E94;&#x8BE5;&#x6307;&#x51FA;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x8BED;&#x6CD5;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x5177;&#x6709;&#x4E00;&#x81F4;&#x6027;&#x3002;Egg &#x4E2D;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x3001;&#x6570;&#x5B57;&#xFF0C;&#x6216;&#x5E94;&#x7528;&#xFF08;application&#xFF09;&#x3002;&#x4E0D;&#x4EC5;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5C5E;&#x4E8E;&#x5E94;&#x7528;&#xFF0C;&#x800C;&#x4E14;<code>if</code>&#x548C;<code>while</code>&#x4E4B;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x6784;&#x9020;&#x4E5F;&#x5C5E;&#x4E8E;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x89E3;&#x6790;&#x5668;&#x7684;&#x7B80;&#x5355;&#x6027;&#xFF0C;Egg &#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x652F;&#x6301;&#x53CD;&#x659C;&#x6760;&#x8F6C;&#x4E49;&#x7B26;&#x4E4B;&#x7C7B;&#x7684;&#x5143;&#x7D20;&#x3002;&#x5B57;&#x7B26;&#x4E32;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#xFF08;&#x4E0D;&#x5305;&#x62EC;&#x53CC;&#x5F15;&#x53F7;&#xFF09;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x53CC;&#x5F15;&#x53F7;&#x5305;&#x56F4;&#x8D77;&#x6765;&#x3002;&#x6570;&#x503C;&#x662F;&#x6570;&#x5B57;&#x5E8F;&#x5217;&#x3002;&#x7ED1;&#x5B9A;&#x540D;&#x7531;&#x4EFB;&#x4F55;&#x975E;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8BED;&#x6CD5;&#x4E2D;&#x4E0D;&#x5177;&#x6709;&#x7279;&#x6B8A;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7684;&#x4E66;&#x5199;&#x65B9;&#x5F0F;&#x4E0E; JavaScript &#x4E2D;&#x4E00;&#x6837;&#xFF0C;&#x4E5F;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x540E;&#x6DFB;&#x52A0;&#x4E00;&#x5BF9;&#x62EC;&#x53F7;&#xFF0C;&#x62EC;&#x53F7;&#x4E2D;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002;</p>
<pre><code>do(define(x, 10),
   if(&gt;(x, 5),
      print(&quot;large&quot;),
      print(&quot;small&quot;)))
</code></pre><p>Egg &#x8BED;&#x8A00;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4F53;&#x73B0;&#x5728;&#xFF1A;JavaScript &#x4E2D;&#x7684;&#x6240;&#x6709;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x6BD4;&#x5982;<code>&gt;</code>&#xFF09;&#x5728; Egg &#x4E2D;&#x90FD;&#x662F;&#x7ED1;&#x5B9A;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x50CF;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x4E00;&#x6837;&#x8C03;&#x7528;&#x3002;&#x7531;&#x4E8E;&#x8BED;&#x6CD5;&#x4E2D;&#x6CA1;&#x6709;&#x8BED;&#x53E5;&#x5757;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>do</code>&#x7ED3;&#x6784;&#x6765;&#x8868;&#x793A;&#x591A;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x89E3;&#x6790;&#x5668;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x7531;&#x8868;&#x8FBE;&#x5F0F;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x7684;<code>type</code>&#x5C5E;&#x6027;&#xFF0C;&#x9664;&#x6B64;&#x4EE5;&#x5916;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x5185;&#x5BB9;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x7C7B;&#x578B;&#x4E3A;<code>&quot;value&quot;</code>&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8868;&#x793A;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x6570;&#x5B57;&#x3002;&#x5B83;&#x4EEC;&#x7684;<code>value</code>&#x5C5E;&#x6027;&#x5305;&#x542B;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x6570;&#x5B57;&#x503C;&#x3002;&#x7C7B;&#x578B;&#x4E3A;<code>&quot;word&quot;</code>&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x7B26;&#xFF08;&#x540D;&#x79F0;&#xFF09;&#x3002;&#x8FD9;&#x7C7B;&#x5BF9;&#x8C61;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x5C06;&#x6807;&#x8BC6;&#x7B26;&#x540D;&#x79F0;&#x4FDD;&#x5B58;&#x5728;<code>name</code>&#x5C5E;&#x6027;&#x4E2D;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x7C7B;&#x578B;&#x4E3A;<code>&quot;apply&quot;</code>&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8868;&#x793A;&#x5E94;&#x7528;&#x3002;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x4E2A;<code>operator</code>&#x5C5E;&#x6027;&#xFF0C;&#x6307;&#x5411;&#x5176;&#x64CD;&#x4F5C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;<code>args</code>&#x5C5E;&#x6027;&#xFF0C;&#x6301;&#x6709;&#x53C2;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;<code>&gt; (x, 5)</code>&#x8FD9;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x6210;&#x5982;&#x4E0B;&#x5F62;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-js">{
  type: <span class="hljs-string">&quot;apply&quot;</span>,
  operator: {type: <span class="hljs-string">&quot;word&quot;</span>, name: <span class="hljs-string">&quot;&gt;&quot;</span>},
  args: [
    {type: <span class="hljs-string">&quot;word&quot;</span>, name: <span class="hljs-string">&quot;x&quot;</span>},
    {type: <span class="hljs-string">&quot;value&quot;</span>, value: <span class="hljs-number">5</span>}
  ]
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x79F0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x6811;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5BF9;&#x8C61;&#x60F3;&#x8C61;&#x6210;&#x70B9;&#xFF0C;&#x5C06;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x60F3;&#x8C61;&#x6210;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x7EBF;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5C06;&#x4F1A;&#x53D8;&#x6210;&#x6811;&#x5F62;&#x3002;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x8FD8;&#x4F1A;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x88AB;&#x5305;&#x542B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x63A5;&#x7740;&#x53C8;&#x4F1A;&#x5305;&#x542B;&#x66F4;&#x591A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x6811;&#x7684;&#x5206;&#x652F;&#x91CD;&#x590D;&#x5206;&#x88C2;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p><img src="img/12-1.svg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x89E3;&#x6790;&#x5668;&#x4E0E;&#x6211;&#x4EEC;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x7F16;&#x5199;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x89E3;&#x6790;&#x5668;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF0C;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x7684;&#x89E3;&#x6790;&#x5668;&#x7ED3;&#x6784;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5C06;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x5212;&#x5206;&#x6210;&#x884C;&#xFF0C;&#x5E76;&#x9010;&#x884C;&#x5904;&#x7406;&#x3002;&#x800C;&#x4E14;&#x6BCF;&#x4E00;&#x884C;&#x53EA;&#x6709;&#x51E0;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x91CC;&#x7684;&#x95EE;&#x9898;&#x3002;Egg &#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x6309;&#x884C;&#x5206;&#x9694;&#xFF0C;&#x800C;&#x4E14;&#x8868;&#x8FBE;&#x5F0F;&#x4E4B;&#x95F4;&#x8FD8;&#x6709;&#x9012;&#x5F52;&#x7ED3;&#x6784;&#x3002;&#x5E94;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x6240;&#x5E78;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x7684;&#x65B9;&#x5F0F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x89E3;&#x6790;&#x5668;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4F18;&#x96C5;&#x5730;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x53CD;&#x6620;&#x4E86;&#x8BED;&#x8A00;&#x81EA;&#x8EAB;&#x5C31;&#x662F;&#x9012;&#x5F52;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>parseExpression</code>&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x5B57;&#x7B26;&#x4E32;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x5904;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E0E;&#x89E3;&#x6790;&#x8868;&#x8FBE;&#x5F0F;&#x540E;&#x5269;&#x4F59;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5F53;&#x89E3;&#x6790;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x65F6;&#xFF08;&#x6BD4;&#x5982;&#x5E94;&#x7528;&#x7684;&#x53C2;&#x6570;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x53C2;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x5269;&#x4F59;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5269;&#x4F59;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x66F4;&#x591A;&#x53C2;&#x6570;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x53C2;&#x6570;&#x5217;&#x8868;&#x7ED3;&#x675F;&#x7684;&#x53F3;&#x62EC;&#x53F7;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x90E8;&#x5206;&#x89E3;&#x6790;&#x5668;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">parseExpression</span>(<span class="hljs-params">program</span>) </span>{
  program = skipSpace(program);
  <span class="hljs-keyword">let</span> match, expr;
  <span class="hljs-keyword">if</span> (match = <span class="hljs-regexp">/^&quot;([^&quot;]*)&quot;/</span>.exec(program)) {
    expr = {type: <span class="hljs-string">&quot;value&quot;</span>, value: match[<span class="hljs-number">1</span>]};
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (match = <span class="hljs-regexp">/^\d+\b/</span>.exec(program)) {
    expr = {type: <span class="hljs-string">&quot;value&quot;</span>, value: <span class="hljs-built_in">Number</span>(match[<span class="hljs-number">0</span>])};
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (match = <span class="hljs-regexp">/^[^\s(),&quot;]+/</span>.exec(program)) {
    expr = {type: <span class="hljs-string">&quot;word&quot;</span>, name: match[<span class="hljs-number">0</span>]};
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Unexpected syntax: &quot;</span> + program);
  }

  <span class="hljs-keyword">return</span> parseApply(expr, program.slice(match[<span class="hljs-number">0</span>].length));
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">skipSpace</span>(<span class="hljs-params">string</span>) </span>{
  <span class="hljs-keyword">let</span> first = string.search(<span class="hljs-regexp">/\S/</span>);
  <span class="hljs-keyword">if</span> (first == <span class="hljs-number">-1</span>) <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;&quot;</span>;
  <span class="hljs-keyword">return</span> string.slice(first);
}
</code></pre>
<p>&#x7531;&#x4E8E; Egg &#x548C; JavaScript &#x4E00;&#x6837;&#xFF0C;&#x5141;&#x8BB8;&#x5176;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6709;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x7A7A;&#x767D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5728;&#x7A0B;&#x5E8F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F00;&#x59CB;&#x5904;&#x91CD;&#x590D;&#x5220;&#x9664;&#x7A7A;&#x767D;&#x3002; &#x8FD9;&#x5C31;&#x662F;<code>skipSpace</code>&#x51FD;&#x6570;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x8DF3;&#x8FC7;&#x5F00;&#x5934;&#x7684;&#x6240;&#x6709;&#x7A7A;&#x683C;&#x540E;&#xFF0C;<code>parseExpression</code>&#x4F7F;&#x7528;&#x4E09;&#x4E2A;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x68C0;&#x6D4B; Egg &#x652F;&#x6301;&#x7684;&#x4E09;&#x79CD;&#x539F;&#x5B50;&#x7684;&#x5143;&#x7D20;&#xFF1A;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6570;&#x503C;&#x548C;&#x5355;&#x8BCD;&#x3002;&#x89E3;&#x6790;&#x5668;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x5339;&#x914D;&#x7ED3;&#x679C;&#x6784;&#x9020;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E09;&#x79CD;&#x5F62;&#x5F0F;&#x90FD;&#x65E0;&#x6CD5;&#x4E0E;&#x8F93;&#x5165;&#x5339;&#x914D;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x5165;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x89E3;&#x6790;&#x5668;&#x5C31;&#x4F1A;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>SyntaxError</code>&#x800C;&#x4E0D;&#x662F;<code>Error</code>&#x4F5C;&#x4E3A;&#x5F02;&#x5E38;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x6807;&#x51C6;&#x9519;&#x8BEF;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x66F4;&#x5177;&#x4F53; - &#x5B83;&#x4E5F;&#x662F;&#x5728;&#x5C1D;&#x8BD5;&#x8FD0;&#x884C;&#x65E0;&#x6548;&#x7684; JavaScript &#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x629B;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x7A0B;&#x5E8F;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x5220;&#x53BB;&#x5339;&#x914D;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5C06;&#x5269;&#x4F59;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x8868;&#x8FBE;&#x5F0F;&#x5BF9;&#x8C61;&#x4E00;&#x8D77;&#x4F20;&#x9012;&#x7ED9;<code>parseApply</code>&#x51FD;&#x6570;&#x3002;&#x8BE5;&#x51FD;&#x6570;&#x68C0;&#x67E5;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x5426;&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5E94;&#x7528;&#x5219;&#x89E3;&#x6790;&#x5E26;&#x62EC;&#x53F7;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">parseApply</span>(<span class="hljs-params">expr, program</span>) </span>{
  program = skipSpace(program);
  <span class="hljs-keyword">if</span> (program[<span class="hljs-number">0</span>] != <span class="hljs-string">&quot;(&quot;</span>) {
    <span class="hljs-keyword">return</span> {expr: expr, rest: program};
  }

  program = skipSpace(program.slice(<span class="hljs-number">1</span>));
  expr = {type: <span class="hljs-string">&quot;apply&quot;</span>, operator: expr, args: []};
  <span class="hljs-keyword">while</span> (program[<span class="hljs-number">0</span>] != <span class="hljs-string">&quot;)&quot;</span>) {
    <span class="hljs-keyword">let</span> arg = parseExpression(program);
    expr.args.push(arg.expr);
    program = skipSpace(arg.rest);
    <span class="hljs-keyword">if</span> (program[<span class="hljs-number">0</span>] == <span class="hljs-string">&quot;,&quot;</span>) {
      program = skipSpace(program.slice(<span class="hljs-number">1</span>));
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (program[<span class="hljs-number">0</span>] != <span class="hljs-string">&quot;)&quot;</span>) {
      <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Expected &apos;,&apos; or &apos;)&apos;&quot;</span>);
    }
  }
  <span class="hljs-keyword">return</span> parseApply(expr, program.slice(<span class="hljs-number">1</span>));
}
</code></pre>
<p>&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E0D;&#x662F;&#x5DE6;&#x5706;&#x62EC;&#x53F7;&#xFF0C;&#x8BF4;&#x660E;&#x5F53;&#x524D;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#xFF0C;parseApply&#x4F1A;&#x8FD4;&#x56DE;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x5426;&#x5219;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x8DF3;&#x8FC7;&#x5DE6;&#x5706;&#x62EC;&#x53F7;&#xFF0C;&#x4E3A;&#x5E94;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x521B;&#x5EFA;&#x8BED;&#x6CD5;&#x6811;&#x3002;&#x63A5;&#x7740;&#x9012;&#x5F52;&#x8C03;&#x7528;<code>parseExpression</code>&#x89E3;&#x6790;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x76F4;&#x5230;&#x9047;&#x5230;&#x53F3;&#x5706;&#x62EC;&#x53F7;&#x4E3A;&#x6B62;&#x3002;&#x6B64;&#x5904;&#x901A;&#x8FC7;<code>parseApply</code>&#x548C;<code>parseExpression</code>&#x4E92;&#x76F8;&#x8C03;&#x7528;&#xFF0C;&#x5B9E;&#x73B0;&#x51FD;&#x6570;&#x95F4;&#x63A5;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x6765;&#x64CD;&#x4F5C;&#x53E6;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x6BD4;&#x5982;<code>multiplier(2)(1)</code>&#xFF09;&#xFF0C;&#x6240;&#x4EE5;<code>parseApply</code>&#x89E3;&#x6790;&#x5B8C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x540E;&#x5FC5;&#x987B;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x81EA;&#x8EAB;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x5BF9;&#x5706;&#x62EC;&#x53F7;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x89E3;&#x6790; Egg &#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>parse</code>&#x51FD;&#x6570;&#x6765;&#x5305;&#x88C5;<code>parseExpression</code>&#xFF0C;&#x5728;&#x89E3;&#x6790;&#x5B8C;&#x8868;&#x8FBE;&#x5F0F;&#x4E4B;&#x540E;&#x9A8C;&#x8BC1;&#x8F93;&#x5165;&#x662F;&#x5426;&#x5230;&#x8FBE;&#x7ED3;&#x5C3E;&#xFF08;&#x4E00;&#x4E2A; Egg &#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF09;&#xFF0C;&#x9047;&#x5230;&#x8F93;&#x5165;&#x7ED3;&#x5C3E;&#x540E;&#x4F1A;&#x8FD4;&#x56DE;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">parse</span>(<span class="hljs-params">program</span>) </span>{
  <span class="hljs-keyword">let</span> {expr, rest} = parseExpression(program);
  <span class="hljs-keyword">if</span> (skipSpace(result.rest).length &gt; <span class="hljs-number">0</span>) {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Unexpected text after program&quot;</span>);
  }
  <span class="hljs-keyword">return</span> expr;
}

<span class="hljs-built_in">console</span>.log(parse(<span class="hljs-string">&quot;+(a, 10)&quot;</span>));
<span class="hljs-comment">// &#x2192; {type: &quot;apply&quot;,</span>
<span class="hljs-comment">//    operator: {type: &quot;word&quot;, name: &quot;+&quot;},</span>
<span class="hljs-comment">//    args: [{type: &quot;word&quot;, name: &quot;a&quot;},</span>
<span class="hljs-comment">//           {type: &quot;value&quot;, value: 10}]}</span>
</code></pre>
<p>&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x4E86;&#xFF01;&#x5F53;&#x8868;&#x8FBE;&#x5F0F;&#x89E3;&#x6790;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x89E3;&#x6790;&#x51FD;&#x6570;&#x4E0D;&#x4F1A;&#x8F93;&#x51FA;&#x4EFB;&#x4F55;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5B58;&#x50A8;&#x51FA;&#x9519;&#x7684;&#x884C;&#x53F7;&#x4E0E;&#x5217;&#x53F7;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x6709;&#x52A9;&#x4E8E;&#x4E4B;&#x540E;&#x7684;&#x9519;&#x8BEF;&#x62A5;&#x544A;&#x3002;&#x4F46;&#x8003;&#x8651;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4F18;&#x79C0;&#x4E86;&#x3002;</p>
<h2 id="&#x6C42;&#x503C;&#x5668;&#xFF08;evaluator&#xFF09;">&#x6C42;&#x503C;&#x5668;&#xFF08;evaluator&#xFF09;</h2>
<p>&#x5728;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8BED;&#x6CD5;&#x6811;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5F53;&#x7136;&#x662F;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E86;&#xFF01;&#x800C;&#x8FD9;&#x5C31;&#x662F;&#x6C42;&#x503C;&#x5668;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8BED;&#x6CD5;&#x6811;&#x548C;&#x4F5C;&#x7528;&#x57DF;&#x5BF9;&#x8C61;&#x4F20;&#x9012;&#x7ED9;&#x6C42;&#x503C;&#x5668;&#xFF0C;&#x6267;&#x884C;&#x5668;&#x5C31;&#x4F1A;&#x6C42;&#x89E3;&#x8BED;&#x6CD5;&#x6811;&#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> specialForms = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">evaluate</span>(<span class="hljs-params">expr, scope</span>) </span>{
  <span class="hljs-keyword">if</span> (expr.type == <span class="hljs-string">&quot;value&quot;</span>) {
    <span class="hljs-keyword">return</span> expr.value;
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (expr.type == <span class="hljs-string">&quot;word&quot;</span>) {
    <span class="hljs-keyword">if</span> (expr.name <span class="hljs-keyword">in</span> scope) {
      <span class="hljs-keyword">return</span> scope[expr.name];
    } <span class="hljs-keyword">else</span> {
      <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">ReferenceError</span>(
        <span class="hljs-string">`Undefined binding: <span class="hljs-subst">${expr.name}</span>`</span>);
    }
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (expr.type == <span class="hljs-string">&quot;apply&quot;</span>) {
    <span class="hljs-keyword">let</span> {operator, args} = expr;
    <span class="hljs-keyword">if</span> (operator.type == <span class="hljs-string">&quot;word&quot;</span> &amp;&amp;
        operator.name <span class="hljs-keyword">in</span> specialForms) {
      <span class="hljs-keyword">return</span> specialForms[operator.name](expr.args, scope);
    } <span class="hljs-keyword">else</span> {
      <span class="hljs-keyword">let</span> op = evaluate(operator, scope);
      <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> op == <span class="hljs-string">&quot;function&quot;</span>) {
        <span class="hljs-keyword">return</span> op(...args.map(arg =&gt; evaluate(arg, scope)));
      } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">TypeError</span>(<span class="hljs-string">&quot;Applying a non-function.&quot;</span>);
      }
    }
  }
}
</code></pre>
<p>&#x6C42;&#x503C;&#x5668;&#x4E3A;&#x6BCF;&#x4E00;&#x79CD;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x5E94;&#x7684;&#x5904;&#x7406;&#x903B;&#x8F91;&#x3002;&#x5B57;&#x9762;&#x503C;&#x8868;&#x8FBE;&#x5F0F;&#x4EA7;&#x751F;&#x81EA;&#x8EAB;&#x7684;&#x503C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;<code>100</code>&#x7684;&#x6C42;&#x503C;&#x4E3A;&#x6570;&#x503C;<code>100</code>&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x7ED1;&#x5B9A;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x4E2D;&#x662F;&#x5426;&#x5B9E;&#x9645;&#x5B9A;&#x4E49;&#x4E86;&#x8BE5;&#x7ED1;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#xFF0C;&#x5219;&#x83B7;&#x53D6;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x5219;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x3002;&#x82E5;&#x5E94;&#x7528;&#x6709;&#x7279;&#x6B8A;&#x5F62;&#x5F0F;&#xFF08;&#x6BD4;&#x5982;<code>if</code>&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x6C42;&#x89E3;&#x4EFB;&#x4F55;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x8868;&#x8FBE;&#x5F0F;&#x53C2;&#x6570;&#x548C;&#x73AF;&#x5883;&#x4F20;&#x9012;&#x7ED9;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x662F;&#x666E;&#x901A;&#x8C03;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x6C42;&#x89E3;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x9A8C;&#x8BC1;&#x5176;&#x662F;&#x5426;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6C42;&#x503C;&#x540E;&#x7684;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x822C;&#x7684; JavaScript &#x51FD;&#x6570;&#x6765;&#x8868;&#x793A; Egg &#x7684;&#x51FD;&#x6570;&#x3002;&#x5728;&#x5B9A;&#x4E49;&#x7279;&#x6B8A;&#x683C;&#x5F0F;<code>fun</code>&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x770B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><code>evaluate</code>&#x7684;&#x9012;&#x5F52;&#x7ED3;&#x6784;&#x7C7B;&#x4F3C;&#x4E8E;&#x89E3;&#x6790;&#x5668;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x53CD;&#x6620;&#x4E86;&#x8BED;&#x8A00;&#x81EA;&#x8EAB;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x89E3;&#x6790;&#x5668;&#x548C;&#x6C42;&#x503C;&#x5668;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x5728;&#x89E3;&#x6790;&#x7684;&#x540C;&#x65F6;&#x6C42;&#x89E3;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F46;&#x5C06;&#x5176;&#x5206;&#x79BB;&#x4E3A;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x66F4;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x89E3;&#x91CA; Egg &#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4E0D;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x6216;&#x5411;&#x73AF;&#x5883;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x503C;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x8BE5;&#x8BED;&#x8A00;&#x5B8C;&#x6210;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x7279;&#x6B8A;&#x5F62;&#x5F0F;">&#x7279;&#x6B8A;&#x5F62;&#x5F0F;</h2>
<p><code>specialForms</code>&#x5BF9;&#x8C61;&#x7528;&#x4E8E;&#x5B9A;&#x4E49; Egg &#x4E2D;&#x7684;&#x7279;&#x6B8A;&#x8BED;&#x6CD5;&#x3002;&#x8BE5;&#x5BF9;&#x8C61;&#x5C06;&#x5355;&#x8BCD;&#x548C;&#x6C42;&#x89E3;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x51FD;&#x6570;&#x5173;&#x8054;&#x8D77;&#x6765;&#x3002;&#x76EE;&#x524D;&#x8BE5;&#x5BF9;&#x8C61;&#x4E3A;&#x7A7A;&#xFF0C;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;<code>if</code>&#x3002;</p>
<pre><code class="lang-js">specialForms.if = (args, scope) =&gt; {
  <span class="hljs-keyword">if</span> (args.length != <span class="hljs-number">3</span>) {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Wrong number of args to if&quot;</span>);
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (evaluate(args[<span class="hljs-number">0</span>], scope) !== <span class="hljs-literal">false</span>) {
    <span class="hljs-keyword">return</span> evaluate(args[<span class="hljs-number">1</span>], scope);
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> evaluate(args[<span class="hljs-number">2</span>], scope);
  }
};
</code></pre>
<p>Egg &#x7684;<code>if</code>&#x8BED;&#x53E5;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x3002;Egg &#x4F1A;&#x6C42;&#x89E3;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x82E5;&#x7ED3;&#x679C;&#x4E0D;&#x662F;<code>false</code>&#xFF0C;&#x5219;&#x6C42;&#x89E3;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5426;&#x5219;&#x6C42;&#x89E3;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x76F8;&#x8F83;&#x4E8E; JavaScript &#x4E2D;&#x7684;<code>if</code>&#x8BED;&#x53E5;&#xFF0C;Egg &#x7684;<code>if</code>&#x5F62;&#x5F0F;&#x66F4;&#x7C7B;&#x4F3C;&#x4E8E; JavaScript &#x4E2D;&#x7684;<code>?:</code>&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x6761;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x800C;&#x975E;&#x8BED;&#x53E5;&#xFF0C;&#x5B83;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5373;&#x7B2C;&#x4E8C;&#x4E2A;&#x6216;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>Egg &#x548C; JavaScript &#x5728;&#x5904;&#x7406;&#x6761;&#x4EF6;&#x503C;&#x65F6;&#x4E5F;&#x6709;&#x4E9B;&#x5DEE;&#x5F02;&#x3002;Egg &#x4E0D;&#x4F1A;&#x5C06; 0 &#x6216;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x5047;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x503C;&#x786E;&#x5B9E;&#x4E3A;<code>false</code>&#x65F6;&#xFF0C;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x624D;&#x4E3A;&#x5047;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5C06;<code>if</code>&#x8868;&#x8FBE;&#x4E3A;&#x7279;&#x6B8A;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x975E;&#x666E;&#x901A;&#x51FD;&#x6570;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x51FD;&#x6570;&#x7684;&#x6240;&#x6709;&#x53C2;&#x6570;&#x9700;&#x8981;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x524D;&#x6C42;&#x503C;&#x5B8C;&#x6BD5;&#xFF0C;&#x800C;<code>if</code>&#x5219;&#x53EA;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x503C;&#xFF0C;&#x786E;&#x5B9A;&#x6C42;&#x89E3;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FD8;&#x662F;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x3002;<code>while</code>&#x7684;&#x5F62;&#x5F0F;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x3002;</p>
<pre><code class="lang-js">specialForms.while = (args, scope) =&gt; {
  <span class="hljs-keyword">if</span> (args.length != <span class="hljs-number">2</span>) {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Wrong number of args to while&quot;</span>);
  }
  <span class="hljs-keyword">while</span> (evaluate(args[<span class="hljs-number">0</span>], scope) !== <span class="hljs-literal">false</span>) {
    evaluate(args[<span class="hljs-number">1</span>], scope);
  }

  <span class="hljs-comment">// Since undefined does not exist in Egg, we return false,</span>
  <span class="hljs-comment">// for lack of a meaningful result.</span>
  <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
};
</code></pre>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x79EF;&#x6728;&#x662F;<code>do</code>&#xFF0C;&#x4F1A;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x6267;&#x884C;&#x5176;&#x6240;&#x6709;&#x53C2;&#x6570;&#x3002;&#x6574;&#x4E2A;<code>do</code>&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x503C;&#x3002;</p>
<pre><code class="lang-js">specialForms.do = (args, scope) =&gt; {
  <span class="hljs-keyword">let</span> value = <span class="hljs-literal">false</span>;
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> arg <span class="hljs-keyword">of</span> args) {
    value = evaluate(arg, scope);
  }
};
</code></pre>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x540D;&#x4E3A;<code>define</code>&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6765;&#x521B;&#x5EFA;&#x7ED1;&#x5B9A;&#x5BF9;&#x7ED1;&#x5B9A;&#x8D4B;&#x503C;&#x3002;<code>define</code>&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x4F1A;&#x4EA7;&#x751F;&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5E76;&#x5C06;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x8D4B;&#x503C;&#x7ED9;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7531;&#x4E8E;<code>define</code>&#x4E5F;&#x662F;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x5219;&#x89C4;&#x5B9A;<code>define</code>&#x5E94;&#x8BE5;&#x5C06;&#x6211;&#x4EEC;&#x8D4B;&#x4E88;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x8FD4;&#x56DE;&#xFF08;&#x5C31;&#x50CF; JavaScript &#x4E2D;&#x7684;<code>=</code>&#x8FD0;&#x7B97;&#x7B26;&#x4E00;&#x6837;&#xFF09;&#x3002;</p>
<pre><code class="lang-js">specialForms.define = (args, scope) =&gt; {
  <span class="hljs-keyword">if</span> (args.length != <span class="hljs-number">2</span> || args[<span class="hljs-number">0</span>].type != <span class="hljs-string">&quot;word&quot;</span>) {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Incorrect use of define&quot;</span>);
  }
  <span class="hljs-keyword">let</span> value = evaluate(args[<span class="hljs-number">1</span>], scope);
  scope[args[<span class="hljs-number">0</span>].name] = value;
  <span class="hljs-keyword">return</span> value;
};
</code></pre>
<h2 id="&#x73AF;&#x5883;">&#x73AF;&#x5883;</h2>
<p><code>evaluate</code>&#x6240;&#x63A5;&#x53D7;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7684;&#x540D;&#x79F0;&#x5BF9;&#x5E94;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x5BF9;&#x5E94;&#x8FD9;&#x4E9B;&#x7ED1;&#x5B9A;&#x6240;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x3002; &#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5148;&#x5B9A;&#x4E49;&#x5E03;&#x5C14;&#x7ED1;&#x5B9A;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;<code>if</code>&#x8BED;&#x53E5;&#x3002;&#x7531;&#x4E8E;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x5176;&#x5B9A;&#x4E49;&#x7279;&#x6B8A;&#x8BED;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x5730;&#x5C06;<code>true</code>&#x3001;<code>false</code>&#x4E24;&#x4E2A;&#x540D;&#x79F0;&#x4E0E;&#x5176;&#x503C;&#x7ED1;&#x5B9A;&#x5373;&#x53EF;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> topEnv = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

topScope.true = <span class="hljs-literal">true</span>;
topScope.false = <span class="hljs-literal">false</span>;
</code></pre>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x5BF9;&#x5E03;&#x5C14;&#x503C;&#x6C42;&#x53CD;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> prog = parse(<span class="hljs-string">`if(true, false, true)`</span>);
<span class="hljs-built_in">console</span>.log(evaluate(prog, topScope));
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p>&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x57FA;&#x672C;&#x7684;&#x7B97;&#x672F;&#x548C;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x503C;&#x5230;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x4EE3;&#x7801;&#x77ED;&#x5C0F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x4F7F;&#x7528;<code>Function</code>&#x6765;&#x5408;&#x6210;&#x4E00;&#x6279;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5206;&#x522B;&#x5B9A;&#x4E49;&#x6240;&#x6709;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> op <span class="hljs-keyword">of</span> [<span class="hljs-string">&quot;+&quot;</span>, <span class="hljs-string">&quot;-&quot;</span>, <span class="hljs-string">&quot;*&quot;</span>, <span class="hljs-string">&quot;/&quot;</span>, <span class="hljs-string">&quot;==&quot;</span>, <span class="hljs-string">&quot;&lt;&quot;</span>, <span class="hljs-string">&quot;&gt;&quot;</span>]) {
  topScope[op] = <span class="hljs-built_in">Function</span>(<span class="hljs-string">&quot;a, b&quot;</span>, <span class="hljs-string">`return a <span class="hljs-subst">${op}</span> b;`</span>);
}
</code></pre>
<p>&#x8F93;&#x51FA;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5C06;<code>console.log</code>&#x5305;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x5E76;&#x79F0;&#x4E4B;&#x4E3A;<code>print</code>&#x3002;</p>
<pre><code class="lang-js">topScope.print = value =&gt; {
  <span class="hljs-built_in">console</span>.log(value);
  <span class="hljs-keyword">return</span> value;
};
</code></pre>
<p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x57FA;&#x672C;&#x5DE5;&#x5177;&#x6765;&#x7F16;&#x5199;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4FBF;&#x5229;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x7F16;&#x5199;&#x5E76;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x5B83;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x89E3;&#x6790;&#x6267;&#x884C;&#x6211;&#x4EEC;&#x8D4B;&#x4E88;&#x5B83;&#x7684;&#x5355;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">run</span>(<span class="hljs-params">program</span>) </span>{
  <span class="hljs-keyword">return</span> evaluate(parse(program), <span class="hljs-built_in">Object</span>.create(topScope));
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x539F;&#x578B;&#x94FE;&#x6765;&#x8868;&#x793A;&#x5D4C;&#x5957;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x9876;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5411;&#x5176;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x6DFB;&#x52A0;&#x7ED1;&#x5B9A;&#x3002;</p>
<pre><code class="lang-js">run(<span class="hljs-string">`
do(define(total, 0),
   define(count, 1),
   while(&lt;(count, 11),
         do(define(total, +(total, count)),
            define(count, +(count, 1)))),
   print(total))
`</span>);
<span class="hljs-comment">// &#x2192; 55</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x591A;&#x6B21;&#x770B;&#x5230;&#x8FC7;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x8BA1;&#x7B97;&#x6570;&#x5B57; 1 &#x5230; 10 &#x7684;&#x548C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x4F7F;&#x7528; Egg &#x8BED;&#x8A00;&#x8868;&#x8FBE;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x76F8;&#x8F83;&#x4E8E;&#x5B9E;&#x73B0;&#x540C;&#x6837;&#x529F;&#x80FD;&#x7684; JavaScript &#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x4F18;&#x96C5;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4E0D;&#x8DB3; 150 &#x884C;&#x4EE3;&#x7801;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x5DF2;&#x7ECF;&#x5F88;&#x4E0D;&#x9519;&#x4E86;&#x3002;</p>
<h2 id="&#x51FD;&#x6570;">&#x51FD;&#x6570;</h2>
<p>&#x6BCF;&#x4E2A;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x51FD;&#x6570;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;<code>fun</code>&#x8BED;&#x8A00;&#x6784;&#x9020;&#xFF0C;<code>fun</code>&#x5C06;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5F53;&#x4F5C;&#x51FD;&#x6570;&#x4F53;&#xFF0C;&#x5C06;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x540D;&#x79F0;&#x7528;&#x4F5C;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3002;</p>
<pre><code class="lang-js">specialForms.fun = (args, scope) =&gt; {
  <span class="hljs-keyword">if</span> (!args.length) {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Functions need a body&quot;</span>);
  <span class="hljs-keyword">let</span> body = args[args.length - <span class="hljs-number">1</span>];
  <span class="hljs-keyword">let</span> params = args.slice(<span class="hljs-number">0</span>, args.length - <span class="hljs-number">1</span>).map(expr =&gt; {
    <span class="hljs-keyword">if</span> (expr.type != <span class="hljs-string">&quot;word&quot;</span>) {
      <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">SyntaxError</span>(<span class="hljs-string">&quot;Parameter names must be words&quot;</span>);
    }
    <span class="hljs-keyword">return</span> expr.name;
  });

  <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">if</span> (<span class="hljs-built_in">arguments</span>.length != argNames.length) {
      <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">TypeError</span>(<span class="hljs-string">&quot;Wrong number of arguments&quot;</span>);
    }
    <span class="hljs-keyword">let</span> localScope = <span class="hljs-built_in">Object</span>.create(scope);
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-built_in">arguments</span>.length; i++) {
      localScope[params[i]] = <span class="hljs-built_in">arguments</span>[i];
    }
    <span class="hljs-keyword">return</span> evaluate(body, localScope);
  };
};
</code></pre>
<p>Egg &#x4E2D;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x5B83;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x3002; <code>fun</code>&#x5F62;&#x5F0F;&#x4EA7;&#x751F;&#x7684;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5E76;&#x5C06;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x6DFB;&#x52A0;&#x5230;&#x5B83;&#x3002; &#x7136;&#x540E;&#x6C42;&#x89E3;&#x6B64;&#x8303;&#x56F4;&#x5185;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x5E76;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-js">run(<span class="hljs-string">`
do(define(plusOne, fun(a, +(a, 1))),
   print(plusOne(10)))
`</span>);
<span class="hljs-comment">// &#x2192; 11</span>

run(<span class="hljs-string">`
do(define(pow, fun(base, exp,
     if(==(exp, 0),
        1,
        *(base, pow(base, -(exp, 1)))))),
   print(pow(2, 10)))
`</span>);
<span class="hljs-comment">// &#x2192; 1024</span>
</code></pre>
<h2 id="&#x7F16;&#x8BD1;">&#x7F16;&#x8BD1;</h2>
<p>&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x3002;&#x5728;&#x6C42;&#x503C;&#x671F;&#x95F4;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x76F4;&#x63A5;&#x4F5C;&#x7528;&#x57DF;&#x7531;&#x89E3;&#x6790;&#x5668;&#x4EA7;&#x751F;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x8868;&#x793A;&#x3002;</p>
<p>&#x7F16;&#x8BD1;&#x662F;&#x5728;&#x89E3;&#x6790;&#x548C;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x6DFB;&#x52A0;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;&#x901A;&#x8FC7;&#x4E8B;&#x5148;&#x5B8C;&#x6210;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C06;&#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x6C42;&#x503C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x6BCF;&#x4E2A;&#x7ED1;&#x5B9A;&#x65F6;&#x7ED1;&#x5B9A;&#x5F15;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x90FD;&#x662F;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x8FDB;&#x884C;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7701;&#x53BB;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x7ED1;&#x5B9A;&#x65F6;&#x641C;&#x7D22;&#x7ED1;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x53BB;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x83B7;&#x53D6;&#x7ED1;&#x5B9A;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F16;&#x8BD1;&#x4F1A;&#x5C06;&#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF08;&#x8BA1;&#x7B97;&#x673A;&#x5904;&#x7406;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7684;&#x539F;&#x59CB;&#x683C;&#x5F0F;&#xFF09;&#x3002;&#x4F46;&#x4E00;&#x4E9B;&#x5C06;&#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x6210;&#x4E0D;&#x540C;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x7F16;&#x8BD1;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A; Egg &#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x7684;&#x6C42;&#x503C;&#x7B56;&#x7565;&#xFF0C;&#x9996;&#x5148;&#x4F7F;&#x7528;<code>Function</code>&#xFF0C;&#x8C03;&#x7528; JavaScript &#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#xFF0C;&#x5C06; Egg &#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x6210; JavaScript &#x7A0B;&#x5E8F;&#xFF0C;&#x63A5;&#x7740;&#x6267;&#x884C;&#x7F16;&#x8BD1;&#x7ED3;&#x679C;&#x3002;&#x82E5;&#x80FD;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#x8BE5;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97; Egg &#x8FD0;&#x884C;&#x7684;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x800C;&#x4E14;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x7F16;&#x8BD1;&#x5668;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BFB;&#x8005;&#x5BF9;&#x8BE5;&#x8BDD;&#x9898;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x613F;&#x610F;&#x82B1;&#x8D39;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x5728;&#x8FD9;&#x4E0A;&#x9762;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x5C1D;&#x8BD5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x4F5C;&#x4E3A;&#x7EC3;&#x4E60;&#x3002;</p>
<h2 id="&#x7AD9;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#x4E0A;">&#x7AD9;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#x4E0A;</h2>
<p>&#x6211;&#x4EEC;&#x5B9A;&#x4E49;<code>if</code>&#x548C;<code>while</code>&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x4ED6;&#x4EEC;&#x5C01;&#x88C5;&#x5F97;&#x6216;&#x591A;&#x6216;&#x5C11;&#x548C; JavaScript &#x81EA;&#x8EAB;&#x7684;<code>if</code>&#x3001;<code>while</code>&#x6709;&#x70B9;&#x50CF;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;Egg &#x4E2D;&#x7684;&#x503C;&#x4E5F;&#x5C31;&#x662F; JavaScript &#x4E2D;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BFB;&#x8005;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x4E24;&#x79CD; Egg &#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x57FA;&#x4E8E; JavaScrip t&#x4E4B;&#x4E0A;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x6784;&#x5EFA;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6848;&#x9700;&#x8981;&#x5927;&#x91CF;&#x5DE5;&#x4F5C;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x4E14;&#x975E;&#x5E38;&#x590D;&#x6742;&#x3002;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x8BF4;&#xFF0C;&#x672C;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x60F3;&#x8BA9;&#x8BFB;&#x8005;&#x5BF9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65B9;&#x5F0F;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x5F53;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x81EA;&#x5DF1;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#xFF0C;&#x501F;&#x52A9;&#x4E8E;&#x522B;&#x4EBA;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x867D;&#x7136;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x7684;&#x8BED;&#x8A00;&#x5C31;&#x50CF;&#x73A9;&#x5177;&#x4E00;&#x6837;&#xFF0C;&#x5341;&#x5206;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x65E0;&#x8BBA;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x90FD;&#x65E0;&#x6CD5;&#x4E0E; JavaScript &#x76F8;&#x63D0;&#x5E76;&#x8BBA;&#x3002;&#x4F46;&#x5728;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x7F16;&#x5199;&#x4E00;&#x95E8;&#x5FAE;&#x578B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x4F20;&#x7EDF;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x82E5; JavaScript &#x6CA1;&#x6709;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7F16;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x89E3;&#x6790;&#x5668;&#x548C;&#x6C42;&#x503C;&#x5668;&#x3002;</p>
<p>&#x6216;&#x8005;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x4F60;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x673A;&#x68B0;&#x6050;&#x9F99;&#xFF0C;&#x9700;&#x8981;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x6050;&#x9F99;&#x7684;&#x884C;&#x4E3A;&#x3002;JavaScript &#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x8BE5;&#x529F;&#x80FD;&#x7684;&#x6700;&#x9AD8;&#x6548;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x4F5C;&#x4E3A;&#x66FF;&#x4EE3;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>behavior walk
  perform when
    destination ahead
  actions
    move left-foot
    move right-foot

behavior attack
  perform when
    Godzilla in-view
  actions
    fire laser-eyes
    launch arm-rockets
</code></pre><p>&#x8FD9;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x9886;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#xFF08;Domain-specific Language&#xFF09;&#xFF0C;&#x4E00;&#x79CD;&#x4E3A;&#x8868;&#x8FBE;&#x6781;&#x4E3A;&#x6709;&#x9650;&#x7684;&#x77E5;&#x8BC6;&#x9886;&#x57DF;&#x800C;&#x91CF;&#x8EAB;&#x5B9A;&#x5236;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x63CF;&#x8FF0;&#x5176;&#x9886;&#x57DF;&#x4E2D;&#x9700;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x5143;&#x7D20;&#x3002;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x6BD4;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x66F4;&#x5177;&#x8868;&#x73B0;&#x529B;&#x3002;</p>
<h2 id="&#x4E60;&#x9898;">&#x4E60;&#x9898;</h2>
<h3 id="&#x6570;&#x7EC4;">&#x6570;&#x7EC4;</h3>
<p>&#x5728; Egg &#x4E2D;&#x652F;&#x6301;&#x6570;&#x7EC4;&#x9700;&#x8981;&#x5C06;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x5230;&#x9876;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#xFF1A;<code>array(...values)</code>&#x7528;&#x4E8E;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x53C2;&#x6570;&#x503C;&#x7684;&#x6570;&#x7EC4;&#xFF0C;<code>length(array)</code>&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#xFF0C;<code>element(array, n)</code>&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x7B2C;<code>n</code>&#x4E2A;&#x5143;&#x7D20;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Modify these definitions...</span>

topEnv.array = <span class="hljs-string">&quot;...&quot;</span>;

topEnv.length = <span class="hljs-string">&quot;...&quot;</span>;

topEnv.element = <span class="hljs-string">&quot;...&quot;</span>;

run(<span class="hljs-string">`
do(define(sum, fun(array,
     do(define(i, 0),
        define(sum, 0),
        while(&lt;(i, length(array)),
          do(define(sum, +(sum, element(array, i))),
             define(i, +(i, 1)))),
        sum))),
   print(sum(array(1, 2, 3))))
`</span>);
<span class="hljs-comment">// &#x2192; 6</span>
</code></pre>
<h3 id="&#x95ED;&#x5305;">&#x95ED;&#x5305;</h3>
<p>&#x6211;&#x4EEC;&#x5B9A;&#x4E49;<code>fun</code>&#x7684;&#x65B9;&#x5F0F;&#x5141;&#x8BB8;&#x51FD;&#x6570;&#x5F15;&#x7528;&#x5176;&#x5468;&#x56F4;&#x73AF;&#x5883;&#xFF0C;&#x5C31;&#x50CF; JavaScript &#x51FD;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x51FD;&#x6570;&#x4F53;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5728;&#x5B9A;&#x4E49;&#x8BE5;&#x51FD;&#x6570;&#x65F6;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x6240;&#x6709;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x5C55;&#x793A;&#x4E86;&#x8BE5;&#x7279;&#x6027;&#xFF1A;&#x51FD;&#x6570;f&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5C06;&#x5176;&#x53C2;&#x6570;&#x548C;f&#x7684;&#x53C2;&#x6570;&#x76F8;&#x52A0;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E3A;&#x4E86;&#x4F7F;&#x7528;&#x7ED1;&#x5B9A;a&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x9700;&#x8981;&#x80FD;&#x591F;&#x8BBF;&#x95EE;f&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x3002;</p>
<pre><code class="lang-js">run(<span class="hljs-string">`
do(define(f, fun(a, fun(b, +(a, b)))),
   print(f(4)(5)))
`</span>);
<span class="hljs-comment">// &#x2192; 9</span>
</code></pre>
<p>&#x56DE;&#x987E;&#x4E00;&#x4E0B;fun&#x5F62;&#x5F0F;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x8BE5;&#x673A;&#x5236;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;</p>
<h3 id="&#x6CE8;&#x91CA;">&#x6CE8;&#x91CA;</h3>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; Egg &#x4E2D;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x5C31;&#x592A;&#x597D;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#xFF0C;&#x53EA;&#x8981;&#x51FA;&#x73B0;&#x4E86;&#x4E95;&#x53F7;&#xFF08;<code>#</code>&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5C06;&#x8BE5;&#x884C;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x5F53;&#x6210;&#x6CE8;&#x91CA;&#xFF0C;&#x5E76;&#x5FFD;&#x7565;&#x4E4B;&#xFF0C;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E; JavaScript &#x4E2D;&#x7684;<code>//</code>&#x3002;</p>
<p>&#x89E3;&#x6790;&#x5668;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x652F;&#x6301;&#x8BE5;&#x7279;&#x6027;&#x8FDB;&#x884C;&#x5927;&#x5E45;&#x4FEE;&#x6539;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;<code>skipSpace</code>&#x6765;&#x50CF;&#x8DF3;&#x8FC7;&#x7A7A;&#x767D;&#x7B26;&#x53F7;&#x4E00;&#x6837;&#x8DF3;&#x8FC7;&#x6CE8;&#x91CA;&#x5373;&#x53EF;&#xFF0C;&#x6B64;&#x65F6;&#x8C03;&#x7528;<code>skipSpace</code>&#x65F6;&#x4E0D;&#x4EC5;&#x4F1A;&#x8DF3;&#x8FC7;&#x7A7A;&#x767D;&#x7B26;&#x53F7;&#xFF0C;&#x8FD8;&#x4F1A;&#x8DF3;&#x8FC7;&#x6CE8;&#x91CA;&#x3002;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#xFF0C;&#x5B9E;&#x73B0;&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// This is the old skipSpace. Modify it...</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">skipSpace</span>(<span class="hljs-params">string</span>) </span>{
  <span class="hljs-keyword">let</span> first = string.search(<span class="hljs-regexp">/\S/</span>);
  <span class="hljs-keyword">if</span> (first == <span class="hljs-number">-1</span>) <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;&quot;</span>;
  <span class="hljs-keyword">return</span> string.slice(first);
}

<span class="hljs-built_in">console</span>.log(parse(<span class="hljs-string">&quot;# hello\nx&quot;</span>));
<span class="hljs-comment">// &#x2192; {type: &quot;word&quot;, name: &quot;x&quot;}</span>

<span class="hljs-built_in">console</span>.log(parse(<span class="hljs-string">&quot;a # one\n   # two\n()&quot;</span>));
<span class="hljs-comment">// &#x2192; {type: &quot;apply&quot;,</span>
<span class="hljs-comment">//    operator: {type: &quot;word&quot;, name: &quot;a&quot;},</span>
<span class="hljs-comment">//    args: []}</span>
</code></pre>
<h3 id="&#x4FEE;&#x590D;&#x4F5C;&#x7528;&#x57DF;">&#x4FEE;&#x590D;&#x4F5C;&#x7528;&#x57DF;</h3>
<p>&#x76EE;&#x524D;&#x7ED1;&#x5B9A;&#x8D4B;&#x503C;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;<code>define</code>&#x3002;&#x8BE5;&#x8BED;&#x8A00;&#x6784;&#x9020;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x5B9A;&#x4E49;&#x7ED1;&#x5B9A;&#x548C;&#x5C06;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x503C;&#x8D4B;&#x4E88;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x6B67;&#x4E49;&#x6027;&#x5F15;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x4F60;&#x5C1D;&#x8BD5;&#x4E3A;&#x4E00;&#x4E2A;&#x975E;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x8D4B;&#x4E88;&#x65B0;&#x503C;&#x65F6;&#xFF0C;&#x4F60;&#x6700;&#x540E;&#x4F1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x5E76;&#x66FF;&#x6362;&#x6389;&#x539F;&#x6765;&#x7684;&#x540C;&#x540D;&#x7ED1;&#x5B9A;&#x3002;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x6B63;&#x548C;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x603B;&#x662F;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7B28;&#x62D9;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;<code>define</code>&#x7684;&#x7279;&#x6B8A;&#x5F62;&#x5F0F;<code>set</code>&#xFF0C;&#x8BE5;&#x8BED;&#x53E5;&#x4F1A;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x65B0;&#x503C;&#xFF0C;&#x82E5;&#x7ED1;&#x5B9A;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x5185;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5219;&#x66F4;&#x65B0;&#x5176;&#x5916;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x76F8;&#x5E94;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x3002;&#x82E5;&#x7ED1;&#x5B9A;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#xFF0C;&#x5219;&#x629B;&#x51FA;<code>ReferenceError</code>&#xFF08;&#x53E6;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x9519;&#x8BEF;&#x7C7B;&#x578B;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x91C7;&#x53D6;&#x7684;&#x6280;&#x672F;&#x662F;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;&#x4F5C;&#x7528;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x5904;&#x7406;&#x76EE;&#x524D;&#x7684;&#x4EFB;&#x52A1;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Object.getPrototypeOf</code>&#x51FD;&#x6570;&#x6765;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x539F;&#x578B;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5BF9;&#x8C61;&#x5E76;&#x672A;&#x7EE7;&#x627F;<code>Object.prototype</code>&#xFF0C;&#x56E0;&#x6B64;&#x82E5;&#x60F3;&#x8C03;&#x7528;<code>hasOwnProperty</code>&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x7565;&#x663E;&#x590D;&#x6742;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">Object</span>.prototype.hasOwnProperty.call(scope, name);
</code></pre>
<pre><code class="lang-js">specialForms.set  = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">args, env</span>) </span>{
  <span class="hljs-comment">// Your code here.</span>
};

run(<span class="hljs-string">`
do(define(x, 4),
   define(setx, fun(val, set(x, val))),
   setx(50),
   print(x))
`</span>);
<span class="hljs-comment">// &#x2192; 50</span>
run(<span class="hljs-string">`set(quux, true)`</span>);
<span class="hljs-comment">// &#x2192; Some kind of ReferenceError</span>
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="11.html" class="navigation navigation-prev " aria-label="Previous page: 十一、异步编程">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="13.html" class="navigation navigation-next " aria-label="Next page: 十三、浏览器中的 JavaScript">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十二、项目：编程语言","level":"1.14","depth":1,"next":{"title":"十三、浏览器中的 JavaScript","level":"1.15","depth":1,"path":"13.md","ref":"13.md","articles":[]},"previous":{"title":"十一、异步编程","level":"1.13","depth":1,"path":"11.md","ref":"11.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"12.md","mtime":"2019-12-08T16:07:04.983Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

