
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十六、项目：平台游戏 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="17.html" />
    
    
    <link rel="prev" href="15.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >十六、项目：平台游戏</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x516D;&#x3001;&#x9879;&#x76EE;&#xFF1A;&#x5E73;&#x53F0;&#x6E38;&#x620F;">&#x5341;&#x516D;&#x3001;&#x9879;&#x76EE;&#xFF1A;&#x5E73;&#x53F0;&#x6E38;&#x620F;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="https://eloquentjavascript.net/16_game.html" target="_blank">Project: A Platform Game</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>&#x6240;&#x6709;&#x73B0;&#x5B9E;&#x90FD;&#x662F;&#x6E38;&#x620F;&#x3002;</p>
<p>Iain Banks&#xFF0C;&#x300A;The Player of Games&#x300B;</p>
</blockquote>
<p><img src="img/16-0.jpg" alt=""></p>
<p>&#x6211;&#x6700;&#x521D;&#x5BF9;&#x7535;&#x8111;&#x7684;&#x75F4;&#x8FF7;&#xFF0C;&#x5C31;&#x50CF;&#x8BB8;&#x591A;&#x5C0F;&#x5B69;&#x4E00;&#x6837;&#xFF0C;&#x4E0E;&#x7535;&#x8111;&#x6E38;&#x620F;&#x6709;&#x5173;&#x3002;&#x6211;&#x6C89;&#x8FF7;&#x5728;&#x90A3;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x6240;&#x6A21;&#x62DF;&#x51FA;&#x7684;&#x5C0F;&#x5C0F;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x64CD;&#x7EB5;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x540C;&#x65F6;&#x4E5F;&#x6C89;&#x8FF7;&#x5728;&#x90A3;&#x4E9B;&#x5C1A;&#x672A;&#x5C55;&#x5F00;&#x7684;&#x6545;&#x4E8B;&#x4E4B;&#x4E2D;&#x3002;&#x4F46;&#x6211;&#x6C89;&#x8FF7;&#x5176;&#x4E2D;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6E38;&#x620F;&#x5B9E;&#x9645;&#x63CF;&#x8FF0;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x53EF;&#x4EE5;&#x5145;&#x5206;&#x53D1;&#x6325;&#x6211;&#x7684;&#x60F3;&#x8C61;&#x529B;&#xFF0C;&#x53BB;&#x6784;&#x601D;&#x6545;&#x4E8B;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x6211;&#x5E76;&#x4E0D;&#x5E0C;&#x671B;&#x4EFB;&#x4F55;&#x4EBA;&#x628A;&#x7F16;&#x5199;&#x6E38;&#x620F;&#x4F5C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x4E1A;&#x3002;&#x5C31;&#x50CF;&#x97F3;&#x4E50;&#x4EA7;&#x4E1A;&#x4E2D;&#xFF0C;&#x90A3;&#x4E9B;&#x5E0C;&#x671B;&#x52A0;&#x5165;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x70ED;&#x5FF1;&#x5E74;&#x8F7B;&#x4EBA;&#x4E0E;&#x5B9E;&#x9645;&#x7684;&#x4EBA;&#x624D;&#x9700;&#x6C42;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x5DE8;&#x5927;&#x7684;&#x9E3F;&#x6C9F;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x6781;&#x4E0D;&#x5065;&#x5EB7;&#x7684;&#x5C31;&#x4E1A;&#x73AF;&#x5883;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x628A;&#x7F16;&#x5199;&#x6E38;&#x620F;&#x4F5C;&#x4E3A;&#x4E50;&#x8DA3;&#x8FD8;&#x662F;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x5E73;&#x53F0;&#x6E38;&#x620F;&#x3002;&#x5E73;&#x53F0;&#x6E38;&#x620F;&#xFF08;&#x6216;&#x8005;&#x53EB;&#x4F5C;&#x201C;&#x8DF3;&#x722C;&#x201D;&#x6E38;&#x620F;&#xFF09;&#x8981;&#x6C42;&#x73A9;&#x5BB6;&#x64CD;&#x7EB5;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x5728;&#x4E16;&#x754C;&#x4E2D;&#x79FB;&#x52A8;&#xFF0C;&#x8FD9;&#x79CD;&#x6E38;&#x620F;&#x5F80;&#x5F80;&#x662F;&#x4E8C;&#x7EF4;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x91C7;&#x7528;&#x5355;&#x4E00;&#x4FA7;&#x9762;&#x4F5C;&#x4E3A;&#x89C2;&#x5BDF;&#x89C6;&#x89D2;&#xFF0C;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x6765;&#x56DE;&#x8DF3;&#x8DC3;&#x3002;</p>
<h2 id="&#x6E38;&#x620F;">&#x6E38;&#x620F;</h2>
<p>&#x6211;&#x4EEC;&#x6E38;&#x620F;&#x5927;&#x81F4;&#x57FA;&#x4E8E;&#x7531; Thomas Palef &#x5F00;&#x53D1;&#x7684; <a href="http://www.lessmilk.com/games/10" target="_blank">Dark Blue</a>&#x3002;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x9009;&#x62E9;&#x4E86;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x65E2;&#x6709;&#x8DA3;&#x53C8;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x7F16;&#x5199;&#x5927;&#x91CF;&#x4EE3;&#x7801;&#x3002;&#x8BE5;&#x6E38;&#x620F;&#x770B;&#x8D77;&#x6765;&#x5982;&#x4E0B;&#x9875;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="img/16-1.png" alt=""></p>
<p>&#x9ED1;&#x8272;&#x7684;&#x65B9;&#x5757;&#x8868;&#x793A;&#x73A9;&#x5BB6;&#xFF0C;&#x73A9;&#x5BB6;&#x4EFB;&#x52A1;&#x662F;&#x6536;&#x96C6;&#x9EC4;&#x8272;&#x7684;&#x65B9;&#x5757;&#xFF08;&#x786C;&#x5E01;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x907F;&#x514D;&#x78B0;&#x5230;&#x7EA2;&#x8272;&#x7D20;&#x6750;&#xFF08;&#x201C;&#x5CA9;&#x6D46;&#x201D;&#xFF09;&#x3002;&#x5F53;&#x73A9;&#x5BB6;&#x6536;&#x96C6;&#x5B8C;&#x6240;&#x6709;&#x786C;&#x5E01;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x8FC7;&#x5173;&#x3002;</p>
<p>&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE6;&#x53F3;&#x65B9;&#x5411;&#x952E;&#x79FB;&#x52A8;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E0A;&#x65B9;&#x5411;&#x952E;&#x8DF3;&#x8DC3;&#x3002;&#x8DF3;&#x8DC3;&#x6B63;&#x662F;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x7684;&#x7279;&#x957F;&#x3002;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x8DF3;&#x8DC3;&#x5230;&#x6570;&#x500D;&#x4E8E;&#x81EA;&#x5DF1;&#x8EAB;&#x9AD8;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x534A;&#x7A7A;&#x4E2D;&#x6539;&#x53D8;&#x65B9;&#x5411;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#xFF0C;&#x4F46;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x73A9;&#x5BB6;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5728;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x5C4F;&#x5E55;&#x4E0A;&#x90A3;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x5316;&#x8EAB;&#x3002;</p>
<p>&#x8BE5;&#x6E38;&#x620F;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x80CC;&#x666F;&#xFF0C;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5E03;&#x5C40;&#xFF0C;&#x53EF;&#x53EF;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x5219;&#x8986;&#x76D6;&#x5728;&#x80CC;&#x666F;&#x4E4B;&#x4E0A;&#x3002;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x53EF;&#x80FD;&#x662F;&#x7A7A;&#x6C14;&#x3001;&#x56FA;&#x4F53;&#x6216;&#x5CA9;&#x6D46;&#x3002;&#x53EF;&#x53EF;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x662F;&#x73A9;&#x5BB6;&#x3001;&#x786C;&#x5E01;&#x6216;&#x8005;&#x67D0;&#x4E00;&#x5757;&#x5CA9;&#x6D46;&#x3002;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#x4E0D;&#x9650;&#x4E8E;&#x7F51;&#x683C;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x5750;&#x6807;&#x53EF;&#x4EE5;&#x662F;&#x5206;&#x6570;&#xFF0C;&#x5141;&#x8BB8;&#x5E73;&#x6ED1;&#x8FD0;&#x52A8;&#x3002;</p>
<h2 id="&#x5B9E;&#x73B0;&#x6280;&#x672F;">&#x5B9E;&#x73B0;&#x6280;&#x672F;</h2>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x7684; DOM &#x6765;&#x5C55;&#x793A;&#x6E38;&#x620F;&#x754C;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x901A;&#x8FC7;&#x5904;&#x7406;&#x6309;&#x952E;&#x4E8B;&#x4EF6;&#x6765;&#x8BFB;&#x53D6;&#x7528;&#x6237;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x4E0E;&#x5C4F;&#x5E55;&#x548C;&#x952E;&#x76D8;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x662F;&#x5B9E;&#x73B0;&#x6E38;&#x620F;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x5F88;&#x5C0F;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x5143;&#x7D20;&#x90FD;&#x53EA;&#x662F;&#x5F69;&#x8272;&#x65B9;&#x5757;&#xFF0C;&#x56E0;&#x6B64;&#x7ED8;&#x5236;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#x3002;&#x6211;&#x4EEC;&#x4E3A;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x521B;&#x5EFA;&#x5BF9;&#x5E94;&#x7684; DOM &#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6837;&#x5F0F;&#x6765;&#x4E3A;&#x5176;&#x6307;&#x5B9A;&#x80CC;&#x666F;&#x989C;&#x8272;&#x3001;&#x5C3A;&#x5BF8;&#x548C;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x80CC;&#x666F;&#x662F;&#x7531;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x7684;&#x65B9;&#x5757;&#x7EC4;&#x6210;&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8868;&#x683C;&#x6765;&#x5C55;&#x793A;&#x80CC;&#x666F;&#x3002;&#x81EA;&#x7531;&#x53EF;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x5143;&#x7D20;&#x6765;&#x8986;&#x76D6;&#x3002;</p>
<p>&#x6E38;&#x620F;&#x548C;&#x67D0;&#x4E9B;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x5728;&#x4E0D;&#x4EA7;&#x751F;&#x660E;&#x663E;&#x5EF6;&#x8FDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7ED8;&#x5236;&#x52A8;&#x753B;&#x5E76;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x8F93;&#x5165;&#xFF0C;&#x6027;&#x80FD;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5C3D;&#x7BA1; DOM &#x6700;&#x521D;&#x5E76;&#x975E;&#x4E3A;&#x9AD8;&#x6027;&#x80FD;&#x7ED8;&#x56FE;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A; DOM &#x7684;&#x6027;&#x80FD;&#x8868;&#x73B0;&#x5F97;&#x6BD4;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x4E2D;&#x8981;&#x597D;&#x5F97;&#x591A;&#x3002;&#x8BFB;&#x8005;&#x5DF2;&#x7ECF;&#x5728;&#x7B2C; 13 &#x7AE0;&#x4E2D;&#x770B;&#x8FC7;&#x4E00;&#x4E9B;&#x52A8;&#x753B;&#xFF0C;&#x5728;&#x73B0;&#x4EE3;&#x673A;&#x5668;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x4E0D;&#x600E;&#x4E48;&#x8003;&#x8651;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x50CF;&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x6E38;&#x620F;&#x4E5F;&#x53EF;&#x4EE5;&#x6D41;&#x7545;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7814;&#x7A76;&#x53E6;&#x4E00;&#x79CD;&#x6D4F;&#x89C8;&#x5668;&#x6280;&#x672F; &#x2014;&#x2014; <code>&lt;canvas&gt;</code>&#x6807;&#x7B7E;&#x3002;&#x8BE5;&#x6807;&#x7B7E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x66F4;&#x4E3A;&#x4F20;&#x7EDF;&#x7684;&#x56FE;&#x50CF;&#x7ED8;&#x5236;&#x65B9;&#x5F0F;&#xFF0C;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x5F62;&#x72B6;&#x548C;&#x50CF;&#x7D20;&#x800C;&#x975E; DOM &#x5143;&#x7D20;&#x3002;</p>
<h2 id="&#x5173;&#x5361;">&#x5173;&#x5361;</h2>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x3001;&#x53EF;&#x7F16;&#x8F91;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6307;&#x5B9A;&#x5173;&#x5361;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x5207;&#x6700;&#x5F00;&#x59CB;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5927;&#x578B;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x80CC;&#x666F;&#x7F51;&#x683C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x53EF;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x5C0F;&#x578B;&#x5173;&#x5361;&#x7684;&#x5E73;&#x9762;&#x56FE;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> simpleLevelPlan = <span class="hljs-string">`
......................
..#................#..
..#..............=.#..
..#.........o.o....#..
..#.@......#####...#..
..#####............#..
......#++++++++++++#..
......##############..
......................`</span>;
</code></pre>
<p>&#x53E5;&#x53F7;&#x662F;&#x7A7A;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E95;&#x53F7;&#xFF08;<code>#</code>&#xFF09;&#x5B57;&#x7B26;&#x662F;&#x5899;&#xFF0C;&#x52A0;&#x53F7;&#x662F;&#x5CA9;&#x6D46;&#x3002;&#x73A9;&#x5BB6;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x662F; AT &#x7B26;&#x53F7;&#xFF08;<code>@</code>&#xFF09;&#x3002;&#x6BCF;&#x4E2A;<code>O</code>&#x5B57;&#x7B26;&#x90FD;&#x662F;&#x4E00;&#x679A;&#x786C;&#x5E01;&#xFF0C;&#x7B49;&#x53F7;&#xFF08;<code>=</code>&#xFF09;&#x662F;&#x4E00;&#x5757;&#x6765;&#x56DE;&#x6C34;&#x5E73;&#x79FB;&#x52A8;&#x7684;&#x5CA9;&#x6D46;&#x5757;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x652F;&#x6301;&#x4E24;&#x79CD;&#x989D;&#x5916;&#x7684;&#x53EF;&#x79FB;&#x52A8;&#x5CA9;&#x6D46;&#xFF1A;&#x7BA1;&#x9053;&#x7B26;&#x53F7;&#xFF08;<code>|</code>&#xFF09;&#x8868;&#x793A;&#x5782;&#x76F4;&#x79FB;&#x52A8;&#x7684;&#x5CA9;&#x6D46;&#x5757;&#xFF0C;&#x800C;<code>v</code>&#x8868;&#x793A;&#x4E0B;&#x843D;&#x7684;&#x5CA9;&#x6D46;&#x5757; &#x2014;&#x2014; &#x8FD9;&#x79CD;&#x5CA9;&#x6D46;&#x5757;&#x4E5F;&#x662F;&#x5782;&#x76F4;&#x79FB;&#x52A8;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x6765;&#x56DE;&#x5F39;&#x8DF3;&#xFF0C;&#x53EA;&#x4F1A;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x9047;&#x5230;&#x5730;&#x9762;&#x624D;&#x4F1A;&#x76F4;&#x63A5;&#x56DE;&#x5230;&#x5176;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x5305;&#x542B;&#x4E86;&#x8BB8;&#x591A;&#x5173;&#x5361;&#xFF0C;&#x73A9;&#x5BB6;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x5173;&#x5361;&#x3002;&#x6BCF;&#x5173;&#x7684;&#x8FC7;&#x5173;&#x6761;&#x4EF6;&#x662F;&#x73A9;&#x5BB6;&#x9700;&#x8981;&#x6536;&#x96C6;&#x6240;&#x6709;&#x786C;&#x5E01;&#x3002;&#x5982;&#x679C;&#x73A9;&#x5BB6;&#x78B0;&#x5230;&#x5CA9;&#x6D46;&#xFF0C;&#x5F53;&#x524D;&#x5173;&#x5361;&#x4F1A;&#x6062;&#x590D;&#x521D;&#x59CB;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x5C1D;&#x8BD5;&#x8FC7;&#x5173;&#x3002;</p>
<h2 id="&#x8BFB;&#x53D6;&#x5173;&#x5361;">&#x8BFB;&#x53D6;&#x5173;&#x5361;</h2>
<p>&#x4E0B;&#x9762;&#x7684;&#x7C7B;&#x5B58;&#x50A8;&#x4E86;&#x5173;&#x5361;&#x5BF9;&#x8C61;&#x3002;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x662F;&#x5B9A;&#x4E49;&#x5173;&#x5361;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Level</span> </span>{
  <span class="hljs-keyword">constructor</span>(plan) {
    <span class="hljs-keyword">let</span> rows = plan.trim().split(<span class="hljs-string">&quot;\n&quot;</span>).map(l =&gt; [...l]);
    <span class="hljs-keyword">this</span>.height = rows.length;
    <span class="hljs-keyword">this</span>.width = rows[<span class="hljs-number">0</span>].length;
    <span class="hljs-keyword">this</span>.startActors = [];
    <span class="hljs-keyword">this</span>.rows = rows.map((row, y) =&gt; {
      <span class="hljs-keyword">return</span> row.map((ch, x) =&gt; {
        <span class="hljs-keyword">let</span> type = levelChars[ch];
        <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> type == <span class="hljs-string">&quot;string&quot;</span>) <span class="hljs-keyword">return</span> type;
        <span class="hljs-keyword">this</span>.startActors.push(
          type.create(<span class="hljs-keyword">new</span> Vec(x, y), ch));
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;empty&quot;</span>;
      });
    });
  }
}
</code></pre>
<p><code>trim</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x79FB;&#x9664;&#x5E73;&#x9762;&#x56FE;&#x5B57;&#x7B26;&#x4E32;&#x8D77;&#x59CB;&#x548C;&#x7EC8;&#x6B62;&#x5904;&#x7684;&#x7A7A;&#x767D;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x7684;&#x793A;&#x4F8B;&#x5E73;&#x9762;&#x56FE;&#x4EE5;&#x6362;&#x884C;&#x5F00;&#x59CB;&#xFF0C;&#x4EE5;&#x4FBF;&#x6240;&#x6709;&#x884C;&#x90FD;&#x5728;&#x5F7C;&#x6B64;&#x7684;&#x6B63;&#x4E0B;&#x65B9;&#x3002;&#x5176;&#x4F59;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7531;&#x6362;&#x884C;&#x7B26;&#x62C6;&#x5206;&#xFF0C;&#x6BCF;&#x4E00;&#x884C;&#x6269;&#x5C55;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x751F;&#x6210;&#x4E86;&#x5B57;&#x7B26;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;<code>rows</code>&#x5305;&#x542B;&#x5B57;&#x7B26;&#x6570;&#x7EC4;&#x3001;&#x5E73;&#x9762;&#x56FE;&#x7684;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x5F97;&#x51FA;&#x6C34;&#x5E73;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x5FC5;&#x987B;&#x5C06;&#x53EF;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x4E0E;&#x80CC;&#x666F;&#x7F51;&#x683C;&#x5206;&#x5F00;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x79F0;&#x4E3A;&#x89D2;&#x8272;&#xFF08;Actor&#xFF09;&#x3002;&#x5B83;&#x4EEC;&#x5C06;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x80CC;&#x666F;&#x5C06;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6570;&#x7EC4;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x6301;&#x6709;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#xFF0C;&#x5982;<code>&quot;empty&quot;</code>&#xFF0C;<code>&quot;wall&quot;</code>&#xFF0C;&#x6216;<code>&quot;lava&quot;</code>&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x6570;&#x7EC4;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x884C;&#x4E0A;&#x6620;&#x5C04;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x5BB9;&#x4E0A;&#x8FDB;&#x884C;&#x6620;&#x5C04;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;<code>map</code>&#x5C06;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x6620;&#x5C04;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x7ED9;&#x5B9A;&#x5B57;&#x7B26;&#x7684;<code>x</code>&#x548C;<code>y</code>&#x5750;&#x6807;&#x3002;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x5C06;&#x5B58;&#x50A8;&#x4E3A;&#x4E00;&#x5BF9;&#x5750;&#x6807;&#xFF0C;&#x5DE6;&#x4E0A;&#x89D2;&#x4E3A;<code>0, 0</code>&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x80CC;&#x666F;&#x65B9;&#x5757;&#x4E3A; 1 &#x5355;&#x4F4D;&#x9AD8;&#x548C;&#x5BBD;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x5E73;&#x9762;&#x56FE;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#xFF0C;<code>Level</code>&#x6784;&#x9020;&#x5668;&#x4F7F;&#x7528;<code>levelChars</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5C06;&#x80CC;&#x666F;&#x5143;&#x7D20;&#x6620;&#x5C04;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x89D2;&#x8272;&#x5B57;&#x7B26;&#x6620;&#x5C04;&#x4E3A;&#x7C7B;&#x3002;&#x5F53;<code>type</code>&#x662F;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x7C7B;&#x65F6;&#xFF0C;&#x5B83;&#x7684;<code>create</code>&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x88AB;&#x6DFB;&#x52A0;&#x5230;<code>startActors</code>&#xFF0C;&#x6620;&#x5C04;&#x51FD;&#x6570;&#x4E3A;&#x8FD9;&#x4E2A;&#x80CC;&#x666F;&#x65B9;&#x5757;&#x8FD4;&#x56DE;<code>&quot;empty&quot;</code>&#x3002;</p>
<p>&#x89D2;&#x8272;&#x7684;&#x4F4D;&#x7F6E;&#x5B58;&#x50A8;&#x4E3A;&#x4E00;&#x4E2A;<code>Vec</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x662F;&#x4E8C;&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x4E00;&#x4E2A;&#x5177;&#x6709;<code>x</code>&#x548C;<code>y</code>&#x5C5E;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x50CF;&#x7B2C;&#x516D;&#x7AE0;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5F53;&#x6E38;&#x620F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x89D2;&#x8272;&#x5C06;&#x505C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x6D88;&#x5931;&#xFF08;&#x5C31;&#x50CF;&#x786C;&#x5E01;&#x88AB;&#x6536;&#x96C6;&#x65F6;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;<code>State</code>&#x7C7B;&#x6765;&#x8DDF;&#x8E2A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x6E38;&#x620F;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">State</span> </span>{
  <span class="hljs-keyword">constructor</span>(level, actors, status) {
    <span class="hljs-keyword">this</span>.level = level;
    <span class="hljs-keyword">this</span>.actors = actors;
    <span class="hljs-keyword">this</span>.status = status;
  }

  <span class="hljs-keyword">static</span> start(level) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> State(level, level.startActors, <span class="hljs-string">&quot;playing&quot;</span>);
  }

  get player() {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.actors.find(a =&gt; a.type == <span class="hljs-string">&quot;player&quot;</span>);
  }
}
</code></pre>
<p>&#x5F53;&#x6E38;&#x620F;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;<code>status</code>&#x5C5E;&#x6027;&#x5C06;&#x5207;&#x6362;&#x4E3A;<code>&quot;lost&quot;</code>&#x6216;<code>&quot;won&quot;</code>&#x3002;</p>
<p>&#x8FD9;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x6301;&#x4E45;&#x6027;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x66F4;&#x65B0;&#x6E38;&#x620F;&#x72B6;&#x6001;&#x4F1A;&#x521B;&#x5EFA;&#x65B0;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x4F7F;&#x65E7;&#x72B6;&#x6001;&#x4FDD;&#x6301;&#x5B8C;&#x6574;&#x3002;</p>
<h2 id="&#x89D2;&#x8272;">&#x89D2;&#x8272;</h2>
<p>&#x89D2;&#x8272;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#xFF0C;&#x6E38;&#x620F;&#x4E2D;&#x7ED9;&#x5B9A;&#x53EF;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x548C;&#x72B6;&#x6001;&#x3002;&#x6240;&#x6709;&#x7684;&#x89D2;&#x8272;&#x5BF9;&#x8C61;&#x90FD;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x5B83;&#x4EEC;&#x7684;<code>pos</code>&#x5C5E;&#x6027;&#x4FDD;&#x5B58;&#x5143;&#x7D20;&#x7684;&#x5DE6;&#x4E0A;&#x89D2;&#x5750;&#x6807;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;<code>size</code>&#x5C5E;&#x6027;&#x4FDD;&#x5B58;&#x5176;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;<code>update</code>&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x65B0;&#x72B6;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x3002;&#x5B83;&#x6A21;&#x62DF;&#x4E86;&#x89D2;&#x8272;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;&#x54CD;&#x5E94;&#x7BAD;&#x5934;&#x952E;&#x5E76;&#x4E14;&#x79FB;&#x52A8;&#xFF0C;&#x56E0;&#x5CA9;&#x6D46;&#x800C;&#x6765;&#x56DE;&#x5F39;&#x8DF3;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x65B0;&#x7684;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x89D2;&#x8272;&#x5BF9;&#x8C61;&#x3002;</p>
<p><code>type</code>&#x5C5E;&#x6027;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x6307;&#x5B9A;&#x4E86;&#x89D2;&#x8272;&#x7C7B;&#x578B;&#xFF1A;<code>&quot;player&quot;</code>&#xFF0C;<code>&quot;coin&quot;</code>&#x6216;&#x8005;<code>&quot;lava&quot;</code>&#x3002;&#x8FD9;&#x5728;&#x7ED8;&#x5236;&#x6E38;&#x620F;&#x65F6;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4E3A;&#x89D2;&#x8272;&#x7ED8;&#x5236;&#x7684;&#x77E9;&#x5F62;&#x7684;&#x5916;&#x89C2;&#x57FA;&#x4E8E;&#x5176;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x89D2;&#x8272;&#x7C7B;&#x6709;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;<code>create</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x7531;<code>Level</code>&#x6784;&#x9020;&#x5668;&#x4F7F;&#x7528;&#xFF0C;&#x7528;&#x4E8E;&#x4ECE;&#x5173;&#x5361;&#x5E73;&#x9762;&#x56FE;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x3002;&#x5B83;&#x63A5;&#x53D7;&#x5B57;&#x7B26;&#x672C;&#x8EAB;&#x53CA;&#x5176;&#x5750;&#x6807;&#xFF0C;&#x8FD9;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;<code>Lava</code>&#x7C7B;&#x5904;&#x7406;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x7B26;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x5C06;&#x7528;&#x4E8E;&#x4E8C;&#x7EF4;&#x503C;&#x7684;<code>Vec</code>&#x7C7B;&#xFF0C;&#x4F8B;&#x5982;&#x89D2;&#x8272;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x5927;&#x5C0F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Vec</span> </span>{
  <span class="hljs-keyword">constructor</span>(x, y) {
    <span class="hljs-keyword">this</span>.x = x; <span class="hljs-keyword">this</span>.y = y;
  }
  plus(other) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Vec(<span class="hljs-keyword">this</span>.x + other.x, <span class="hljs-keyword">this</span>.y + other.y);
  }
  times(factor) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Vec(<span class="hljs-keyword">this</span>.x * factor, <span class="hljs-keyword">this</span>.y * factor);
  }
}
</code></pre>
<p><code>times</code>&#x65B9;&#x6CD5;&#x7528;&#x7ED9;&#x5B9A;&#x7684;&#x6570;&#x5B57;&#x6765;&#x7F29;&#x653E;&#x5411;&#x91CF;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x901F;&#x5EA6;&#x5411;&#x91CF;&#x4E58;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF0C;&#x6765;&#x83B7;&#x5F97;&#x90A3;&#x4E2A;&#x65F6;&#x95F4;&#x7684;&#x884C;&#x8D70;&#x8DDD;&#x79BB;&#x65F6;&#xFF0C;&#x8FD9;&#x5C31;&#x6709;&#x7528;&#x4E86;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x89D2;&#x8272;&#x62E5;&#x6709;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x8FD9;&#x4E9B;&#x7C7B;&#x3002;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x7684;<code>update</code>&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x73A9;&#x5BB6;&#x7C7B;&#x62E5;&#x6709;<code>speed</code>&#x5C5E;&#x6027;&#xFF0C;&#x5B58;&#x50A8;&#x4E86;&#x5F53;&#x524D;&#x901F;&#x5EA6;&#xFF0C;&#x6765;&#x6A21;&#x62DF;&#x52A8;&#x91CF;&#x548C;&#x91CD;&#x529B;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Player</span> </span>{
  <span class="hljs-keyword">constructor</span>(pos, speed) {
    <span class="hljs-keyword">this</span>.pos = pos;
    <span class="hljs-keyword">this</span>.speed = speed;
  }

  get type() { <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;player&quot;</span>; }

  <span class="hljs-keyword">static</span> create(pos) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Player(pos.plus(<span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, <span class="hljs-number">-0.5</span>)),
                      <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>));
  }
}

Player.prototype.size = <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0.8</span>, <span class="hljs-number">1.5</span>);
</code></pre>
<p>&#x56E0;&#x4E3A;&#x73A9;&#x5BB6;&#x9AD8;&#x5EA6;&#x662F;&#x4E00;&#x4E2A;&#x534A;&#x683C;&#x5B50;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x521D;&#x59CB;&#x4F4D;&#x7F6E;&#x76F8;&#x6BD4;&#x4E8E;<code>@</code>&#x5B57;&#x7B26;&#x51FA;&#x73B0;&#x7684;&#x4F4D;&#x7F6E;&#x8981;&#x9AD8;&#x51FA;&#x534A;&#x4E2A;&#x683C;&#x5B50;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x73A9;&#x5BB6;&#x89D2;&#x8272;&#x7684;&#x5E95;&#x90E8;&#x5C31;&#x53EF;&#x4EE5;&#x548C;&#x5176;&#x51FA;&#x73B0;&#x7684;&#x65B9;&#x683C;&#x5E95;&#x90E8;&#x5BF9;&#x9F50;&#x3002;</p>
<p><code>size</code>&#x5C5E;&#x6027;&#x5BF9;&#x4E8E;<code>Player</code>&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5728;&#x539F;&#x578B;&#x4E0A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x4F8B;&#x672C;&#x8EAB;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;<code>type</code>&#x7684;&#x8BFB;&#x53D6;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x7684;<code>Vec</code>&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x6D6A;&#x8D39;&#x7684;&#x3002;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x4E0D;&#x5FC5;&#x5728;&#x6BCF;&#x6B21;&#x6C42;&#x503C;&#x65F6;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x3002;&#xFF09;</p>
<p>&#x6784;&#x9020;<code>Lava</code>&#x89D2;&#x8272;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6839;&#x636E;&#x5B83;&#x6240;&#x57FA;&#x4E8E;&#x7684;&#x5B57;&#x7B26;&#x6765;&#x521D;&#x59CB;&#x5316;&#x5BF9;&#x8C61;&#x3002;&#x52A8;&#x6001;&#x5CA9;&#x6D46;&#x4EE5;&#x5176;&#x5F53;&#x524D;&#x901F;&#x5EA6;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x78B0;&#x5230;&#x969C;&#x788D;&#x7269;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x62E5;&#x6709;<code>reset</code>&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x4F1A;&#x8DF3;&#x56DE;&#x5230;&#x5B83;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#xFF08;&#x6EF4;&#x843D;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5B83;&#x4F1A;&#x53CD;&#x8F6C;&#x5B83;&#x7684;&#x901F;&#x5EA6;&#x5E76;&#x4EE5;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x7EE7;&#x7EED;&#xFF08;&#x5F39;&#x8DF3;&#xFF09;&#x3002;</p>
<p><code>create</code>&#x65B9;&#x6CD5;&#x67E5;&#x770B;<code>Level</code>&#x6784;&#x9020;&#x5668;&#x4F20;&#x9012;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x9002;&#x5F53;&#x7684;&#x5CA9;&#x6D46;&#x89D2;&#x8272;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Lava</span> </span>{
  <span class="hljs-keyword">constructor</span>(pos, speed, reset) {
    <span class="hljs-keyword">this</span>.pos = pos;
    <span class="hljs-keyword">this</span>.speed = speed;
    <span class="hljs-keyword">this</span>.reset = reset;
  }

  get type() { <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;lava&quot;</span>; }

  <span class="hljs-keyword">static</span> create(pos, ch) {
    <span class="hljs-keyword">if</span> (ch == <span class="hljs-string">&quot;=&quot;</span>) {
      <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Lava(pos, <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">2</span>, <span class="hljs-number">0</span>));
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (ch == <span class="hljs-string">&quot;|&quot;</span>) {
      <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Lava(pos, <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, <span class="hljs-number">2</span>));
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (ch == <span class="hljs-string">&quot;v&quot;</span>) {
      <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Lava(pos, <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>), pos);
    }
  }
}

Lava.prototype.size = <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">1</span>, <span class="hljs-number">1</span>);
</code></pre>
<p><code>Coin</code>&#x5BF9;&#x8C61;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x5927;&#x591A;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x5F85;&#x5728;&#x539F;&#x5730;&#x5373;&#x53EF;&#x3002;&#x4F46;&#x4E3A;&#x4E86;&#x4F7F;&#x6E38;&#x620F;&#x66F4;&#x52A0;&#x6709;&#x8DA3;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x786C;&#x5E01;&#x8F7B;&#x5FAE;&#x6447;&#x6643;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F1A;&#x5728;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x5C0F;&#x5E45;&#x5EA6;&#x6765;&#x56DE;&#x79FB;&#x52A8;&#x3002;&#x6BCF;&#x4E2A;&#x786C;&#x5E01;&#x5BF9;&#x8C61;&#x90FD;&#x5B58;&#x50A8;&#x4E86;&#x5176;&#x57FA;&#x672C;&#x4F4D;&#x7F6E;&#xFF0C;&#x540C;&#x65F6;&#x4F7F;&#x7528;<code>wobble</code>&#x5C5E;&#x6027;&#x8DDF;&#x8E2A;&#x56FE;&#x50CF;&#x8DF3;&#x52A8;&#x5E45;&#x5EA6;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x540C;&#x65F6;&#x51B3;&#x5B9A;&#x4E86;&#x786C;&#x5E01;&#x7684;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#xFF08;&#x5B58;&#x50A8;&#x5728;<code>pos</code>&#x5C5E;&#x6027;&#x4E2D;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Coin</span> </span>{
  <span class="hljs-keyword">constructor</span>(pos, basePos, wobble) {
    <span class="hljs-keyword">this</span>.pos = pos;
    <span class="hljs-keyword">this</span>.basePos = basePos;
    <span class="hljs-keyword">this</span>.wobble = wobble;
  }

  get type() { <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;coin&quot;</span>; }

  <span class="hljs-keyword">static</span> create(pos) {
    <span class="hljs-keyword">let</span> basePos = pos.plus(<span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0.2</span>, <span class="hljs-number">0.1</span>));
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Coin(basePos, basePos,
                    <span class="hljs-built_in">Math</span>.random() * <span class="hljs-built_in">Math</span>.PI * <span class="hljs-number">2</span>);
  }
}

Coin.prototype.size = <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0.6</span>, <span class="hljs-number">0.6</span>);
</code></pre>
<p>&#x7B2C;&#x5341;&#x56DB;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;<code>Math.sin</code>&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x5706;&#x7684;<code>y</code>&#x5750;&#x6807;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6CBF;&#x7740;&#x5706;&#x79FB;&#x52A8;&#xFF0C;&#x56E0;&#x6B64;<code>y</code>&#x5750;&#x6807;&#x4F1A;&#x4EE5;&#x5E73;&#x6ED1;&#x7684;&#x6CE2;&#x6D6A;&#x5F62;&#x5F0F;&#x6765;&#x56DE;&#x79FB;&#x52A8;&#xFF0C;&#x6B63;&#x5F26;&#x51FD;&#x6570;&#x5728;&#x5B9E;&#x73B0;&#x6CE2;&#x6D6A;&#x5F62;&#x79FB;&#x52A8;&#x4E2D;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x6240;&#x6709;&#x786C;&#x5E01;&#x540C;&#x65F6;&#x4E0A;&#x4E0B;&#x79FB;&#x52A8;&#xFF0C;&#x6BCF;&#x4E2A;&#x786C;&#x5E01;&#x7684;&#x521D;&#x59CB;&#x9636;&#x6BB5;&#x90FD;&#x662F;&#x968F;&#x673A;&#x7684;&#x3002;&#x7531;<code>Math.sin</code>&#x4EA7;&#x751F;&#x7684;&#x6CE2;&#x957F;&#x662F;<code>2&#x3C0;</code>&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;<code>Math.random</code>&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E58;&#x4EE5;<code>2&#x3C0;</code>&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x786C;&#x5E01;&#x6CE2;&#x5F62;&#x8F68;&#x8FF9;&#x7684;&#x521D;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;<code>levelChars</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5C06;&#x5E73;&#x9762;&#x56FE;&#x5B57;&#x7B26;&#x6620;&#x5C04;&#x4E3A;&#x80CC;&#x666F;&#x7F51;&#x683C;&#x7C7B;&#x578B;&#xFF0C;&#x6216;&#x89D2;&#x8272;&#x7C7B;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> levelChars = {
  <span class="hljs-string">&quot;.&quot;</span>: <span class="hljs-string">&quot;empty&quot;</span>, <span class="hljs-string">&quot;#&quot;</span>: <span class="hljs-string">&quot;wall&quot;</span>, <span class="hljs-string">&quot;+&quot;</span>: <span class="hljs-string">&quot;lava&quot;</span>,
  <span class="hljs-string">&quot;@&quot;</span>: Player, <span class="hljs-string">&quot;o&quot;</span>: Coin,
  <span class="hljs-string">&quot;=&quot;</span>: Lava, <span class="hljs-string">&quot;|&quot;</span>: Lava, <span class="hljs-string">&quot;v&quot;</span>: Lava
};
</code></pre>
<p>&#x8FD9;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x521B;&#x5EFA;<code>Level</code>&#x5B9E;&#x4F8B;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x90E8;&#x4EF6;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> simpleLevel = <span class="hljs-keyword">new</span> Level(simpleLevelPlan);
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">`<span class="hljs-subst">${simpleLevel.width}</span> by <span class="hljs-subst">${simpleLevel.height}</span>`</span>);
<span class="hljs-comment">// &#x2192; 22 by 9</span>
</code></pre>
<p>&#x4E0A;&#x9762;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x5C06;&#x7279;&#x5B9A;&#x5173;&#x5361;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#xFF0C;&#x5E76;&#x6784;&#x5EFA;&#x5173;&#x5361;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x52A8;&#x4F5C;&#x3002;</p>
<h2 id="&#x6210;&#x4E3A;&#x8D1F;&#x62C5;&#x7684;&#x5C01;&#x88C5;">&#x6210;&#x4E3A;&#x8D1F;&#x62C5;&#x7684;&#x5C01;&#x88C5;</h2>
<p>&#x672C;&#x7AE0;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x4EE3;&#x7801;&#x5E76;&#x6CA1;&#x6709;&#x8FC7;&#x591A;&#x8003;&#x8651;&#x5C01;&#x88C5;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5C01;&#x88C5;&#x9700;&#x8981;&#x8017;&#x8D39;&#x989D;&#x5916;&#x7CBE;&#x529B;&#x3002;&#x5C01;&#x88C5;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5E9E;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x5F15;&#x5165;&#x989D;&#x5916;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x63A5;&#x53E3;&#x3002;&#x6211;&#x5C3D;&#x91CF;&#x5C06;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x79EF;&#x63A7;&#x5236;&#x5728;&#x8F83;&#x5C0F;&#x7684;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF0C;&#x907F;&#x514D;&#x8BFB;&#x8005;&#x56E0;&#x4E3A;&#x4EE3;&#x7801;&#x8FC7;&#x4E8E;&#x5E9E;&#x5927;&#x800C;&#x8D70;&#x795E;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x5927;&#x91CF;&#x5143;&#x7D20;&#x662F;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x884C;&#x4E3A;&#x6539;&#x53D8;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5143;&#x7D20;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6839;&#x636E;&#x6E38;&#x620F;&#x7684;&#x5DE5;&#x4F5C;&#x7EC6;&#x8282;&#x6765;&#x4E3A;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x8BBE;&#x8BA1;&#x5927;&#x91CF;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x63A5;&#x53E3;&#x7684;&#x6548;&#x679C;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x3002;&#x6BCF;&#x5F53;&#x4F60;&#x6539;&#x53D8;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x90E8;&#x5206;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x63A5;&#x53E3;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#x65B0;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x8FD9;&#x4E00;&#x4FEE;&#x6539;&#x662F;&#x5426;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5206;&#x5272;&#x70B9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E25;&#x683C;&#x7684;&#x63A5;&#x53E3;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5408;&#x7406;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x4F46;&#x67D0;&#x4E9B;&#x5206;&#x5272;&#x70B9;&#x5219;&#x4E0D;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5C1D;&#x8BD5;&#x53BB;&#x5C01;&#x88C5;&#x67D0;&#x4E9B;&#x672C;&#x6CA1;&#x6709;&#x5408;&#x7406;&#x8FB9;&#x754C;&#x7684;&#x4EE3;&#x7801;&#x5FC5;&#x7136;&#x4F1A;&#x5BFC;&#x81F4;&#x6D6A;&#x8D39;&#x5927;&#x91CF;&#x7CBE;&#x529B;&#x3002;&#x5F53;&#x4F60;&#x72AF;&#x4E0B;&#x8FD9;&#x79CD;&#x5927;&#x9519;&#x4E4B;&#x9645;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x4F60;&#x7684;&#x63A5;&#x53E3;&#x53D8;&#x5F97;&#x5E9E;&#x5927;&#x81C3;&#x80BF;&#xFF0C;&#x800C;&#x4E14;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x4E0D;&#x65AD;&#x6F14;&#x5316;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x9891;&#x7E41;&#x4FEE;&#x6539;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x5C01;&#x88C5;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x662F;&#x7ED8;&#x56FE;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x5176;&#x539F;&#x56E0;&#x662F;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x5C55;&#x793A;&#x76F8;&#x540C;&#x7684;&#x6E38;&#x620F;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x7ED8;&#x56FE;&#x4EE3;&#x7801;&#x9690;&#x85CF;&#x5728;&#x63A5;&#x53E3;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6E38;&#x620F;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x63D2;&#x5165;&#x65B0;&#x7684;&#x663E;&#x793A;&#x6A21;&#x5757;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x7ED8;&#x56FE;">&#x7ED8;&#x56FE;</h2>
<p>&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x201C;&#x663E;&#x793A;&#x5668;&#x201D;&#x5BF9;&#x8C61;&#x6765;&#x5C01;&#x88C5;&#x7ED8;&#x56FE;&#x4EE3;&#x7801;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x663E;&#x793A;&#x6307;&#x5B9A;&#x5173;&#x5361;&#xFF0C;&#x4EE5;&#x53CA;&#x72B6;&#x6001;&#x3002;&#x672C;&#x7AE0;&#x5B9A;&#x4E49;&#x7684;&#x663E;&#x793A;&#x5668;&#x7C7B;&#x578B;&#x540D;&#x4E3A;<code>DOMDisplay</code>&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x7C7B;&#x578B;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684; DOM &#x5143;&#x7D20;&#x6765;&#x663E;&#x793A;&#x5173;&#x5361;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x6837;&#x5F0F;&#x8868;&#x6765;&#x8BBE;&#x5B9A;&#x5B9E;&#x9645;&#x7684;&#x989C;&#x8272;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x6784;&#x5EFA;&#x6E38;&#x620F;&#x4E2D;&#x6240;&#x9700;&#x7684;&#x56FA;&#x5B9A;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5BF9;&#x5143;&#x7D20;&#x7684;<code>style</code>&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#xFF0C;&#x4F46;&#x8FD9;&#x4F1A;&#x4F7F;&#x5F97;&#x6E38;&#x620F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x5197;&#x957F;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7B80;&#x6D01;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x521B;&#x5EFA;&#x5143;&#x7D20;&#x5E76;&#x8D4B;&#x4E88;&#x5B83;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x548C;&#x5B50;&#x8282;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">elt</span>(<span class="hljs-params">name, attrs, ...children</span>) </span>{
  <span class="hljs-keyword">let</span> dom = <span class="hljs-built_in">document</span>.createElement(name);
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> attr <span class="hljs-keyword">of</span> <span class="hljs-built_in">Object</span>.keys(attrs)) {
    dom.setAttribute(attr, attrs[attr]);
  }
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> child <span class="hljs-keyword">of</span> children) {
    dom.appendChild(child);
  }
  <span class="hljs-keyword">return</span> dom;
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x663E;&#x793A;&#x5668;&#x5BF9;&#x8C61;&#x65F6;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x5176;&#x7236;&#x5143;&#x7D20;&#xFF0C;&#x663E;&#x793A;&#x5668;&#x5C06;&#x4F1A;&#x521B;&#x5EFA;&#x5728;&#x8BE5;&#x7236;&#x5143;&#x7D20;&#x4E0A;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x9700;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5173;&#x5361;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code class="lang-js">class DOMDisplay {
  constructor(parent, level) {
    this.dom = elt(&quot;div&quot;, {class: &quot;game&quot;}, drawGrid(level));
    this.actorLayer = null;
    parent.appendChild(this.dom);
  }

  clear() { this.dom.remove(); }
}
</code></pre>
<p>&#x7531;&#x4E8E;&#x5173;&#x5361;&#x7684;&#x80CC;&#x666F;&#x7F51;&#x683C;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x9700;&#x8981;&#x7ED8;&#x5236;&#x4E00;&#x6B21;&#x5373;&#x53EF;&#x3002;&#x89D2;&#x8272;&#x5219;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x6B21;&#x5237;&#x65B0;&#x663E;&#x793A;&#x65F6;&#x8FDB;&#x884C;&#x91CD;&#x7ED8;&#x3002;<code>drawFame</code>&#x9700;&#x8981;&#x4F7F;&#x7528;<code>actorLayer</code>&#x5C5E;&#x6027;&#x6765;&#x8DDF;&#x8E2A;&#x5DF2;&#x4FDD;&#x5B58;&#x89D2;&#x8272;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x79FB;&#x9664;&#x6216;&#x66FF;&#x6362;&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5750;&#x6807;&#x548C;&#x5C3A;&#x5BF8;&#x4EE5;&#x7F51;&#x683C;&#x5355;&#x5143;&#x4E3A;&#x5355;&#x4F4D;&#x8DDF;&#x8E2A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5C3A;&#x5BF8;&#x6216;&#x8DDD;&#x79BB;&#x4E2D;&#x7684; 1 &#x5355;&#x5143;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x683C;&#x3002;&#x5728;&#x8BBE;&#x7F6E;&#x50CF;&#x7D20;&#x7EA7;&#x5C3A;&#x5BF8;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5750;&#x6807;&#x6309;&#x6BD4;&#x4F8B;&#x653E;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x53EA;&#x5360;&#x636E;&#x4E00;&#x4E2A;&#x65B9;&#x683C;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x90A3;&#x5C06;&#x662F;&#x591A;&#x4E48;&#x53EF;&#x7B11;&#x3002;&#x800C;<code>scale</code>&#x7ED1;&#x5B9A;&#x4F1A;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x683C;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x5B9E;&#x9645;&#x5360;&#x636E;&#x7684;&#x50CF;&#x7D20;&#x6570;&#x76EE;&#x3002;</p>
<pre><code class="lang-js">const scale = 20;

function drawGrid(level) {
  return elt(&quot;table&quot;, {
    class: &quot;background&quot;,
    style: `width: ${level.width * scale}px`
  }, ...level.rows.map(row =&gt;
    elt(&quot;tr&quot;, {style: `height: ${scale}px`},
        ...row.map(type =&gt; elt(&quot;td&quot;, {class: type})))
  ));
}
</code></pre>
<p>&#x524D;&#x6587;&#x63D0;&#x53CA;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>&lt;table&gt;</code>&#x5143;&#x7D20;&#x6765;&#x7ED8;&#x5236;&#x80CC;&#x666F;&#x3002;&#x8FD9;&#x975E;&#x5E38;&#x7B26;&#x5408;&#x5173;&#x5361;&#x4E2D;<code>grid</code>&#x5C5E;&#x6027;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x5BF9;&#x5E94;&#x8868;&#x683C;&#x4E2D;&#x7684;&#x4E00;&#x884C;&#xFF08;<code>&lt;tr&gt;</code>&#x5143;&#x7D20;&#xFF09;&#x3002;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5BF9;&#x5E94;&#x8868;&#x683C;&#x5355;&#x5143;&#x683C;&#xFF08;<code>&lt;td&gt;</code>&#xFF09;&#x5143;&#x7D20;&#x7684;&#x7C7B;&#x578B;&#x540D;&#x3002;&#x6269;&#x5C55;&#xFF08;&#x4E09;&#x70B9;&#xFF09;&#x8FD0;&#x7B97;&#x7B26;&#x7528;&#x4E8E;&#x5C06;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x7EC4;&#x4F5C;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x53C2;&#x6570;&#x4F20;&#x7ED9;<code>elt</code>&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684; CSS &#x4F7F;&#x8868;&#x683C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x80CC;&#x666F;&#xFF1A;</p>
<pre><code class="lang-css"><span class="hljs-selector-class">.background</span>    { <span class="hljs-attribute">background</span>: <span class="hljs-built_in">rgb</span>(52, 166, 251);
                 <span class="hljs-attribute">table-layout</span>: fixed;
                 <span class="hljs-attribute">border-spacing</span>: <span class="hljs-number">0</span>;              }
<span class="hljs-selector-class">.background</span> <span class="hljs-selector-tag">td</span> { <span class="hljs-attribute">padding</span>: <span class="hljs-number">0</span>;                     }
<span class="hljs-selector-class">.lava</span>          { <span class="hljs-attribute">background</span>: <span class="hljs-built_in">rgb</span>(255, 100, 100); }
<span class="hljs-selector-class">.wall</span>          { <span class="hljs-attribute">background</span>: white;              }
</code></pre>
<p>&#x5176;&#x4E2D;&#x67D0;&#x4E9B;&#x5C5E;&#x6027;&#xFF08;border-spacing&#x548C;padding&#xFF09;&#x7528;&#x4E8E;&#x53D6;&#x6D88;&#x4E00;&#x4E9B;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x4FDD;&#x7559;&#x7684;&#x8868;&#x683C;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x5728;&#x5355;&#x5143;&#x683C;&#x4E4B;&#x95F4;&#x6216;&#x5355;&#x5143;&#x683C;&#x5185;&#x90E8;&#x586B;&#x5145;&#x591A;&#x4F59;&#x7684;&#x7A7A;&#x767D;&#x3002;</p>
<p>&#x5176;&#x4E2D;<code>background</code>&#x89C4;&#x5219;&#x7528;&#x4E8E;&#x8BBE;&#x7F6E;&#x80CC;&#x666F;&#x989C;&#x8272;&#x3002;CSS&#x4E2D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x6307;&#x5B9A;&#x989C;&#x8272;&#xFF0C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5355;&#x8BCD;&#xFF08;<code>white</code>&#xFF09;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5F62;&#x5982;<code>rgb(R,G,B)</code>&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;<code>R</code>&#x8868;&#x793A;&#x989C;&#x8272;&#x4E2D;&#x7684;&#x7EA2;&#x8272;&#x6210;&#x5206;&#xFF0C;<code>G</code>&#x8868;&#x793A;&#x7EFF;&#x8272;&#x6210;&#x5206;&#xFF0C;<code>B</code>&#x8868;&#x793A;&#x84DD;&#x8272;&#x6210;&#x5206;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x8303;&#x56F4;&#x5747;&#x4E3A; 0 &#x5230; 255&#x3002;&#x56E0;&#x6B64;&#x5728;<code>rgb(52,166,251)</code>&#x4E2D;&#xFF0C;&#x7EA2;&#x8272;&#x6210;&#x5206;&#x4E3A; 52&#xFF0C;&#x7EFF;&#x8272;&#x4E3A; 166&#xFF0C;&#x800C;&#x84DD;&#x8272;&#x662F; 251&#x3002;&#x7531;&#x4E8E;&#x84DD;&#x8272;&#x6210;&#x5206;&#x6570;&#x503C;&#x6700;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x540E;&#x7684;&#x989C;&#x8272;&#x4F1A;&#x504F;&#x5411;&#x84DD;&#x8272;&#x3002;&#x800C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;<code>.lava</code>&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF08;&#x7EA2;&#x8272;&#xFF09;&#x662F;&#x6700;&#x5927;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7ED8;&#x5236;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x65F6;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5176;&#x5BF9;&#x5E94;&#x7684; DOM &#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x89D2;&#x8272;&#x5C5E;&#x6027;&#x6765;&#x8BBE;&#x7F6E;&#x5143;&#x7D20;&#x5750;&#x6807;&#x4E0E;&#x5C3A;&#x5BF8;&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x90FD;&#x9700;&#x8981;&#x4E0E;<code>scale</code>&#x76F8;&#x4E58;&#xFF0C;&#x4EE5;&#x5C06;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x5C3A;&#x5BF8;&#x5355;&#x4F4D;&#x8F6C;&#x6362;&#x4E3A;&#x50CF;&#x7D20;&#x3002;</p>
<pre><code class="lang-js">function drawActors(actors) {
  return elt(&quot;div&quot;, {}, ...actors.map(actor =&gt; {
    let rect = elt(&quot;div&quot;, {class: `actor ${actor.type}`});
    rect.style.width = `${actor.size.x * scale}px`;
    rect.style.height = `${actor.size.y * scale}px`;
    rect.style.left = `${actor.pos.x * scale}px`;
    rect.style.top = `${actor.pos.y * scale}px`;
    return rect;
  }));
}
</code></pre>
<p>&#x4E3A;&#x4E86;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x591A;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#x6765;&#x5206;&#x9694;&#x7C7B;&#x540D;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x5C55;&#x793A;&#x7684; CSS &#x4EE3;&#x7801;&#x4E2D;&#xFF0C;<code>actor</code>&#x7C7B;&#x4F1A;&#x8D4B;&#x4E88;&#x89D2;&#x8272;&#x4E00;&#x4E2A;&#x7EDD;&#x5BF9;&#x5750;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x89D2;&#x8272;&#x7684;&#x7C7B;&#x578B;&#x540D;&#x79F0;&#x4F5C;&#x4E3A;&#x989D;&#x5916;&#x7684; CSS &#x7C7B;&#x6765;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x7684;&#x989C;&#x8272;&#x3002;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x518D;&#x6B21;&#x5B9A;&#x4E49;<code>lava</code>&#x7C7B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x590D;&#x7528;&#x524D;&#x6587;&#x4E3A;&#x5CA9;&#x6D46;&#x5355;&#x5143;&#x683C;&#x5B9A;&#x4E49;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
<pre><code class="lang-css"><span class="hljs-selector-class">.actor</span>  { <span class="hljs-attribute">position</span>: absolute;            }
<span class="hljs-selector-class">.coin</span>   { <span class="hljs-attribute">background</span>: <span class="hljs-built_in">rgb</span>(241, 229, 89); }
<span class="hljs-selector-class">.player</span> { <span class="hljs-attribute">background</span>: <span class="hljs-built_in">rgb</span>(64, 64, 64);   }
</code></pre>
<p><code>setState</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x4F7F;&#x663E;&#x793A;&#x5668;&#x663E;&#x793A;&#x7ED9;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5B83;&#x9996;&#x5148;&#x5220;&#x9664;&#x65E7;&#x89D2;&#x8272;&#x7684;&#x56FE;&#x5F62;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x65B0;&#x4F4D;&#x7F6E;&#x4E0A;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x89D2;&#x8272;&#x3002;&#x8BD5;&#x56FE;&#x5C06; DOM &#x5143;&#x7D20;&#x91CD;&#x7528;&#x4E8E;&#x89D2;&#x8272;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x5438;&#x5F15;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x4F7F;&#x5B83;&#x6709;&#x6548;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x9644;&#x52A0;&#x8BB0;&#x5F55;&#xFF0C;&#x6765;&#x5173;&#x8054;&#x89D2;&#x8272;&#x548C; DOM &#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5728;&#x89D2;&#x8272;&#x6D88;&#x5931;&#x65F6;&#x5220;&#x9664;&#x5143;&#x7D20;&#x3002;&#x56E0;&#x4E3A;&#x6E38;&#x620F;&#x4E2D;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x89D2;&#x8272;&#xFF0C;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x5B83;&#x4EEC;&#x5F00;&#x9500;&#x5E76;&#x4E0D;&#x5927;&#x3002;</p>
<pre><code class="lang-js">DOMDisplay.prototype.setState = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">state</span>) </span>{
  <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.actorLayer) <span class="hljs-keyword">this</span>.actorLayer.remove();
  <span class="hljs-keyword">this</span>.actorLayer = drawActors(state.actors);
  <span class="hljs-keyword">this</span>.dom.appendChild(<span class="hljs-keyword">this</span>.actorLayer);
  <span class="hljs-keyword">this</span>.dom.className = <span class="hljs-string">`game <span class="hljs-subst">${state.status}</span>`</span>;
  <span class="hljs-keyword">this</span>.scrollPlayerIntoView(state);
};
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5173;&#x5361;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x4F5C;&#x4E3A;&#x7C7B;&#x540D;&#x6DFB;&#x52A0;&#x5230;&#x5305;&#x88C5;&#x5668;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6E38;&#x620F;&#x80DC;&#x8D1F;&#x4E0E;&#x5426;&#x6765;&#x6539;&#x53D8;&#x73A9;&#x5BB6;&#x89D2;&#x8272;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x6DFB;&#x52A0; CSS &#x89C4;&#x5219;&#xFF0C;&#x6307;&#x5B9A;&#x7956;&#x5148;&#x8282;&#x70B9;&#x5305;&#x542B;&#x7279;&#x5B9A;&#x7C7B;&#x7684;<code>player</code>&#x5143;&#x7D20;&#x7684;&#x6837;&#x5F0F;&#x5373;&#x53EF;&#x3002;</p>
<pre><code class="lang-css"><span class="hljs-selector-class">.lost</span> <span class="hljs-selector-class">.player</span> {
  <span class="hljs-attribute">background</span>: <span class="hljs-built_in">rgb</span>(160, 64, 64);
}
<span class="hljs-selector-class">.won</span> <span class="hljs-selector-class">.player</span> {
  <span class="hljs-attribute">box-shadow</span>: -<span class="hljs-number">4px</span> -<span class="hljs-number">7px</span> <span class="hljs-number">8px</span> white, <span class="hljs-number">4px</span> -<span class="hljs-number">7px</span> <span class="hljs-number">8px</span> white;
}
</code></pre>
<p>&#x5728;&#x9047;&#x5230;&#x5CA9;&#x6D46;&#x4E4B;&#x540E;&#xFF0C;&#x73A9;&#x5BB6;&#x7684;&#x989C;&#x8272;&#x5E94;&#x8BE5;&#x53D8;&#x6210;&#x6DF1;&#x7EA2;&#x8272;&#xFF0C;&#x6697;&#x793A;&#x7740;&#x89D2;&#x8272;&#x88AB;&#x70E7;&#x7126;&#x4E86;&#x3002;&#x5F53;&#x73A9;&#x5BB6;&#x6536;&#x96C6;&#x5B8C;&#x6700;&#x540E;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E24;&#x4E2A;&#x6A21;&#x7CCA;&#x7684;&#x767D;&#x8272;&#x9634;&#x5F71;&#x6765;&#x521B;&#x5EFA;&#x767D;&#x8272;&#x7684;&#x5149;&#x73AF;&#x6548;&#x679C;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;&#x4E00;&#x4E2A;&#x5728;&#x53F3;&#x4E0A;&#x89D2;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5047;&#x5B9A;&#x5173;&#x5361;&#x603B;&#x662F;&#x7B26;&#x5408;&#x89C6;&#x53E3;&#x5C3A;&#x5BF8;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5176;&#x4E2D;&#x7ED8;&#x5236;&#x6E38;&#x620F;&#x7684;&#x5143;&#x7D20;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8C03;&#x7528;<code>scrollPlayerIntoView</code>&#x6765;&#x786E;&#x4FDD;&#x5982;&#x679C;&#x5173;&#x5361;&#x5728;&#x89C6;&#x53E3;&#x8303;&#x56F4;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6EDA;&#x52A8;&#x89C6;&#x53E3;&#xFF0C;&#x786E;&#x4FDD;&#x73A9;&#x5BB6;&#x9760;&#x8FD1;&#x89C6;&#x53E3;&#x7684;&#x4E2D;&#x592E;&#x4F4D;&#x7F6E;&#x3002;&#x4E0B;&#x9762;&#x7684; CSS &#x6837;&#x5F0F;&#x4E3A;&#x5305;&#x88C5;&#x5668;&#x7684;DOM&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x5C3A;&#x5BF8;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4EFB;&#x4F55;&#x8D85;&#x51FA;&#x89C6;&#x53E3;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5916;&#x90E8;&#x5143;&#x7D20;&#x7684;<code>position</code>&#x8BBE;&#x7F6E;&#x4E3A;<code>relative</code>&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x5143;&#x7D20;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x603B;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x5173;&#x5361;&#x7684;&#x5DE6;&#x4E0A;&#x89D2;&#x8FDB;&#x884C;&#x5B9A;&#x4F4D;&#x3002;</p>
<pre><code class="lang-css"><span class="hljs-selector-class">.game</span> {
  <span class="hljs-attribute">overflow</span>: hidden;
  <span class="hljs-attribute">max-width</span>: <span class="hljs-number">600px</span>;
  <span class="hljs-attribute">max-height</span>: <span class="hljs-number">450px</span>;
  <span class="hljs-attribute">position</span>: relative;
}
</code></pre>
<p>&#x5728;<code>scrollPlayerIntoView</code>&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x627E;&#x51FA;&#x73A9;&#x5BB6;&#x7684;&#x4F4D;&#x7F6E;&#x5E76;&#x66F4;&#x65B0;&#x5176;&#x5305;&#x88C5;&#x5668;&#x5143;&#x7D20;&#x7684;&#x6EDA;&#x52A8;&#x5750;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x5143;&#x7D20;&#x7684;<code>scrollLeft</code>&#x548C;<code>scrollTop</code>&#x5C5E;&#x6027;&#xFF0C;&#x5F53;&#x73A9;&#x5BB6;&#x63A5;&#x8FD1;&#x89C6;&#x53E3;&#x8FB9;&#x754C;&#x65F6;&#x4FEE;&#x6539;&#x6EDA;&#x52A8;&#x5750;&#x6807;&#x3002;</p>
<pre><code class="lang-js">DOMDisplay.prototype.scrollPlayerIntoView = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">state</span>) </span>{
  <span class="hljs-keyword">let</span> width = <span class="hljs-keyword">this</span>.dom.clientWidth;
  <span class="hljs-keyword">let</span> height = <span class="hljs-keyword">this</span>.dom.clientHeight;
  <span class="hljs-keyword">let</span> margin = width / <span class="hljs-number">3</span>;

  <span class="hljs-comment">// The viewport</span>
  <span class="hljs-keyword">let</span> left = <span class="hljs-keyword">this</span>.dom.scrollLeft, right = left + width;
  <span class="hljs-keyword">let</span> top = <span class="hljs-keyword">this</span>.dom.scrollTop, bottom = top + height;

  <span class="hljs-keyword">let</span> player = state.player;
  <span class="hljs-keyword">let</span> center = player.pos.plus(player.size.times(<span class="hljs-number">0.5</span>))
                         .times(scale);

  <span class="hljs-keyword">if</span> (center.x &lt; left + margin) {
    <span class="hljs-keyword">this</span>.dom.scrollLeft = center.x - margin;
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (center.x &gt; right - margin) {
    <span class="hljs-keyword">this</span>.dom.scrollLeft = center.x + margin - width;
  }
  <span class="hljs-keyword">if</span> (center.y &lt; top + margin) {
    <span class="hljs-keyword">this</span>.dom.scrollTop = center.y - margin;
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (center.y &gt; bottom - margin) {
    <span class="hljs-keyword">this</span>.dom.scrollTop = center.y + margin - height;
  }
};
</code></pre>
<p>&#x627E;&#x51FA;&#x73A9;&#x5BB6;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x7684;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x4F7F;&#x7528;<code>Vec</code>&#x7C7B;&#x578B;&#x6765;&#x5199;&#x51FA;&#x76F8;&#x5BF9;&#x53EF;&#x8BFB;&#x7684;&#x8BA1;&#x7B97;&#x4EE3;&#x7801;&#x3002;&#x4E3A;&#x4E86;&#x627E;&#x51FA;&#x73A9;&#x5BB6;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5DE6;&#x4E0A;&#x89D2;&#x4F4D;&#x7F6E;&#x5750;&#x6807;&#x52A0;&#x4E0A;&#x5176;&#x5C3A;&#x5BF8;&#x7684;&#x4E00;&#x534A;&#x3002;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x5173;&#x5361;&#x5750;&#x6807;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x7ED3;&#x679C;&#x5411;&#x91CF;&#x4E58;&#x4EE5;&#x663E;&#x793A;&#x6BD4;&#x4F8B;&#xFF0C;&#x4EE5;&#x5C06;&#x5750;&#x6807;&#x8F6C;&#x6362;&#x6210;&#x50CF;&#x7D20;&#x7EA7;&#x5750;&#x6807;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x73A9;&#x5BB6;&#x7684;&#x5750;&#x6807;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x68C0;&#x6D4B;&#xFF0C;&#x786E;&#x4FDD;&#x5176;&#x4F4D;&#x7F6E;&#x4E0D;&#x4F1A;&#x8D85;&#x51FA;&#x5408;&#x6CD5;&#x8303;&#x56F4;&#x3002;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6709;&#x65F6;&#x5019;&#x4F9D;&#x7136;&#x4F1A;&#x8BBE;&#x7F6E;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x6EDA;&#x52A8;&#x5750;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x5C0F;&#x4E8E; 0 &#x7684;&#x503C;&#x6216;&#x8D85;&#x51FA;&#x5143;&#x7D20;&#x6EDA;&#x52A8;&#x533A;&#x57DF;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#x3002;DOM &#x4F1A;&#x5C06;&#x5176;&#x4FEE;&#x6539;&#x4E3A;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;<code>scrollLeft</code>&#x8BBE;&#x7F6E;&#x4E3A;<code>&#x2013;10</code>&#xFF0C;DOM &#x4F1A;&#x5C06;&#x5176;&#x4FEE;&#x6539;&#x4E3A; 0&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x6BCF;&#x6B21;&#x91CD;&#x7ED8;&#x65F6;&#x90FD;&#x6EDA;&#x52A8;&#x89C6;&#x53E3;&#xFF0C;&#x786E;&#x4FDD;&#x73A9;&#x5BB6;&#x603B;&#x662F;&#x5728;&#x89C6;&#x53E3;&#x4E2D;&#x592E;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4F1A;&#x5BFC;&#x81F4;&#x753B;&#x9762;&#x5267;&#x70C8;&#x6643;&#x52A8;&#xFF0C;&#x5F53;&#x4F60;&#x8DF3;&#x8DC3;&#x65F6;&#xFF0C;&#x89C6;&#x56FE;&#x4F1A;&#x4E0D;&#x65AD;&#x4E0A;&#x4E0B;&#x79FB;&#x52A8;&#x3002;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x5728;&#x5C4F;&#x5E55;&#x4E2D;&#x592E;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x201C;&#x4E2D;&#x592E;&#x533A;&#x57DF;&#x201D;&#xFF0C;&#x73A9;&#x5BB6;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x90E8;&#x79FB;&#x52A8;&#x65F6;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x6EDA;&#x52A8;&#x89C6;&#x53E3;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x80FD;&#x591F;&#x663E;&#x793A;&#x5C0F;&#x578B;&#x5173;&#x5361;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">link</span> <span class="hljs-attr">rel</span>=<span class="hljs-string">&quot;stylesheet&quot;</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;css/game.css&quot;</span>&gt;</span>

<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-keyword">let</span> simpleLevel = <span class="hljs-keyword">new</span> Level(simpleLevelPlan);
  <span class="hljs-keyword">let</span> display = <span class="hljs-keyword">new</span> DOMDisplay(<span class="hljs-built_in">document</span>.body, simpleLevel);
  display.setState(State.start(simpleLevel));
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;<code>link</code>&#x6807;&#x7B7E;&#x4E2D;&#x4F7F;&#x7528;<code>rel=&quot;stylesheet&quot;</code>&#xFF0C;&#x5C06;&#x4E00;&#x4E2A; CSS &#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x5230;&#x9875;&#x9762;&#x4E2D;&#x3002;&#x6587;&#x4EF6;<code>game.css</code>&#x5305;&#x542B;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x6E38;&#x620F;&#x6240;&#x9700;&#x7684;&#x6837;&#x5F0F;&#x3002;</p>
<h2 id="&#x52A8;&#x4F5C;&#x4E0E;&#x51B2;&#x7A81;">&#x52A8;&#x4F5C;&#x4E0E;&#x51B2;&#x7A81;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x662F;&#x65F6;&#x5019;&#x6765;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x52A8;&#x4F5C;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x6E38;&#x620F;&#x4E2D;&#x6700;&#x4EE4;&#x4EBA;&#x7740;&#x8FF7;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5B9E;&#x73B0;&#x52A8;&#x4F5C;&#x7684;&#x6700;&#x57FA;&#x672C;&#x7684;&#x65B9;&#x6848;&#xFF08;&#x4E5F;&#x662F;&#x5927;&#x591A;&#x6570;&#x6E38;&#x620F;&#x91C7;&#x7528;&#x7684;&#xFF09;&#x662F;&#x5C06;&#x65F6;&#x95F4;&#x5212;&#x5206;&#x4E3A;&#x4E00;&#x4E2A;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x6839;&#x636E;&#x89D2;&#x8272;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x901F;&#x5EA6;&#x548C;&#x65F6;&#x95F4;&#x957F;&#x5EA6;&#xFF0C;&#x5C06;&#x5143;&#x7D20;&#x79FB;&#x52A8;&#x4E00;&#x6BB5;&#x8DDD;&#x79BB;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;&#x6D4B;&#x91CF;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x901F;&#x5EA6;&#x4EE5;&#x5355;&#x5143;&#x6BCF;&#x79D2;&#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x4E1C;&#x897F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5904;&#x7406;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x5F53;&#x73A9;&#x5BB6;&#x649E;&#x5230;&#x5899;&#x58C1;&#x6216;&#x8005;&#x5730;&#x677F;&#x65F6;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x76F4;&#x63A5;&#x7A7F;&#x8D8A;&#x8FC7;&#x53BB;&#x3002;&#x6E38;&#x620F;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x7279;&#x5B9A;&#x7684;&#x52A8;&#x4F5C;&#x4F1A;&#x5BFC;&#x81F4;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x4EA7;&#x751F;&#x78B0;&#x649E;&#xFF0C;&#x5E76;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x76F8;&#x5E94;&#x63AA;&#x65BD;&#x3002;&#x5982;&#x679C;&#x73A9;&#x5BB6;&#x9047;&#x5230;&#x5899;&#x58C1;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;&#x786C;&#x5E01;&#x5219;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x6536;&#x96C6;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x60F3;&#x8981;&#x89E3;&#x51B3;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x78B0;&#x649E;&#x95EE;&#x9898;&#x662F;&#x4EF6;&#x8270;&#x5DE8;&#x4EFB;&#x52A1;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x7269;&#x7406;&#x5F15;&#x64CE;&#x7684;&#x5E93;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E93;&#x4F1A;&#x5728;&#x4E8C;&#x7EF4;&#x6216;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x6A21;&#x62DF;&#x7269;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x91C7;&#x7528;&#x66F4;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6848;&#xFF1A;&#x53EA;&#x5904;&#x7406;&#x77E9;&#x5F62;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x78B0;&#x649E;&#xFF0C;&#x5E76;&#x91C7;&#x7528;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>&#x5728;&#x79FB;&#x52A8;&#x89D2;&#x8272;&#x6216;&#x5CA9;&#x6D46;&#x5757;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6D4B;&#x8BD5;&#x5143;&#x7D20;&#x662F;&#x5426;&#x4F1A;&#x79FB;&#x52A8;&#x5230;&#x5899;&#x91CC;&#x9762;&#x3002;&#x5982;&#x679C;&#x4F1A;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x53D6;&#x6D88;&#x6574;&#x4E2A;&#x52A8;&#x4F5C;&#x5373;&#x53EF;&#x3002;&#x800C;&#x5BF9;&#x52A8;&#x4F5C;&#x7684;&#x53CD;&#x5E94;&#x5219;&#x53D6;&#x51B3;&#x4E8E;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x662F;&#x73A9;&#x5BB6;&#x5219;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5CA9;&#x6D46;&#x5757;&#x5219;&#x53CD;&#x5F39;&#x56DE;&#x53BB;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E00;&#x6B65;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x8DB3;&#x591F;&#x77ED;&#xFF0C;&#x786E;&#x4FDD;&#x80FD;&#x591F;&#x5728;&#x5BF9;&#x8C61;&#x5B9E;&#x9645;&#x78B0;&#x649E;&#x4E4B;&#x524D;&#x53D6;&#x6D88;&#x52A8;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x592A;&#x5927;&#xFF0C;&#x73A9;&#x5BB6;&#x6700;&#x540E;&#x4F1A;&#x60AC;&#x6D6E;&#x5728;&#x79BB;&#x5730;&#x9762;&#x5F88;&#x9AD8;&#x7684;&#x5730;&#x65B9;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x660E;&#x663E;&#x66F4;&#x597D;&#x4F46;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5373;&#x5BFB;&#x627E;&#x5230;&#x7CBE;&#x786E;&#x7684;&#x78B0;&#x649E;&#x70B9;&#x5E76;&#x5C06;&#x5143;&#x7D20;&#x79FB;&#x52A8;&#x5230;&#x90A3;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x91C7;&#x53D6;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x51CF;&#x5C11;&#x52A8;&#x753B;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF0C;&#x4EE5;&#x63A9;&#x76D6;&#x5176;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x67D0;&#x4E2A;&#x77E9;&#x5F62;&#xFF08;&#x901A;&#x8FC7;&#x4F4D;&#x7F6E;&#x4E0E;&#x5C3A;&#x5BF8;&#x9650;&#x5B9A;&#xFF09;&#x662F;&#x5426;&#x4F1A;&#x78B0;&#x5230;&#x7ED9;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x7F51;&#x683C;&#x3002;</p>
<pre><code class="lang-js">Level.prototype.touches = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">pos, size, type</span>) </span>{
  <span class="hljs-keyword">var</span> xStart = <span class="hljs-built_in">Math</span>.floor(pos.x);
  <span class="hljs-keyword">var</span> xEnd = <span class="hljs-built_in">Math</span>.ceil(pos.x + size.x);
  <span class="hljs-keyword">var</span> yStart = <span class="hljs-built_in">Math</span>.floor(pos.y);
  <span class="hljs-keyword">var</span> yEnd = <span class="hljs-built_in">Math</span>.ceil(pos.y + size.y);

  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> y = yStart; y &lt; yEnd; y++) {
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> x = xStart; x &lt; xEnd; x++) {
      <span class="hljs-keyword">let</span> isOutside = x &lt; <span class="hljs-number">0</span> || x &gt;= <span class="hljs-keyword">this</span>.width ||
                      y &lt; <span class="hljs-number">0</span> || y &gt;= <span class="hljs-keyword">this</span>.height;
      <span class="hljs-keyword">let</span> here = isOutside ? <span class="hljs-string">&quot;wall&quot;</span> : <span class="hljs-keyword">this</span>.rows[y][x];
      <span class="hljs-keyword">if</span> (here == type) <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
    }
  }
  <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
};
</code></pre>
<p>&#x8BE5;&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x5BF9;&#x5750;&#x6807;&#x4F7F;&#x7528;<code>Math.floor</code>&#x548C;<code>Math.ceil</code>&#xFF0C;&#x6765;&#x8BA1;&#x7B97;&#x4E0E;&#x8EAB;&#x4F53;&#x91CD;&#x53E0;&#x7684;&#x7F51;&#x683C;&#x65B9;&#x5757;&#x96C6;&#x5408;&#x3002;&#x8BB0;&#x4F4F;&#x7F51;&#x683C;&#x65B9;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x662F;<code>1x1</code>&#x4E2A;&#x5355;&#x4F4D;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x76D2;&#x5B50;&#x7684;&#x8FB9;&#x4E0A;&#x4E0B;&#x98A0;&#x5012;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x76D2;&#x5B50;&#x63A5;&#x89E6;&#x7684;&#x80CC;&#x666F;&#x65B9;&#x5757;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
<p><img src="img/16-2.svg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x67E5;&#x627E;&#x5750;&#x6807;&#x904D;&#x5386;&#x7F51;&#x683C;&#x65B9;&#x5757;&#xFF0C;&#x5E76;&#x5728;&#x627E;&#x5230;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5757;&#x65F6;&#x8FD4;&#x56DE;<code>true</code>&#x3002;&#x5173;&#x5361;&#x4E4B;&#x5916;&#x7684;&#x65B9;&#x5757;&#x603B;&#x662F;&#x88AB;&#x5F53;&#x4F5C;<code>&quot;wall&quot;</code>&#xFF0C;&#x6765;&#x786E;&#x4FDD;&#x73A9;&#x5BB6;&#x4E0D;&#x80FD;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x610F;&#x5916;&#x5730;&#x5C1D;&#x8BD5;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x201C;<code>rows</code>&#x6570;&#x7EC4;&#x7684;&#x8FB9;&#x754C;&#x4E4B;&#x5916;&#x8BFB;&#x53D6;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x7684;<code>update</code>&#x65B9;&#x6CD5;&#x4F7F;&#x7528;<code>touches</code>&#x6765;&#x5224;&#x65AD;&#x73A9;&#x5BB6;&#x662F;&#x5426;&#x63A5;&#x89E6;&#x5CA9;&#x6D46;&#x3002;</p>
<pre><code class="lang-js">State.prototype.update = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">time, keys</span>) </span>{
  <span class="hljs-keyword">let</span> actors = <span class="hljs-keyword">this</span>.actors
    .map(actor =&gt; actor.update(time, <span class="hljs-keyword">this</span>, keys));
  <span class="hljs-keyword">let</span> newState = <span class="hljs-keyword">new</span> State(<span class="hljs-keyword">this</span>.level, actors, <span class="hljs-keyword">this</span>.status);
  <span class="hljs-keyword">if</span> (newState.status != <span class="hljs-string">&quot;playing&quot;</span>) <span class="hljs-keyword">return</span> newState;
  <span class="hljs-keyword">let</span> player = newState.player;
  <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.level.touches(player.pos, player.size, <span class="hljs-string">&quot;lava&quot;</span>)) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> State(<span class="hljs-keyword">this</span>.level, actors, <span class="hljs-string">&quot;lost&quot;</span>);
  }
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> actor <span class="hljs-keyword">of</span> actors) {
    <span class="hljs-keyword">if</span> (actor != player &amp;&amp; overlap(actor, player)) {
      newState = actor.collide(newState);
    }
  }
  <span class="hljs-keyword">return</span> newState;
};
</code></pre>
<p>&#x5B83;&#x63A5;&#x53D7;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x548C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x544A;&#x8BC9;&#x5B83;&#x6309;&#x4E0B;&#x4E86;&#x54EA;&#x4E9B;&#x952E;&#x3002;&#x5B83;&#x6240;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x8C03;&#x7528;&#x6240;&#x6709;&#x89D2;&#x8272;&#x7684;<code>update</code>&#x65B9;&#x6CD5;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x7EC4;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x89D2;&#x8272;&#x3002;&#x89D2;&#x8272;&#x4E5F;&#x5F97;&#x5230;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF0C;&#x6309;&#x952E;&#xFF0C;&#x548C;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x6765;&#x66F4;&#x65B0;&#x3002;&#x53EA;&#x6709;&#x73A9;&#x5BB6;&#x624D;&#x4F1A;&#x8BFB;&#x53D6;&#x6309;&#x952E;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x552F;&#x4E00;&#x7531;&#x952E;&#x76D8;&#x63A7;&#x5236;&#x7684;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6E38;&#x620F;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x505A;&#x4EFB;&#x4F55;&#x5904;&#x7406;&#xFF08;&#x6E38;&#x620F;&#x4E0D;&#x80FD;&#x5728;&#x8F93;&#x4E4B;&#x540E;&#x8D62;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#xFF09;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x6D4B;&#x8BD5;&#x73A9;&#x5BB6;&#x662F;&#x5426;&#x63A5;&#x89E6;&#x80CC;&#x666F;&#x5CA9;&#x6D46;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6E38;&#x620F;&#x5C31;&#x8F93;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B8C;&#x4E86;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x6E38;&#x620F;&#x5B9E;&#x9645;&#x4E0A;&#x8FD8;&#x5728;&#x7EE7;&#x7EED;&#xFF0C;&#x5B83;&#x4F1A;&#x67E5;&#x770B;&#x5176;&#x4ED6;&#x73A9;&#x5BB6;&#x662F;&#x5426;&#x4E0E;&#x73A9;&#x5BB6;&#x91CD;&#x53E0;&#x3002;</p>
<p><code>overlap</code>&#x51FD;&#x6570;&#x68C0;&#x6D4B;&#x89D2;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x91CD;&#x53E0;&#x3002;&#x5B83;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#x5BF9;&#x8C61;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x89E6;&#x78B0;&#x65F6;&#x8FD4;&#x56DE;<code>true</code>&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x6CBF;<code>X</code>&#x8F74;&#x548C;<code>Y</code>&#x8F74;&#x91CD;&#x53E0;&#x65F6;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">overlap</span>(<span class="hljs-params">actor1, actor2</span>) </span>{
  <span class="hljs-keyword">return</span> actor1.pos.x + actor1.size.x &gt; actor2.pos.x &amp;&amp;
         actor1.pos.x &lt; actor2.pos.x + actor2.size.x &amp;&amp;
         actor1.pos.y + actor1.size.y &gt; actor2.pos.y &amp;&amp;
         actor1.pos.y &lt; actor2.pos.y + actor2.size.y;
}
</code></pre>
<p>&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x89D2;&#x8272;&#x91CD;&#x53E0;&#x4E86;&#xFF0C;&#x5B83;&#x7684;<code>collide</code>&#x65B9;&#x6CD5;&#x6709;&#x673A;&#x4F1A;&#x66F4;&#x65B0;&#x72B6;&#x6001;&#x3002;&#x89E6;&#x78B0;&#x5CA9;&#x6D46;&#x89D2;&#x8272;&#x5C06;&#x6E38;&#x620F;&#x72B6;&#x6001;&#x8BBE;&#x7F6E;&#x4E3A;<code>&quot;lost&quot;</code>&#xFF0C;&#x5F53;&#x4F60;&#x78B0;&#x5230;&#x786C;&#x5E01;&#x65F6;&#xFF0C;&#x786C;&#x5E01;&#x5C31;&#x4F1A;&#x6D88;&#x5931;&#xFF0C;&#x5F53;&#x8FD9;&#x662F;&#x6700;&#x540E;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x65F6;&#xFF0C;&#x72B6;&#x6001;&#x5C31;&#x53D8;&#x6210;&#x4E86;<code>&quot;won&quot;</code>&#x3002;</p>
<pre><code class="lang-js">Lava.prototype.collide = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">state</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> State(state.level, state.actors, <span class="hljs-string">&quot;lost&quot;</span>);
};

Coin.prototype.collide = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">state</span>) </span>{
  <span class="hljs-keyword">let</span> filtered = state.actors.filter(a =&gt; a != <span class="hljs-keyword">this</span>);
  <span class="hljs-keyword">let</span> status = state.status;
  <span class="hljs-keyword">if</span> (!filtered.some(a =&gt; a.type == <span class="hljs-string">&quot;coin&quot;</span>)) status = <span class="hljs-string">&quot;won&quot;</span>;
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> State(state.level, filtered, status);
};
</code></pre>
<h2 id="&#x89D2;&#x8272;&#x7684;&#x66F4;&#x65B0;">&#x89D2;&#x8272;&#x7684;&#x66F4;&#x65B0;</h2>
<p>&#x89D2;&#x8272;&#x5BF9;&#x8C61;&#x7684;<code>update</code>&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x3001;&#x72B6;&#x6001;&#x5BF9;&#x8C61;&#x548C;<code>keys</code>&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;<code>Lava</code>&#x89D2;&#x8272;&#x7C7B;&#x578B;&#x5FFD;&#x7565;<code>keys</code>&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code class="lang-js">Lava.prototype.update = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">time, state</span>) </span>{
  <span class="hljs-keyword">let</span> newPos = <span class="hljs-keyword">this</span>.pos.plus(<span class="hljs-keyword">this</span>.speed.times(time));
  <span class="hljs-keyword">if</span> (!state.level.touches(newPos, <span class="hljs-keyword">this</span>.size, <span class="hljs-string">&quot;wall&quot;</span>)) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Lava(newPos, <span class="hljs-keyword">this</span>.speed, <span class="hljs-keyword">this</span>.reset);
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.reset) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Lava(<span class="hljs-keyword">this</span>.reset, <span class="hljs-keyword">this</span>.speed, <span class="hljs-keyword">this</span>.reset);
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Lava(<span class="hljs-keyword">this</span>.pos, <span class="hljs-keyword">this</span>.speed.times(<span class="hljs-number">-1</span>));
  }
};
</code></pre>
<p>&#x5B83;&#x901A;&#x8FC7;&#x5C06;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x4E58;&#x4E0A;&#x5F53;&#x524D;&#x901F;&#x5EA6;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x52A0;&#x5230;&#x5176;&#x65E7;&#x4F4D;&#x7F6E;&#xFF0C;&#x6765;&#x8BA1;&#x7B97;&#x65B0;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x65B0;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x6CA1;&#x6709;&#x969C;&#x788D;&#xFF0C;&#x5B83;&#x79FB;&#x52A8;&#x5230;&#x90A3;&#x91CC;&#x3002;&#x5982;&#x679C;&#x6709;&#x969C;&#x788D;&#x7269;&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x53D6;&#x51B3;&#x4E8E;&#x5CA9;&#x6D46;&#x5757;&#x7684;&#x7C7B;&#x578B;&#xFF1A;&#x6EF4;&#x843D;&#x5CA9;&#x6D46;&#x5177;&#x6709;<code>reset</code>&#x4F4D;&#x7F6E;&#xFF0C;&#x5F53;&#x5B83;&#x78B0;&#x5230;&#x67D0;&#x7269;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8DF3;&#x56DE;&#x53BB;&#x3002;&#x8DF3;&#x8DC3;&#x5CA9;&#x6D46;&#x5C06;&#x5176;&#x901F;&#x5EA6;&#x4E58;&#x4EE5;<code>-1</code>&#xFF0C;&#x4ECE;&#x800C;&#x5F00;&#x59CB;&#x5411;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5411;&#x79FB;&#x52A8;&#x3002;</p>
<p>&#x786C;&#x5E01;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;<code>act</code>&#x65B9;&#x6CD5;&#x6765;&#x6643;&#x52A8;&#x3002;&#x4ED6;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#x7F51;&#x683C;&#x7684;&#x78B0;&#x649E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EA;&#x662F;&#x5728;&#x5B83;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5757;&#x5185;&#x90E8;&#x6643;&#x52A8;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> wobbleSpeed = <span class="hljs-number">8</span>, wobbleDist = <span class="hljs-number">0.07</span>;

Coin.prototype.update = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">time</span>) </span>{
  <span class="hljs-keyword">let</span> wobble = <span class="hljs-keyword">this</span>.wobble + time * wobbleSpeed;
  <span class="hljs-keyword">let</span> wobblePos = <span class="hljs-built_in">Math</span>.sin(wobble) * wobbleDist;
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Coin(<span class="hljs-keyword">this</span>.basePos.plus(<span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, wobblePos)),
                  <span class="hljs-keyword">this</span>.basePos, wobble);
};
</code></pre>
<p>&#x9012;&#x589E;<code>wobble</code>&#x5C5E;&#x6027;&#x6765;&#x8DDF;&#x8E2A;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4F5C;<code>Math.sin</code>&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6765;&#x627E;&#x5230;&#x6CE2;&#x4E0A;&#x7684;&#x65B0;&#x4F4D;&#x7F6E;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6839;&#x636E;&#x5176;&#x57FA;&#x672C;&#x4F4D;&#x7F6E;&#x548C;&#x57FA;&#x4E8E;&#x6CE2;&#x7684;&#x504F;&#x79FB;&#xFF0C;&#x8BA1;&#x7B97;&#x786C;&#x5E01;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x8FD8;&#x5269;&#x4E0B;&#x73A9;&#x5BB6;&#x672C;&#x8EAB;&#x3002;&#x73A9;&#x5BB6;&#x7684;&#x8FD0;&#x52A8;&#x5BF9;&#x4E8E;&#x6BCF;&#x548C;&#x8F74;&#x5355;&#x72EC;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x78B0;&#x5230;&#x5730;&#x677F;&#x4E0D;&#x5E94;&#x963B;&#x6B62;&#x6C34;&#x5E73;&#x8FD0;&#x52A8;&#xFF0C;&#x78B0;&#x5230;&#x5899;&#x58C1;&#x4E0D;&#x5E94;&#x505C;&#x6B62;&#x4E0B;&#x964D;&#x6216;&#x8DF3;&#x8DC3;&#x8FD0;&#x52A8;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> playerXSpeed = <span class="hljs-number">7</span>;
<span class="hljs-keyword">const</span> gravity = <span class="hljs-number">30</span>;
<span class="hljs-keyword">const</span> jumpSpeed = <span class="hljs-number">17</span>;

Player.prototype.update = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">time, state, keys</span>) </span>{
  <span class="hljs-keyword">let</span> xSpeed = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">if</span> (keys.ArrowLeft) xSpeed -= playerXSpeed;
  <span class="hljs-keyword">if</span> (keys.ArrowRight) xSpeed += playerXSpeed;
  <span class="hljs-keyword">let</span> pos = <span class="hljs-keyword">this</span>.pos;
  <span class="hljs-keyword">let</span> movedX = pos.plus(<span class="hljs-keyword">new</span> Vec(xSpeed * time, <span class="hljs-number">0</span>));
  <span class="hljs-keyword">if</span> (!state.level.touches(movedX, <span class="hljs-keyword">this</span>.size, <span class="hljs-string">&quot;wall&quot;</span>)) {
    pos = movedX;
  }

  <span class="hljs-keyword">let</span> ySpeed = <span class="hljs-keyword">this</span>.speed.y + time * gravity;
  <span class="hljs-keyword">let</span> movedY = pos.plus(<span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, ySpeed * time));
  <span class="hljs-keyword">if</span> (!state.level.touches(movedY, <span class="hljs-keyword">this</span>.size, <span class="hljs-string">&quot;wall&quot;</span>)) {
    pos = movedY;
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (keys.ArrowUp &amp;&amp; ySpeed &gt; <span class="hljs-number">0</span>) {
    ySpeed = -jumpSpeed;
  } <span class="hljs-keyword">else</span> {
    ySpeed = <span class="hljs-number">0</span>;
   }
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Player(pos, <span class="hljs-keyword">new</span> Vec(xSpeed, ySpeed));
};
</code></pre>
<p>&#x6C34;&#x5E73;&#x8FD0;&#x52A8;&#x6839;&#x636E;&#x5DE6;&#x53F3;&#x7BAD;&#x5934;&#x952E;&#x7684;&#x72B6;&#x6001;&#x8BA1;&#x7B97;&#x3002;&#x5F53;&#x6CA1;&#x6709;&#x5899;&#x58C1;&#x963B;&#x6321;&#x7531;&#x8FD9;&#x4E2A;&#x8FD0;&#x52A8;&#x4EA7;&#x751F;&#x7684;&#x65B0;&#x4F4D;&#x7F6E;&#x65F6;&#xFF0C;&#x5C31;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x4FDD;&#x7559;&#x65E7;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5782;&#x76F4;&#x8FD0;&#x52A8;&#x7684;&#x539F;&#x7406;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x6A21;&#x62DF;&#x8DF3;&#x8DC3;&#x548C;&#x91CD;&#x529B;&#x3002;&#x73A9;&#x5BB6;&#x7684;&#x5782;&#x76F4;&#x901F;&#x5EA6;&#xFF08;<code>ySpeed</code>&#xFF09;&#x9996;&#x5148;&#x8003;&#x8651;&#x91CD;&#x529B;&#x800C;&#x52A0;&#x901F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x68C0;&#x67E5;&#x5899;&#x58C1;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x78B0;&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#xFF0C;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x9762;&#x5899;&#xFF0C;&#x5C31;&#x6709;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5F53;&#x6309;&#x4E0B;&#x5411;&#x4E0A;&#x7684;&#x7BAD;&#x5934;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#x65F6;&#xFF08;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x78B0;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x5728;&#x6211;&#x4EEC;&#x4E0B;&#x9762;&#xFF09;&#xFF0C;&#x5C06;&#x901F;&#x5EA6;&#x8BBE;&#x7F6E;&#x6210;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x5927;&#x7684;&#x8D1F;&#x503C;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x73A9;&#x5BB6;&#x8DF3;&#x8DC3;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x73A9;&#x5BB6;&#x53EA;&#x662F;&#x649E;&#x5230;&#x67D0;&#x7269;&#x4E0A;&#xFF0C;&#x901F;&#x5EA6;&#x5C31;&#x88AB;&#x8BBE;&#x5B9A;&#x4E3A;&#x96F6;&#x3002;</p>
<p>&#x91CD;&#x529B;&#x3001;&#x8DF3;&#x8DC3;&#x901F;&#x5EA6;&#x548C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x5E38;&#x6570;&#xFF0C;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x53CD;&#x590D;&#x8BD5;&#x9A8C;&#x6765;&#x8BBE;&#x5B9A;&#x7684;&#x3002;&#x6211;&#x6D4B;&#x8BD5;&#x4E86;&#x503C;&#xFF0C;&#x76F4;&#x5230;&#x6211;&#x627E;&#x5230;&#x4E86;&#x6211;&#x559C;&#x6B22;&#x7684;&#x7EC4;&#x5408;&#x3002;</p>
<h2 id="&#x8DDF;&#x8E2A;&#x6309;&#x952E;">&#x8DDF;&#x8E2A;&#x6309;&#x952E;</h2>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x6309;&#x952E;&#x5728;&#x6BCF;&#x6B21;&#x6309;&#x4E0B;&#x65F6;&#x751F;&#x6548;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x53EA;&#x8981;&#x6309;&#x4E0B;&#x4E86;&#x5B83;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x6548;&#x679C;&#xFF08;&#x79FB;&#x52A8;&#x7403;&#x5458;&#x7684;&#x6570;&#x5B57;&#xFF09;&#x5C31;&#x4E00;&#x76F4;&#x6709;&#x6548;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x952E;&#x76D8;&#x5904;&#x7406;&#x5668;&#x6765;&#x5B58;&#x50A8;&#x5DE6;&#x3001;&#x53F3;&#x3001;&#x4E0A;&#x952E;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x3002;&#x6211;&#x4EEC;&#x8C03;&#x7528;<code>preventDefault</code>&#xFF0C;&#x9632;&#x6B62;&#x6309;&#x952E;&#x4EA7;&#x751F;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6309;&#x952E;&#x540D;&#x79F0;&#x6570;&#x7EC4;&#xFF0C;&#x8FD4;&#x56DE;&#x8DDF;&#x8E2A;&#x8FD9;&#x4E9B;&#x6309;&#x952E;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5E76;&#x6CE8;&#x518C;<code>&quot;keydown&quot;</code>&#x548C;<code>&quot;keyup&quot;</code>&#x4E8B;&#x4EF6;&#xFF0C;&#x5F53;&#x4E8B;&#x4EF6;&#x5BF9;&#x5E94;&#x7684;&#x6309;&#x952E;&#x4EE3;&#x7801;&#x5B58;&#x5728;&#x4E8E;&#x5176;&#x5B58;&#x50A8;&#x7684;&#x6309;&#x952E;&#x4EE3;&#x7801;&#x96C6;&#x5408;&#x4E2D;&#x65F6;&#xFF0C;&#x5C31;&#x66F4;&#x65B0;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">trackKeys</span>(<span class="hljs-params">keys</span>) </span>{
  <span class="hljs-keyword">let</span> down = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">track</span>(<span class="hljs-params">event</span>) </span>{
    <span class="hljs-keyword">if</span> (keys.includes(event.key)) {
      down[event.key] = event.type == <span class="hljs-string">&quot;keydown&quot;</span>;
      event.preventDefault();
    }
  }
  <span class="hljs-built_in">window</span>.addEventListener(<span class="hljs-string">&quot;keydown&quot;</span>, track);
  <span class="hljs-built_in">window</span>.addEventListener(<span class="hljs-string">&quot;keyup&quot;</span>, track);
  <span class="hljs-keyword">return</span> down;
}

<span class="hljs-keyword">const</span> arrowKeys =
  trackKeys([<span class="hljs-string">&quot;ArrowLeft&quot;</span>, <span class="hljs-string">&quot;ArrowRight&quot;</span>, <span class="hljs-string">&quot;ArrowUp&quot;</span>]);
</code></pre>
<p>&#x4E24;&#x79CD;&#x4E8B;&#x4EF6;&#x7C7B;&#x578B;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x51FD;&#x6570;&#x3002;&#x8BE5;&#x5904;&#x7406;&#x51FD;&#x6570;&#x6839;&#x636E;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x7684;type&#x5C5E;&#x6027;&#x6765;&#x786E;&#x5B9A;&#x662F;&#x5C06;&#x6309;&#x952E;&#x72B6;&#x6001;&#x4FEE;&#x6539;&#x4E3A;true&#xFF08;&#x201C;keydown&#x201D;&#xFF09;&#x8FD8;&#x662F;false&#xFF08;&#x201C;keyup&#x201D;&#xFF09;&#x3002;</p>
<h2 id="&#x8FD0;&#x884C;&#x6E38;&#x620F;">&#x8FD0;&#x884C;&#x6E38;&#x620F;</h2>
<p>&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x5341;&#x56DB;&#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x7684;<code>requestAnimationFrames</code>&#x51FD;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x4EA7;&#x751F;&#x6E38;&#x620F;&#x52A8;&#x753B;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x63A5;&#x53E3;&#x6709;&#x70B9;&#x8FC7;&#x4E8E;&#x539F;&#x59CB;&#x3002;&#x8BE5;&#x51FD;&#x6570;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x8DDF;&#x8E2A;&#x4E0A;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x4E00;&#x5E27;&#x540E;&#x518D;&#x6B21;&#x8C03;&#x7528;<code>requestAnimationFrame</code>&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#x6765;&#x5C06;&#x8FD9;&#x90E8;&#x5206;&#x70E6;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x5305;&#x88C5;&#x5230;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>runAnimation</code>&#x7684;&#x7B80;&#x5355;&#x63A5;&#x53E3;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x5411;&#x5176;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5373;&#x53EF;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF0C;&#x5E76;&#x7528;&#x4E8E;&#x7ED8;&#x5236;&#x4E00;&#x5E27;&#x56FE;&#x50CF;&#x3002;&#x5F53;&#x5E27;&#x51FD;&#x6570;&#x8FD4;&#x56DE;<code>false</code>&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x52A8;&#x753B;&#x505C;&#x6B62;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">runAnimation</span>(<span class="hljs-params">frameFunc</span>) </span>{
  <span class="hljs-keyword">let</span> lastTime = <span class="hljs-literal">null</span>;
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">frame</span>(<span class="hljs-params">time</span>) </span>{
    <span class="hljs-keyword">let</span> stop = <span class="hljs-literal">false</span>;
    <span class="hljs-keyword">if</span> (lastTime != <span class="hljs-literal">null</span>) {
      <span class="hljs-keyword">let</span> timeStep = <span class="hljs-built_in">Math</span>.min(time - lastTime, <span class="hljs-number">100</span>) / <span class="hljs-number">1000</span>;
      <span class="hljs-keyword">if</span> (frameFunc(timeStep) === <span class="hljs-literal">false</span>) <span class="hljs-keyword">return</span>;
    }
    lastTime = time;
    requestAnimationFrame(frame);
  }
  requestAnimationFrame(frame);
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x8BBE;&#x7F6E;&#x4E3A; 100 &#x6BEB;&#x79D2;&#xFF08;&#x5341;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#xFF09;&#x3002;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x6807;&#x7B7E;&#x9875;&#x6216;&#x7A97;&#x53E3;&#x9690;&#x85CF;&#x65F6;&#xFF0C;<code>requestAnimationFrame</code>&#x8C03;&#x7528;&#x4F1A;&#x81EA;&#x52A8;&#x6682;&#x505C;&#xFF0C;&#x5E76;&#x5728;&#x6807;&#x7B7E;&#x9875;&#x6216;&#x7A97;&#x53E3;&#x518D;&#x6B21;&#x663E;&#x793A;&#x65F6;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x7ED8;&#x5236;&#x52A8;&#x753B;&#x3002;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;<code>lastTime</code>&#x548C;<code>time</code>&#x4E4B;&#x5DEE;&#x662F;&#x9690;&#x85CF;&#x9875;&#x9762;&#x7684;&#x6574;&#x4E2A;&#x65F6;&#x95F4;&#x3002;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x63A8;&#x8FDB;&#x6E38;&#x620F;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x50BB;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x5947;&#x602A;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x73A9;&#x5BB6;&#x4ECE;&#x5730;&#x677F;&#x4E0A;&#x6389;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x8BE5;&#x51FD;&#x6570;&#x4E5F;&#x4F1A;&#x5C06;&#x65F6;&#x95F4;&#x5355;&#x4F4D;&#x8F6C;&#x6362;&#x6210;&#x79D2;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x6BEB;&#x79D2;&#x5927;&#x5BB6;&#x4F1A;&#x66F4;&#x719F;&#x6089;&#x79D2;&#x3002;</p>
<p><code>runLevel</code>&#x51FD;&#x6570;&#x7684;&#x63A5;&#x53D7;Level&#x5BF9;&#x8C61;&#x548C;&#x663E;&#x793A;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>Promise</code>&#x3002;<code>runLevel</code>&#x51FD;&#x6570;&#xFF08;&#x5728;<code>document.body</code>&#x4E2D;&#xFF09;&#x663E;&#x793A;&#x5173;&#x5361;&#xFF0C;&#x5E76;&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x8BE5;&#x8282;&#x70B9;&#x64CD;&#x4F5C;&#x6E38;&#x620F;&#x3002;&#x5F53;&#x5173;&#x5361;&#x7ED3;&#x675F;&#x65F6;&#xFF08;&#x6216;&#x80DC;&#x6216;&#x8D1F;&#xFF09;&#xFF0C;<code>runLevel</code>&#x4F1A;&#x591A;&#x7B49;&#x4E00;&#x79D2;&#xFF08;&#x8BA9;&#x7528;&#x6237;&#x770B;&#x770B;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF09;&#xFF0C;&#x6E05;&#x9664;&#x5173;&#x5361;&#xFF0C;&#x5E76;&#x505C;&#x6B62;&#x52A8;&#x753B;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6307;&#x5B9A;&#x4E86;<code>andThen</code>&#x51FD;&#x6570;&#xFF0C;&#x5219;<code>runLevel</code>&#x4F1A;&#x4EE5;&#x5173;&#x5361;&#x72B6;&#x6001;&#x4E3A;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">runLevel</span>(<span class="hljs-params">level, Display</span>) </span>{
  <span class="hljs-keyword">let</span> display = <span class="hljs-keyword">new</span> Display(<span class="hljs-built_in">document</span>.body, level);
  <span class="hljs-keyword">let</span> state = State.start(level);
  <span class="hljs-keyword">let</span> ending = <span class="hljs-number">1</span>;
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(resolve =&gt; {
    runAnimation(time =&gt; {
      state = state.update(time, arrowKeys);
      display.setState(state);
      <span class="hljs-keyword">if</span> (state.status == <span class="hljs-string">&quot;playing&quot;</span>) {
        <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
      } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (ending &gt; <span class="hljs-number">0</span>) {
        ending -= time;
        <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
      } <span class="hljs-keyword">else</span> {
        display.clear();
        resolve(state.status);
        <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
      }
    });
  });
}
</code></pre>
<p>&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x5361;&#x5E8F;&#x5217;&#x3002;&#x6BCF;&#x5F53;&#x73A9;&#x5BB6;&#x6B7B;&#x4EA1;&#x65F6;&#x5C31;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x5F53;&#x524D;&#x5173;&#x5361;&#x3002;&#x5F53;&#x5B8C;&#x6210;&#x5173;&#x5361;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5207;&#x6362;&#x5230;&#x4E0B;&#x4E00;&#x5173;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x51FD;&#x6570;&#x6765;&#x5B8C;&#x6210;&#x8BE5;&#x4EFB;&#x52A1;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x4E3A;&#x4E00;&#x4E2A;&#x5173;&#x5361;&#x5E73;&#x9762;&#x56FE;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x6570;&#x7EC4;&#x548C;&#x663E;&#x793A;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x5668;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">runGame</span>(<span class="hljs-params">plans, Display</span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> level = <span class="hljs-number">0</span>; level &lt; plans.length;) {
    <span class="hljs-keyword">let</span> status = <span class="hljs-keyword">await</span> runLevel(<span class="hljs-keyword">new</span> Level(plans[level]),
                                Display);
    <span class="hljs-keyword">if</span> (status == <span class="hljs-string">&quot;won&quot;</span>) level++;
  }
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;You&apos;ve won!&quot;</span>);
}
</code></pre>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;<code>runLevel</code>&#x8FD4;&#x56DE;<code>Promise</code>&#xFF0C;<code>runGame</code>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>async</code>&#x51FD;&#x6570;&#x7F16;&#x5199;&#xFF0C;&#x5982;&#x7B2C;&#x5341;&#x4E00;&#x7AE0;&#x4E2D;&#x6240;&#x89C1;&#x3002;&#x5B83;&#x8FD4;&#x56DE;&#x53E6;&#x4E00;&#x4E2A;<code>Promise</code>&#xFF0C;&#x5F53;&#x73A9;&#x5BB6;&#x5B8C;&#x6210;&#x6E38;&#x620F;&#x65F6;&#x5F97;&#x5230;&#x89E3;&#x6790;&#x3002;</p>
<p>&#x5728;<a href="https://eloquentjavascript.net/code#16" target="_blank">&#x672C;&#x7AE0;&#x7684;&#x6C99;&#x76D2;</a>&#x7684;<code>GAME_LEVELS</code>&#x7ED1;&#x5B9A;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x7EC4;&#x53EF;&#x7528;&#x7684;&#x5173;&#x5361;&#x5E73;&#x9762;&#x56FE;&#x3002;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x5C06;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7ED9;<code>runGame</code>&#xFF0C;&#x542F;&#x52A8;&#x5B9E;&#x9645;&#x7684;&#x6E38;&#x620F;&#xFF1A;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">link</span> <span class="hljs-attr">rel</span>=<span class="hljs-string">&quot;stylesheet&quot;</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;css/game.css&quot;</span>&gt;</span>

<span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="undefined">
    runGame(GAME_LEVELS, DOMDisplay);
  </span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
</code></pre>
<h2 id="&#x4E60;&#x9898;">&#x4E60;&#x9898;</h2>
<h3 id="&#x6E38;&#x620F;&#x7ED3;&#x675F;">&#x6E38;&#x620F;&#x7ED3;&#x675F;</h3>
<p>&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x5E73;&#x53F0;&#x6E38;&#x620F;&#x4E2D;&#x73A9;&#x5BB6;&#x4E00;&#x5F00;&#x59CB;&#x4F1A;&#x6709;&#x6709;&#x9650;&#x6570;&#x91CF;&#x7684;&#x751F;&#x547D;&#xFF0C;&#x6BCF;&#x6B7B;&#x4EA1;&#x4E00;&#x6B21;&#x5C31;&#x6263;&#x53BB;&#x4E00;&#x6761;&#x751F;&#x547D;&#x3002;&#x5F53;&#x73A9;&#x5BB6;&#x751F;&#x547D;&#x8017;&#x5C3D;&#x65F6;&#xFF0C;&#x6E38;&#x620F;&#x5C31;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x4E86;&#x3002;</p>
<p>&#x8C03;&#x6574;<code>runGame</code>&#x6765;&#x5B9E;&#x73B0;&#x751F;&#x547D;&#x673A;&#x5236;&#x3002;&#x73A9;&#x5BB6;&#x4E00;&#x5F00;&#x59CB;&#x4F1A;&#x6709; 3 &#x6761;&#x751F;&#x547D;&#x3002;&#x6BCF;&#x6B21;&#x542F;&#x52A8;&#x65F6;&#x8F93;&#x51FA;&#x5F53;&#x524D;&#x751F;&#x547D;&#x6570;&#x91CF;&#xFF08;&#x4F7F;&#x7528;<code>console.log</code>&#xFF09;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">link</span> <span class="hljs-attr">rel</span>=<span class="hljs-string">&quot;stylesheet&quot;</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;css/game.css&quot;</span>&gt;</span>

<span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-comment">// The old runGame function. Modify it...</span>
  <span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">runGame</span>(<span class="hljs-params">plans, Display</span>) </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> level = <span class="hljs-number">0</span>; level &lt; plans.length;) {
      <span class="hljs-keyword">let</span> status = <span class="hljs-keyword">await</span> runLevel(<span class="hljs-keyword">new</span> Level(plans[level]),
                                  Display);
      <span class="hljs-keyword">if</span> (status == <span class="hljs-string">&quot;won&quot;</span>) level++;
    }
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;You&apos;ve won!&quot;</span>);
  }
  runGame(GAME_LEVELS, DOMDisplay);
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
</code></pre>
<h3 id="&#x6682;&#x505C;&#x6E38;&#x620F;">&#x6682;&#x505C;&#x6E38;&#x620F;</h3>
<p>&#x73B0;&#x5728;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x529F;&#x80FD; &#x2014;&#x2014; &#x5F53;&#x7528;&#x6237;&#x6309;&#x4E0B; ESC &#x952E;&#x65F6;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x6216;&#x7EE7;&#x7EED;&#x6E38;&#x620F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;<code>runLevel</code>&#x51FD;&#x6570;&#xFF0C;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#x5728;&#x73A9;&#x5BB6;&#x6309;&#x4E0B; ESC &#x952E;&#x7684;&#x65F6;&#x5019;&#x4E2D;&#x65AD;&#x6216;&#x6062;&#x590D;&#x52A8;&#x753B;&#x3002;</p>
<p>&#x4E4D;&#x770B;&#x8D77;&#x6765;&#xFF0C;<code>runAnimation</code>&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x8BE5;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>runLevel</code>&#x6765;&#x91CD;&#x65B0;&#x5B89;&#x6392;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x5B8C;&#x6210;&#x8BE5;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x52A0;&#x5165;&#x53E6;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6CE8;&#x518C;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x7684;&#x65B9;&#x6CD5;&#x591A;&#x5C11;&#x6709;&#x70B9;&#x95EE;&#x9898;&#x3002;&#x73B0;&#x5728;<code>arrows</code>&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#xFF0C;&#x5373;&#x4F7F;&#x6E38;&#x620F;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x4E5F;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x7CFB;&#x7EDF;&#x6CC4;&#x9732;&#x3002;&#x8BF7;&#x6269;&#x5C55;<code>tracKeys</code>&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x6CE8;&#x9500;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x63A5;&#x7740;&#x4FEE;&#x6539;<code>runLevel</code>&#x5728;&#x542F;&#x52A8;&#x6E38;&#x620F;&#x65F6;&#x6CE8;&#x518C;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5E76;&#x5728;&#x6E38;&#x620F;&#x7ED3;&#x675F;&#x540E;&#x6CE8;&#x9500;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">link</span> <span class="hljs-attr">rel</span>=<span class="hljs-string">&quot;stylesheet&quot;</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;css/game.css&quot;</span>&gt;</span>

<span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-comment">// The old runLevel function. Modify this...</span>
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">runLevel</span>(<span class="hljs-params">level, Display</span>) </span>{
    <span class="hljs-keyword">let</span> display = <span class="hljs-keyword">new</span> Display(<span class="hljs-built_in">document</span>.body, level);
    <span class="hljs-keyword">let</span> state = State.start(level);
    <span class="hljs-keyword">let</span> ending = <span class="hljs-number">1</span>;
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(resolve =&gt; {
      runAnimation(time =&gt; {
        state = state.update(time, arrowKeys);
        display.setState(state);
        <span class="hljs-keyword">if</span> (state.status == <span class="hljs-string">&quot;playing&quot;</span>) {
          <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
        } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (ending &gt; <span class="hljs-number">0</span>) {
          ending -= time;
          <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
        } <span class="hljs-keyword">else</span> {
          display.clear();
          resolve(state.status);
          <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
        }
      });
    });
  }
  runGame(GAME_LEVELS, DOMDisplay);
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
</code></pre>
<h3 id="&#x602A;&#x7269;">&#x602A;&#x7269;</h3>
<p>&#x5B83;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x5E73;&#x53F0;&#x6E38;&#x620F;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x654C;&#x4EBA;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8DF3;&#x5230;&#x5B83;&#x9876;&#x4E0A;&#x6765;&#x6253;&#x8D25;&#x5B83;&#x3002;&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x8981;&#x6C42;&#x4F60;&#x628A;&#x8FD9;&#x79CD;&#x89D2;&#x8272;&#x7C7B;&#x578B;&#x6DFB;&#x52A0;&#x5230;&#x6E38;&#x620F;&#x4E2D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x602A;&#x7269;&#x3002;&#x602A;&#x7269;&#x53EA;&#x80FD;&#x6C34;&#x5E73;&#x79FB;&#x52A8;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x5B83;&#x4EEC;&#x671D;&#x7740;&#x73A9;&#x5BB6;&#x7684;&#x65B9;&#x5411;&#x79FB;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x50CF;&#x6C34;&#x5E73;&#x5CA9;&#x6D46;&#x4E00;&#x6837;&#x6765;&#x56DE;&#x8DF3;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x62E5;&#x6709;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x8FD0;&#x52A8;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x7C7B;&#x4E0D;&#x5FC5;&#x5904;&#x7406;&#x6389;&#x843D;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5E94;&#x8BE5;&#x786E;&#x4FDD;&#x602A;&#x7269;&#x4E0D;&#x4F1A;&#x7A7F;&#x8FC7;&#x5899;&#x58C1;&#x3002;</p>
<p>&#x5F53;&#x602A;&#x7269;&#x63A5;&#x89E6;&#x73A9;&#x5BB6;&#x65F6;&#xFF0C;&#x6548;&#x679C;&#x53D6;&#x51B3;&#x4E8E;&#x73A9;&#x5BB6;&#x662F;&#x5426;&#x8DF3;&#x5230;&#x5B83;&#x4EEC;&#x9876;&#x4E0A;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x73A9;&#x5BB6;&#x7684;&#x5E95;&#x90E8;&#x662F;&#x5426;&#x63A5;&#x8FD1;&#x602A;&#x7269;&#x7684;&#x9876;&#x90E8;&#x6765;&#x8FD1;&#x4F3C;&#x5B83;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x602A;&#x7269;&#x5C31;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x6E38;&#x620F;&#x5C31;&#x8F93;&#x4E86;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">link</span> <span class="hljs-attr">rel</span>=<span class="hljs-string">&quot;stylesheet&quot;</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;css/game.css&quot;</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">style</span>&gt;</span><span class="css"><span class="hljs-selector-class">.monster</span> { <span class="hljs-attribute">background</span>: purple }</span><span class="hljs-tag">&lt;/<span class="hljs-name">style</span>&gt;</span>

<span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
    <span class="hljs-comment">// Complete the constructor, update, and collide methods</span>
    <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Monster</span> </span>{
      <span class="hljs-keyword">constructor</span>(pos, /* ... */) {}

      get type() { <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;monster&quot;</span>; }

      <span class="hljs-keyword">static</span> create(pos) {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Monster(pos.plus(<span class="hljs-keyword">new</span> Vec(<span class="hljs-number">0</span>, <span class="hljs-number">-1</span>)));
      }

      update(time, state) {}

      collide(state) {}
    }

    Monster.prototype.size = <span class="hljs-keyword">new</span> Vec(<span class="hljs-number">1.2</span>, <span class="hljs-number">2</span>);

    levelChars[<span class="hljs-string">&quot;M&quot;</span>] = Monster;

    runLevel(<span class="hljs-keyword">new</span> Level(<span class="hljs-string">`
..................................
.################################.
.#..............................#.
.#..............................#.
.#..............................#.
.#...........................o..#.
.#..@...........................#.
.##########..............########.
..........#..o..o..o..o..#........
..........#...........M..#........
..........################........
..................................
`</span>), DOMDisplay);
  </span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="15.html" class="navigation navigation-prev " aria-label="Previous page: 十五、处理事件">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="17.html" class="navigation navigation-next " aria-label="Next page: 十七、在画布上绘图">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十六、项目：平台游戏","level":"1.18","depth":1,"next":{"title":"十七、在画布上绘图","level":"1.19","depth":1,"path":"17.md","ref":"17.md","articles":[]},"previous":{"title":"十五、处理事件","level":"1.17","depth":1,"path":"15.md","ref":"15.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"16.md","mtime":"2019-12-08T16:07:04.987Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

