
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十九、项目：像素艺术编辑器 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="20.html" />
    
    
    <link rel="prev" href="18.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >十九、项目：像素艺术编辑器</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x4E5D;&#x3001;&#x9879;&#x76EE;&#xFF1A;&#x50CF;&#x7D20;&#x827A;&#x672F;&#x7F16;&#x8F91;&#x5668;">&#x5341;&#x4E5D;&#x3001;&#x9879;&#x76EE;&#xFF1A;&#x50CF;&#x7D20;&#x827A;&#x672F;&#x7F16;&#x8F91;&#x5668;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/19_paint.html" target="_blank">Project: A Pixel Art Editor</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x6211;&#x770B;&#x7740;&#x773C;&#x524D;&#x7684;&#x8BB8;&#x591A;&#x989C;&#x8272;&#x3002; &#x6211;&#x770B;&#x7740;&#x6211;&#x7684;&#x7A7A;&#x767D;&#x753B;&#x5E03;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x989C;&#x8272;&#xFF0C;&#x5C31;&#x50CF;&#x5F62;&#x6210;&#x8BD7;&#x6B4C;&#x7684;&#x8BCD;&#x8BED;&#xFF0C;&#x5C31;&#x50CF;&#x5851;&#x9020;&#x97F3;&#x4E50;&#x7684;&#x97F3;&#x7B26;&#x3002;</p>
<p>Joan Miro</p>
</blockquote>
<p><img src="img/19-0.jpg" alt=""></p>
<p>&#x524D;&#x9762;&#x51E0;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x6784;&#x5EFA;&#x57FA;&#x672C;&#x7684; Web &#x5E94;&#x7528;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x3002; &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x5C06;&#x662F;&#x50CF;&#x7D20;&#x7ED8;&#x56FE;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x64CD;&#x7EB5;&#x653E;&#x5927;&#x89C6;&#x56FE;&#xFF08;&#x6B63;&#x65B9;&#x5F62;&#x5F69;&#x8272;&#x7F51;&#x683C;&#xFF09;&#xFF0C;&#x6765;&#x9010;&#x50CF;&#x7D20;&#x4FEE;&#x6539;&#x56FE;&#x50CF;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x6253;&#x5F00;&#x56FE;&#x50CF;&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x9F20;&#x6807;&#x6216;&#x5176;&#x4ED6;&#x6307;&#x9488;&#x8BBE;&#x5907;&#x5728;&#x5B83;&#x4EEC;&#x4E0A;&#x9762;&#x6D82;&#x753B;&#x5E76;&#x4FDD;&#x5B58;&#x3002; &#x8FD9;&#x662F;&#x5B83;&#x7684;&#x6837;&#x5B50;&#xFF1A;</p>
<p><img src="img/19-1.png" alt=""></p>
<p>&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7ED8;&#x753B;&#x5F88;&#x68D2;&#x3002; &#x4F60;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x6750;&#x6599;&#xFF0C;&#x6280;&#x80FD;&#x6216;&#x5929;&#x8D4B;&#x3002; &#x4F60;&#x53EA;&#x9700;&#x8981;&#x5F00;&#x59CB;&#x6D82;&#x753B;&#x3002;</p>
<h2 id="&#x7EC4;&#x4EF6;">&#x7EC4;&#x4EF6;</h2>
<p>&#x5E94;&#x7528;&#x7684;&#x754C;&#x9762;&#x5728;&#x9876;&#x90E8;&#x663E;&#x793A;&#x5927;&#x7684;<code>&lt;canvas&gt;</code>&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x5B83;&#x4E0B;&#x9762;&#x6709;&#x8BB8;&#x591A;&#x8868;&#x5355;&#x5B57;&#x6BB5;&#x3002; &#x7528;&#x6237;&#x901A;&#x8FC7;&#x4ECE;<code>&lt;select&gt;</code>&#x5B57;&#x6BB5;&#x4E2D;&#x9009;&#x62E9;&#x5DE5;&#x5177;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#xFF0C;&#x89E6;&#x6478;&#x6216;&#x62D6;&#x52A8;&#x753B;&#x5E03;&#x6765;&#x7ED8;&#x5236;&#x56FE;&#x7247;&#x3002; &#x6709;&#x7528;&#x4E8E;&#x7ED8;&#x5236;&#x5355;&#x4E2A;&#x50CF;&#x7D20;&#x6216;&#x77E9;&#x5F62;&#xFF0C;&#x586B;&#x5145;&#x533A;&#x57DF;&#x4EE5;&#x53CA;&#x4ECE;&#x56FE;&#x7247;&#x4E2D;&#x9009;&#x53D6;&#x989C;&#x8272;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x7F16;&#x8F91;&#x5668;&#x754C;&#x9762;&#x6784;&#x5EFA;&#x4E3A;&#x591A;&#x4E2A;&#x7EC4;&#x4EF6;&#x548C;&#x5BF9;&#x8C61;&#xFF0C;&#x8D1F;&#x8D23; DOM &#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5728;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7684;&#x72B6;&#x6001;&#x7531;&#x5F53;&#x524D;&#x56FE;&#x7247;&#xFF0C;&#x6240;&#x9009;&#x5DE5;&#x5177;&#x548C;&#x6240;&#x9009;&#x989C;&#x8272;&#x7EC4;&#x6210;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5EFA;&#x7ACB;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4EE5;&#x4FBF;&#x72B6;&#x6001;&#x5B58;&#x5728;&#x4E8E;&#x5355;&#x4E00;&#x7684;&#x503C;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x603B;&#x662F;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x4E0B;&#x4ED6;&#x4EEC;&#x770B;&#x4E0A;&#x53BB;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF1A;&#x5C06;&#x72B6;&#x6001;&#x7247;&#x6BB5;&#x5206;&#x914D;&#x7ED9;&#x6574;&#x4E2A;&#x754C;&#x9762;&#x3002; &#x76F4;&#x5230;&#x67D0;&#x4E2A;&#x65F6;&#x671F;&#xFF0C;&#x8FD9;&#x66F4;&#x5BB9;&#x6613;&#x7F16;&#x5199;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x653E;&#x5165;&#x989C;&#x8272;&#x5B57;&#x6BB5;&#xFF0C;&#x5E76;&#x5728;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5F53;&#x524D;&#x989C;&#x8272;&#x65F6;&#x8BFB;&#x53D6;&#x5176;&#x503C;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x989C;&#x8272;&#x9009;&#x62E9;&#x5668;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x8BA9;&#x4F60;&#x5355;&#x51FB;&#x56FE;&#x7247;&#x6765;&#x9009;&#x62E9;&#x7ED9;&#x5B9A;&#x50CF;&#x7D20;&#x7684;&#x989C;&#x8272;&#x3002; &#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x989C;&#x8272;&#x5B57;&#x6BB5;&#x663E;&#x793A;&#x6B63;&#x786E;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x8BE5;&#x5DE5;&#x5177;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x5B83;&#x5B58;&#x5728;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x6B21;&#x9009;&#x62E9;&#x65B0;&#x989C;&#x8272;&#x65F6;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6DFB;&#x52A0;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x8BA9;&#x989C;&#x8272;&#x53EF;&#x89C1;&#x7684;&#x5730;&#x65B9;&#xFF08;&#x4E5F;&#x8BB8;&#x9F20;&#x6807;&#x5149;&#x6807;&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x5B83;&#xFF09;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x66F4;&#x65B0;&#x4F60;&#x7684;&#x6539;&#x53D8;&#x989C;&#x8272;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x4FDD;&#x6301;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x754C;&#x9762;&#x7684;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x6A21;&#x5757;&#x5316;&#x7684;&#x3002; &#x5BF9;&#x4E8E;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x5C0F;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E0D;&#x6210;&#x95EE;&#x9898;&#x3002; &#x5BF9;&#x4E8E;&#x66F4;&#x5927;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x53D8;&#x6210;&#x771F;&#x6B63;&#x7684;&#x5669;&#x68A6;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x5728;&#x539F;&#x5219;&#x4E0A;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x5669;&#x68A6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5BF9;&#x6570;&#x636E;&#x6D41;&#x975E;&#x5E38;&#x4E25;&#x683C;&#x3002; &#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x754C;&#x9762;&#x6839;&#x636E;&#x8BE5;&#x72B6;&#x6001;&#x7ED8;&#x5236;&#x3002; &#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x65B0;&#x72B6;&#x6001;&#x6765;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x52A8;&#x4F5C;&#xFF0C;&#x6B64;&#x65F6;&#x7EC4;&#x4EF6;&#x6709;&#x673A;&#x4F1A;&#x4E0E;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x7684;&#x5EFA;&#x7ACB;&#xFF0C;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x5B83;&#x8FD8;&#x4F1A;&#x901A;&#x77E5;&#x5B83;&#x7684;&#x5B50;&#x7EC4;&#x4EF6;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x3002; &#x5EFA;&#x7ACB;&#x8FD9;&#x4E2A;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#x3002; &#x8BA9;&#x8FD9;&#x4E2A;&#x66F4;&#x65B9;&#x4FBF;&#x662F;&#x8BB8;&#x591A;&#x6D4F;&#x89C8;&#x5668;&#x7F16;&#x7A0B;&#x5E93;&#x7684;&#x4E3B;&#x8981;&#x5356;&#x70B9;&#x3002; &#x4F46;&#x5BF9;&#x4E8E;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x66F4;&#x65B0;&#x8868;&#x793A;&#x4E3A;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x79F0;&#x4E3A;&#x52A8;&#x4F5C;&#x3002; &#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x52A8;&#x4F5C;&#x5E76;&#x5206;&#x6D3E;&#x5B83;&#x4EEC; - &#x5C06;&#x5B83;&#x4EEC;&#x7ED9;&#x4E88;&#x4E2D;&#x592E;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x51FD;&#x6570;&#x3002; &#x8BE5;&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x4E0B;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x4E4B;&#x540E;&#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x5C06;&#x81EA;&#x5DF1;&#x66F4;&#x65B0;&#x4E3A;&#x8FD9;&#x4E2A;&#x65B0;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x6DF7;&#x4E71;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x754C;&#x9762;&#x5E76;&#x5BF9;&#x5176;&#x5E94;&#x7528;&#x4E00;&#x4E9B;&#x7ED3;&#x6784;&#x3002; &#x5C3D;&#x7BA1;&#x4E0E; DOM &#x76F8;&#x5173;&#x7684;&#x90E8;&#x5206;&#x4ECD;&#x7136;&#x5145;&#x6EE1;&#x4E86;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7531;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x4E0A;&#x7B80;&#x5355;&#x7684;&#x4E3B;&#x5E72;&#x652F;&#x6491; - &#x72B6;&#x6001;&#x66F4;&#x65B0;&#x5FAA;&#x73AF;&#x3002; &#x72B6;&#x6001;&#x51B3;&#x5B9A;&#x4E86; DOM &#x7684;&#x5916;&#x89C2;&#xFF0C;&#x800C; DOM &#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x72B6;&#x6001;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x5411;&#x72B6;&#x6001;&#x5206;&#x6D3E;&#x52A8;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x8BB8;&#x591A;&#x53D8;&#x79CD;&#xFF0C;&#x6BCF;&#x4E2A;&#x53D8;&#x79CD;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x597D;&#x5904;&#x548C;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x4E2D;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF1A;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x6E20;&#x9053;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x904D;&#x5E03;&#x6574;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x7EC4;&#x4EF6;&#x5C06;&#x662F;&#x4E0E;&#x754C;&#x9762;&#x4E00;&#x81F4;&#x7684;&#x7C7B;&#x3002; &#x4ED6;&#x4EEC;&#x7684;&#x6784;&#x9020;&#x5668;&#x88AB;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x72B6;&#x6001;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x4E00;&#x4E9B;&#x8F83;&#x5C0F;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;<code>dom</code>&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8868;&#x793A;&#x7EC4;&#x4EF6;&#x7684; DOM&#x3002; &#x5927;&#x591A;&#x6570;&#x6784;&#x9020;&#x5668;&#x8FD8;&#x4F1A;&#x63A5;&#x53D7;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x503C;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x4E0D;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x800C;&#x6539;&#x53D8;&#xFF0C;&#x4F8B;&#x5982;&#x5B83;&#x4EEC;&#x53EF;&#x7528;&#x4E8E;&#x5206;&#x6D3E;&#x64CD;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x90FD;&#x6709;&#x4E00;&#x4E2A;<code>setState</code>&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x5176;&#x540C;&#x6B65;&#x5230;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x503C;&#x3002; &#x8BE5;&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E0E;&#x6784;&#x9020;&#x5668;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;</p>
<h2 id="&#x72B6;&#x6001;">&#x72B6;&#x6001;</h2>
<p>&#x5E94;&#x7528;&#x72B6;&#x6001;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x56FE;&#x7247;&#xFF0C;&#x5DE5;&#x5177;&#x548C;&#x989C;&#x8272;&#x5C5E;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#x3002; &#x56FE;&#x7247;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B58;&#x50A8;&#x56FE;&#x7247;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x50CF;&#x7D20;&#x5185;&#x5BB9;&#x3002; &#x50CF;&#x7D20;&#x9010;&#x884C;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x65B9;&#x5F0F;&#x4E0E;&#x7B2C; 6 &#x7AE0;&#x4E2D;&#x7684;&#x77E9;&#x9635;&#x7C7B;&#x76F8;&#x540C;&#xFF0C;&#x6309;&#x884C;&#x5B58;&#x50A8;&#xFF0C;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Picture</span> </span>{
  <span class="hljs-keyword">constructor</span>(width, height, pixels) {
    <span class="hljs-keyword">this</span>.width = width;
    <span class="hljs-keyword">this</span>.height = height;
    <span class="hljs-keyword">this</span>.pixels = pixels;
  }
  <span class="hljs-keyword">static</span> empty(width, height, color) {
    <span class="hljs-keyword">let</span> pixels = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Array</span>(width * height).fill(color);
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Picture(width, height, pixels);
  }
  pixel(x, y) {
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.pixels[x + y * <span class="hljs-keyword">this</span>.width];
  }
  draw(pixels) {
    <span class="hljs-keyword">let</span> copy = <span class="hljs-keyword">this</span>.pixels.slice();
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> {x, y, color} <span class="hljs-keyword">of</span> pixels) {
      copy[x + y * <span class="hljs-keyword">this</span>.width] = color;
    }
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Picture(<span class="hljs-keyword">this</span>.width, <span class="hljs-keyword">this</span>.height, copy);
  }
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5C06;&#x56FE;&#x7247;&#x5F53;&#x505A;&#x4E0D;&#x53D8;&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x540E;&#x9762;&#x56DE;&#x987E;&#x5176;&#x539F;&#x56E0;&#x3002; &#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x4E5F;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x66F4;&#x65B0;&#x5927;&#x91CF;&#x50CF;&#x7D20;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BE5;&#x7C7B;&#x6709;<code>draw</code>&#x65B9;&#x6CD5;&#xFF0C;&#x63A5;&#x53D7;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x50CF;&#x7D20;&#xFF08;&#x5177;&#x6709;<code>x</code>&#xFF0C;<code>y</code>&#x548C;<code>color</code>&#x5C5E;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8986;&#x76D6;&#x8FD9;&#x4E9B;&#x50CF;&#x7D20;&#x7684;&#x65B0;&#x56FE;&#x50CF;&#x3002; &#x6B64;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x7684;<code>slice</code>&#x6765;&#x590D;&#x5236;&#x6574;&#x4E2A;&#x50CF;&#x7D20;&#x6570;&#x7EC4; - &#x5207;&#x7247;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x9ED8;&#x8BA4;&#x4E3A; 0&#xFF0C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x4E3A;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p><code>empty</code>&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x4EE5;&#x524D;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x7684;&#x4E24;&#x4E2A;&#x6570;&#x7EC4;&#x529F;&#x80FD;&#x3002; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x8C03;&#x7528;<code>Array</code>&#x6784;&#x9020;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x7ED9;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x7A7A;&#x6570;&#x7EC4;&#x3002; &#x7136;&#x540E;<code>fill</code>&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4F7F;&#x7528;&#x7ED9;&#x5B9A;&#x503C;&#x586B;&#x5145;&#x6570;&#x7EC4;&#x3002; &#x8FD9;&#x4E9B;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6240;&#x6709;&#x50CF;&#x7D20;&#x5177;&#x6709;&#x76F8;&#x540C;&#x989C;&#x8272;&#x3002;</p>
<p>&#x989C;&#x8272;&#x5B58;&#x50A8;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5305;&#x542B;&#x4F20;&#x7EDF; CSS &#x989C;&#x8272;&#x4EE3;&#x7801; - &#x4E00;&#x4E2A;&#x4E95;&#x53F7;&#xFF08;<code>#</code>&#xFF09;&#xFF0C;&#x540E;&#x8DDF;&#x516D;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x4E24;&#x4E2A;&#x7528;&#x4E8E;&#x7EA2;&#x8272;&#x5206;&#x91CF;&#xFF0C;&#x4E24;&#x4E2A;&#x7528;&#x4E8E;&#x7EFF;&#x8272;&#x5206;&#x91CF;&#xFF0C;&#x4E24;&#x4E2A;&#x7528;&#x4E8E;&#x84DD;&#x8272;&#x5206;&#x91CF;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x70B9;&#x795E;&#x79D8;&#x800C;&#x4E0D;&#x65B9;&#x4FBF;&#x7684;&#x989C;&#x8272;&#x7F16;&#x5199;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5B83;&#x662F; HTML &#x989C;&#x8272;&#x8F93;&#x5165;&#x5B57;&#x6BB5;&#x4F7F;&#x7528;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;<code>canva</code>s&#x7ED8;&#x56FE;&#x4E0A;&#x4E0B;&#x6587;&#x7684;<code>fillColor</code>&#x5C5E;&#x6027;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x8DB3;&#x591F;&#x5B9E;&#x7528;&#x3002;</p>
<p>&#x6240;&#x6709;&#x5206;&#x91CF;&#x90FD;&#x4E3A;&#x96F6;&#x7684;&#x9ED1;&#x8272;&#x5199;&#x6210;<code>&quot;#000000&quot;</code>&#xFF0C;&#x4EAE;&#x7C89;&#x8272;&#x770B;&#x8D77;&#x6765;&#x50CF;<code>#ff00ff&quot;</code>&#xFF0C;&#x5176;&#x4E2D;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#x5206;&#x91CF;&#x7684;&#x6700;&#x5927;&#x503C;&#x4E3A; 255&#xFF0C;&#x4EE5;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x5199;&#x4E3A;<code>ff</code>&#xFF08;<code>a</code>&#x5230;<code>f</code>&#x7528;&#x4F5C;&#x6570;&#x5B57; 10 &#x5230; 15&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x5141;&#x8BB8;&#x754C;&#x9762;&#x5C06;&#x52A8;&#x4F5C;&#x5206;&#x6D3E;&#x4E3A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x662F;&#x5C5E;&#x6027;&#x8986;&#x76D6;&#x5148;&#x524D;&#x72B6;&#x6001;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5F53;&#x7528;&#x6237;&#x6539;&#x53D8;&#x989C;&#x8272;&#x5B57;&#x6BB5;&#x65F6;&#xFF0C;&#x989C;&#x8272;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x5206;&#x6D3E;&#x50CF;<code>{color: field.value}</code>&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">updateState</span>(<span class="hljs-params">state, action</span>) </span>{
  <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.assign({}, state, action);
}
</code></pre>
<p>&#x8FD9;&#x662F;&#x76F8;&#x5F53;&#x9EBB;&#x70E6;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;<code>Object.assign</code>&#x7528;&#x4E8E;&#x9996;&#x5148;&#x5C06;&#x72B6;&#x6001;&#x5C5E;&#x6027;&#x6DFB;&#x52A0;&#x5230;&#x7A7A;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x6765;&#x81EA;&#x52A8;&#x4F5C;&#x7684;&#x5C5E;&#x6027;&#x8986;&#x76D6;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x5728;&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x7684; JavaScript &#x4EE3;&#x7801;&#x4E2D;&#x5F88;&#x5E38;&#x89C1;&#x3002; &#x4E00;&#x4E2A;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x8868;&#x793A;&#x6CD5;&#x5904;&#x4E8E;&#x6807;&#x51C6;&#x5316;&#x7684;&#x6700;&#x540E;&#x9636;&#x6BB5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x5BF9;&#x8C61;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;&#x4E09;&#x70B9;&#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x5305;&#x542B;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x3002; &#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x8865;&#x5145;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5199;&#x51FA;<code>{...state, ...action}</code>&#x3002; &#x5728;&#x64B0;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;&#x8FD9;&#x8FD8;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x3002;</p>
<h2 id="dom-&#x7684;&#x6784;&#x5EFA;">DOM &#x7684;&#x6784;&#x5EFA;</h2>
<p>&#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x505A;&#x7684;&#x4E3B;&#x8981;&#x4E8B;&#x60C5;&#x4E4B;&#x4E00;&#x662F;&#x521B;&#x5EFA; DOM &#x7ED3;&#x6784;&#x3002; &#x6211;&#x4EEC;&#x518D;&#x4E5F;&#x4E0D;&#x60F3;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5197;&#x957F;&#x7684; DOM &#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x662F;<code>elt</code>&#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x7A0D;&#x5FAE;&#x6269;&#x5C55;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">elt</span>(<span class="hljs-params">type, props, ...children</span>) </span>{
  <span class="hljs-keyword">let</span> dom = <span class="hljs-built_in">document</span>.createElement(type);
  <span class="hljs-keyword">if</span> (props) <span class="hljs-built_in">Object</span>.assign(dom, props);
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> child <span class="hljs-keyword">of</span> children) {
    <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> child != <span class="hljs-string">&quot;string&quot;</span>) dom.appendChild(child);
    <span class="hljs-keyword">else</span> dom.appendChild(<span class="hljs-built_in">document</span>.createTextNode(child));
  }
  <span class="hljs-keyword">return</span> dom;
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 16 &#x7AE0;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x7248;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5C06;&#x5C5E;&#x6027;&#xFF08;property&#xFF09;&#x5206;&#x914D;&#x7ED9; DOM &#x8282;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C5E;&#x6027;&#xFF08;attribute&#xFF09;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7528;&#x5B83;&#x6765;&#x8BBE;&#x7F6E;&#x4EFB;&#x610F;&#x5C5E;&#x6027;&#xFF08;attribute&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x8BBE;&#x7F6E;&#x503C;&#x4E0D;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5C5E;&#x6027;&#xFF08;property&#xFF09;&#xFF0C;&#x6BD4;&#x5982;<code>onclick</code>&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6765;&#x6CE8;&#x518C;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x3002;</p>
<p>&#x8FD9;&#x5141;&#x8BB8;&#x8FD9;&#x79CD;&#x6CE8;&#x518C;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-js">&lt;body&gt;
  &lt;script&gt;
    document.body.appendChild(elt(&quot;button&quot;, {
      onclick: () =&gt; console.log(&quot;click&quot;)
    }, &quot;The button&quot;));
  &lt;/script&gt;
&lt;/body&gt;
</code></pre>
<h2 id="&#x753B;&#x5E03;">&#x753B;&#x5E03;</h2>
<p>&#x6211;&#x4EEC;&#x8981;&#x5B9A;&#x4E49;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x662F;&#x754C;&#x9762;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x5C06;&#x56FE;&#x7247;&#x663E;&#x793A;&#x4E3A;&#x5F69;&#x8272;&#x6846;&#x7684;&#x7F51;&#x683C;&#x3002; &#x8BE5;&#x7EC4;&#x4EF6;&#x8D1F;&#x8D23;&#x4E24;&#x4EF6;&#x4E8B;&#xFF1A;&#x663E;&#x793A;&#x56FE;&#x7247;&#x5E76;&#x5C06;&#x8BE5;&#x56FE;&#x7247;&#x4E0A;&#x7684;&#x6307;&#x9488;&#x4E8B;&#x4EF6;&#x4F20;&#x7ED9;&#x5E94;&#x7528;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5B9A;&#x4E49;&#x4E3A;&#x4EC5;&#x4E86;&#x89E3;&#x5F53;&#x524D;&#x56FE;&#x7247;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x72B6;&#x6001;&#x7684;&#x7EC4;&#x4EF6;&#x3002; &#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x77E5;&#x9053;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x53D1;&#x9001;&#x64CD;&#x4F5C;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5F53;&#x54CD;&#x5E94;&#x6307;&#x9488;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8C03;&#x7528;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x63D0;&#x4F9B;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5C06;&#x5904;&#x7406;&#x5E94;&#x7528;&#x7684;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> scale = <span class="hljs-number">10</span>;

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PictureCanvas</span> </span>{
  <span class="hljs-keyword">constructor</span>(picture, pointerDown) {
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;canvas&quot;</span>, {
      onmousedown: event =&gt; <span class="hljs-keyword">this</span>.mouse(event, pointerDown),
      ontouchstart: event =&gt; <span class="hljs-keyword">this</span>.touch(event, pointerDown)
    });
    drawPicture(picture, <span class="hljs-keyword">this</span>.dom, scale);
  }
  setState(picture) {
    <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.picture == picture) <span class="hljs-keyword">return</span>;
    <span class="hljs-keyword">this</span>.picture = picture;
    drawPicture(<span class="hljs-keyword">this</span>.picture, <span class="hljs-keyword">this</span>.dom, scale);
  }
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x7ED8;&#x5236;&#x6210;&#x4E00;&#x4E2A;<code>10x10</code>&#x7684;&#x6B63;&#x65B9;&#x5F62;&#xFF0C;&#x7531;&#x6BD4;&#x4F8B;&#x5E38;&#x6570;&#x51B3;&#x5B9A;&#x3002; &#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BE5;&#x7EC4;&#x4EF6;&#x4F1A;&#x8DDF;&#x8E2A;&#x5176;&#x5F53;&#x524D;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x5F53;&#x5C06;<code>setState</code>&#x8D4B;&#x4E88;&#x65B0;&#x56FE;&#x7247;&#x65F6;&#x624D;&#x4F1A;&#x91CD;&#x7ED8;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x7684;&#x7ED8;&#x56FE;&#x529F;&#x80FD;&#x6839;&#x636E;&#x6BD4;&#x4F8B;&#x548C;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x753B;&#x5E03;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x6B63;&#x65B9;&#x5F62;&#x586B;&#x5145;&#x5B83;&#xFF0C;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x4E00;&#x4E2A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">drawPicture</span>(<span class="hljs-params">picture, canvas, scale</span>) </span>{
  canvas.width = picture.width * scale;
  canvas.height = picture.height * scale;
  <span class="hljs-keyword">let</span> cx = canvas.getContext(<span class="hljs-string">&quot;2d&quot;</span>);

  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> y = <span class="hljs-number">0</span>; y &lt; picture.height; y++) {
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> x = <span class="hljs-number">0</span>; x &lt; picture.width; x++) {
      cx.fillStyle = picture.pixel(x, y);
      cx.fillRect(x * scale, y * scale, scale, scale);
    }
  }
}
</code></pre>
<p>&#x5F53;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x5728;&#x56FE;&#x7247;&#x753B;&#x5E03;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x6309;&#x4E0B;&#x9F20;&#x6807;&#x5DE6;&#x952E;&#x65F6;&#xFF0C;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;<code>pointerDown</code>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x63D0;&#x4F9B;&#x88AB;&#x70B9;&#x51FB;&#x56FE;&#x7247;&#x5750;&#x6807;&#x7684;&#x50CF;&#x7D20;&#x4F4D;&#x7F6E;&#x3002; &#x8FD9;&#x5C06;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x9F20;&#x6807;&#x4E0E;&#x56FE;&#x7247;&#x7684;&#x4EA4;&#x4E92;&#x3002; &#x56DE;&#x8C03;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x4F1A;&#x8FD4;&#x56DE;&#x53E6;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x6309;&#x4E0B;&#x6309;&#x94AE;&#x5E76;&#x4E14;&#x5C06;&#x6307;&#x9488;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x65F6;&#x5F97;&#x5230;&#x901A;&#x77E5;&#x3002;</p>
<pre><code class="lang-js">PictureCanvas.prototype.mouse = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">downEvent, onDown</span>) </span>{
  <span class="hljs-keyword">if</span> (downEvent.button != <span class="hljs-number">0</span>) <span class="hljs-keyword">return</span>;
  <span class="hljs-keyword">let</span> pos = pointerPosition(downEvent, <span class="hljs-keyword">this</span>.dom);
  <span class="hljs-keyword">let</span> onMove = onDown(pos);
  <span class="hljs-keyword">if</span> (!onMove) <span class="hljs-keyword">return</span>;
  <span class="hljs-keyword">let</span> move = moveEvent =&gt; {
    <span class="hljs-keyword">if</span> (moveEvent.buttons == <span class="hljs-number">0</span>) {
      <span class="hljs-keyword">this</span>.dom.removeEventListener(<span class="hljs-string">&quot;mousemove&quot;</span>, move);
    } <span class="hljs-keyword">else</span> {
      <span class="hljs-keyword">let</span> newPos = pointerPosition(moveEvent, <span class="hljs-keyword">this</span>.dom);
      <span class="hljs-keyword">if</span> (newPos.x == pos.x &amp;&amp; newPos.y == pos.y) <span class="hljs-keyword">return</span>;
      pos = newPos;
      onMove(newPos);
    }
  };
  <span class="hljs-keyword">this</span>.dom.addEventListener(<span class="hljs-string">&quot;mousemove&quot;</span>, move);
};

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">pointerPosition</span>(<span class="hljs-params">pos, domNode</span>) </span>{
  <span class="hljs-keyword">let</span> rect = domNode.getBoundingClientRect();
  <span class="hljs-keyword">return</span> {x: <span class="hljs-built_in">Math</span>.floor((pos.clientX - rect.left) / scale),
          y: <span class="hljs-built_in">Math</span>.floor((pos.clientY - rect.top) / scale)};
}
</code></pre>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x50CF;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>getBoundingClientRect</code>&#x6765;&#x67E5;&#x627E;&#x753B;&#x5E03;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5C06;&#x9F20;&#x6807;&#x4E8B;&#x4EF6;&#x5750;&#x6807;&#xFF08;<code>clientX</code>&#x548C;<code>clientY</code>&#xFF09;&#x8F6C;&#x6362;&#x4E3A;&#x56FE;&#x7247;&#x5750;&#x6807;&#x3002; &#x5B83;&#x4EEC;&#x603B;&#x662F;&#x5411;&#x4E0B;&#x53D6;&#x820D;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x4EEC;&#x6307;&#x4EE3;&#x7279;&#x5B9A;&#x7684;&#x50CF;&#x7D20;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x505A;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x5728;<code>&quot;touchstart&quot;</code>&#x4E8B;&#x4EF6;&#x4E2D;&#x8C03;&#x7528;<code>preventDefault</code>&#x4EE5;&#x9632;&#x6B62;&#x6ED1;&#x52A8;&#x3002;</p>
<pre><code class="lang-js">PictureCanvas.prototype.touch = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">startEvent,
                                         onDown</span>) </span>{
  <span class="hljs-keyword">let</span> pos = pointerPosition(startEvent.touches[<span class="hljs-number">0</span>], <span class="hljs-keyword">this</span>.dom);
  <span class="hljs-keyword">let</span> onMove = onDown(pos);
  startEvent.preventDefault();
  <span class="hljs-keyword">if</span> (!onMove) <span class="hljs-keyword">return</span>;
  <span class="hljs-keyword">let</span> move = moveEvent =&gt; {
    <span class="hljs-keyword">let</span> newPos = pointerPosition(moveEvent.touches[<span class="hljs-number">0</span>],
                                 <span class="hljs-keyword">this</span>.dom);
    <span class="hljs-keyword">if</span> (newPos.x == pos.x &amp;&amp; newPos.y == pos.y) <span class="hljs-keyword">return</span>;
    pos = newPos;
    onMove(newPos);
  };
  <span class="hljs-keyword">let</span> end = () =&gt; {
    <span class="hljs-keyword">this</span>.dom.removeEventListener(<span class="hljs-string">&quot;touchmove&quot;</span>, move);
    <span class="hljs-keyword">this</span>.dom.removeEventListener(<span class="hljs-string">&quot;touchend&quot;</span>, end);
  };
  <span class="hljs-keyword">this</span>.dom.addEventListener(<span class="hljs-string">&quot;touchmove&quot;</span>, move);
  <span class="hljs-keyword">this</span>.dom.addEventListener(<span class="hljs-string">&quot;touchend&quot;</span>, end);
};
</code></pre>
<p>&#x5BF9;&#x4E8E;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#xFF0C;<code>clientX</code>&#x548C;<code>clientY</code>&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5728;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;<code>touches</code>&#x5C5E;&#x6027;&#x4E2D;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x89E6;&#x6478;&#x5BF9;&#x8C61;&#x7684;&#x5750;&#x6807;&#x3002;</p>
<h2 id="&#x5E94;&#x7528;">&#x5E94;&#x7528;</h2>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x9010;&#x6B65;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E3B;&#x8981;&#x7EC4;&#x4EF6;&#x5B9E;&#x73B0;&#x4E3A;&#x753B;&#x5E03;&#x5468;&#x56F4;&#x7684;&#x5916;&#x58F3;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x7EC4;&#x52A8;&#x6001;&#x5DE5;&#x5177;&#x548C;&#x63A7;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x6784;&#x9020;&#x5668;&#x3002;</p>
<p>&#x63A7;&#x4EF6;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x56FE;&#x7247;&#x4E0B;&#x65B9;&#x7684;&#x754C;&#x9762;&#x5143;&#x7D20;&#x3002; &#x5B83;&#x4EEC;&#x4E3A;&#x7EC4;&#x4EF6;&#x6784;&#x9020;&#x5668;&#x7684;&#x6570;&#x7EC4;&#x800C;&#x63D0;&#x4F9B;&#x3002;</p>
<p>&#x5DE5;&#x5177;&#x662F;&#x7ED8;&#x5236;&#x50CF;&#x7D20;&#x6216;&#x586B;&#x5145;&#x533A;&#x57DF;&#x7684;&#x4E1C;&#x897F;&#x3002; &#x8BE5;&#x5E94;&#x7528;&#x5C06;&#x4E00;&#x7EC4;&#x53EF;&#x7528;&#x5DE5;&#x5177;&#x663E;&#x793A;&#x4E3A;<code>&lt;select&gt;</code>&#x5B57;&#x6BB5;&#x3002; &#x5F53;&#x524D;&#x9009;&#x62E9;&#x7684;&#x5DE5;&#x5177;&#x51B3;&#x5B9A;&#x4E86;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x8BBE;&#x5907;&#x4E0E;&#x56FE;&#x7247;&#x4EA4;&#x4E92;&#x65F6;&#xFF0C;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002; &#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x800C;&#x63D0;&#x4F9B;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x5C06;&#x51FA;&#x73B0;&#x5728;&#x4E0B;&#x62C9;&#x5B57;&#x6BB5;&#x4E2D;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x6620;&#x5C04;&#x5230;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x51FD;&#x6570;&#x3002; &#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x56FE;&#x7247;&#x4F4D;&#x7F6E;&#xFF0C;&#x5F53;&#x524D;&#x5E94;&#x7528;&#x72B6;&#x6001;&#x548C;<code>dispatch</code>&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002; &#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5F53;&#x6307;&#x9488;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x65B0;&#x4F4D;&#x7F6E;&#x548C;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PixelEditor</span> </span>{
  <span class="hljs-keyword">constructor</span>(state, config) {
    <span class="hljs-keyword">let</span> {tools, controls, dispatch} = config;
    <span class="hljs-keyword">this</span>.state = state;

    <span class="hljs-keyword">this</span>.canvas = <span class="hljs-keyword">new</span> PictureCanvas(state.picture, pos =&gt; {
      <span class="hljs-keyword">let</span> tool = tools[<span class="hljs-keyword">this</span>.state.tool];
      <span class="hljs-keyword">let</span> onMove = tool(pos, <span class="hljs-keyword">this</span>.state, dispatch);
      <span class="hljs-keyword">if</span> (onMove) <span class="hljs-keyword">return</span> pos =&gt; onMove(pos, <span class="hljs-keyword">this</span>.state);
    });
    <span class="hljs-keyword">this</span>.controls = controls.map(
      Control =&gt; <span class="hljs-keyword">new</span> Control(state, config));
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;div&quot;</span>, {}, <span class="hljs-keyword">this</span>.canvas.dom, elt(<span class="hljs-string">&quot;br&quot;</span>),
                   ...this.controls.reduce(
                     (a, c) =&gt; a.concat(<span class="hljs-string">&quot; &quot;</span>, c.dom), []));
  }
  setState(state) {
    <span class="hljs-keyword">this</span>.state = state;
    <span class="hljs-keyword">this</span>.canvas.setState(state.picture);
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> ctrl <span class="hljs-keyword">of</span> <span class="hljs-keyword">this</span>.controls) ctrl.setState(state);
  }
}
</code></pre>
<p>&#x6307;&#x5B9A;&#x7ED9;<code>PictureCanvas</code>&#x7684;&#x6307;&#x9488;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x4F7F;&#x7528;&#x9002;&#x5F53;&#x7684;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x5F53;&#x524D;&#x9009;&#x5B9A;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5982;&#x679C;&#x8FD4;&#x56DE;&#x4E86;&#x79FB;&#x52A8;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x4F7F;&#x5176;&#x4E5F;&#x63A5;&#x6536;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6240;&#x6709;&#x63A7;&#x4EF6;&#x5728;<code>this.controls</code>&#x4E2D;&#x6784;&#x9020;&#x5E76;&#x5B58;&#x50A8;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x5E94;&#x7528;&#x72B6;&#x6001;&#x66F4;&#x6539;&#x65F6;&#x66F4;&#x65B0;&#x5B83;&#x4EEC;&#x3002; <code>reduce</code>&#x7684;&#x8C03;&#x7528;&#x4F1A;&#x5728;&#x63A7;&#x4EF6;&#x7684; DOM &#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x5F15;&#x5165;&#x7A7A;&#x683C;&#x3002; &#x8FD9;&#x6837;&#x4ED6;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x90A3;&#x4E48;&#x5BC6;&#x96C6;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x63A7;&#x4EF6;&#x662F;&#x5DE5;&#x5177;&#x9009;&#x62E9;&#x83DC;&#x5355;&#x3002; &#x5B83;&#x521B;&#x5EFA;<code>&lt;select&gt;</code>&#x5143;&#x7D20;&#xFF0C;&#x6BCF;&#x4E2A;&#x5DE5;&#x5177;&#x5E26;&#x6709;&#x4E00;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;<code>&quot;change&quot;</code>&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x7528;&#x6237;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x5177;&#x65F6;&#x66F4;&#x65B0;&#x5E94;&#x7528;&#x72B6;&#x6001;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">ToolSelect</span> </span>{
  <span class="hljs-keyword">constructor</span>(state, {tools, dispatch}) {
    <span class="hljs-keyword">this</span>.select = elt(<span class="hljs-string">&quot;select&quot;</span>, {
      onchange: () =&gt; dispatch({tool: <span class="hljs-keyword">this</span>.select.value})
    }, ...Object.keys(tools).map(name =&gt; elt(<span class="hljs-string">&quot;option&quot;</span>, {
      selected: name == state.tool
    }, name)));
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;label&quot;</span>, <span class="hljs-literal">null</span>, <span class="hljs-string">&quot;&#x1F58C; Tool: &quot;</span>, <span class="hljs-keyword">this</span>.select);
  }
  setState(state) { <span class="hljs-keyword">this</span>.select.value = state.tool; }
}
</code></pre>
<p>&#x901A;&#x8FC7;&#x5C06;&#x6807;&#x7B7E;&#x6587;&#x672C;&#x548C;&#x5B57;&#x6BB5;&#x5305;&#x88C5;&#x5728;<code>&lt;label&gt;</code>&#x5143;&#x7D20;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x544A;&#x8BC9;&#x6D4F;&#x89C8;&#x5668;&#x8BE5;&#x6807;&#x7B7E;&#x5C5E;&#x4E8E;&#x8BE5;&#x5B57;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x6807;&#x7B7E;&#x6765;&#x805A;&#x7126;&#x8BE5;&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x80FD;&#x591F;&#x6539;&#x53D8;&#x989C;&#x8272; - &#x6240;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x63A7;&#x4EF6;&#x3002; <code>type</code>&#x5C5E;&#x6027;&#x4E3A;&#x989C;&#x8272;&#x7684; HTML <code>&lt;input&gt;</code>&#x5143;&#x7D20;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x989C;&#x8272;&#x7684;&#x8868;&#x5355;&#x5B57;&#x6BB5;&#x3002; &#x8FD9;&#x79CD;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x59CB;&#x7EC8;&#x662F;<code>&quot;#RRGGBB&quot;</code>&#x683C;&#x5F0F;&#xFF08;&#x7EA2;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272;&#x5206;&#x91CF;&#xFF0C;&#x6BCF;&#x79CD;&#x989C;&#x8272;&#x4E24;&#x4F4D;&#x6570;&#x5B57;&#xFF09;&#x7684; CSS &#x989C;&#x8272;&#x4EE3;&#x7801;&#x3002; &#x5F53;&#x7528;&#x6237;&#x4E0E;&#x5B83;&#x4EA4;&#x4E92;&#x65F6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#x9009;&#x62E9;&#x5668;&#x754C;&#x9762;&#x3002;</p>
<p>&#x8BE5;&#x63A7;&#x4EF6;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x4E0E;&#x5E94;&#x7528;&#x72B6;&#x6001;&#x7684;<code>color</code>&#x5C5E;&#x6027;&#x4FDD;&#x6301;&#x540C;&#x6B65;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">ColorSelect</span> </span>{
  <span class="hljs-keyword">constructor</span>(state, {dispatch}) {
    <span class="hljs-keyword">this</span>.input = elt(<span class="hljs-string">&quot;input&quot;</span>, {
      type: <span class="hljs-string">&quot;color&quot;</span>,
      value: state.color,
      onchange: () =&gt; dispatch({color: <span class="hljs-keyword">this</span>.input.value})
    });
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;label&quot;</span>, <span class="hljs-literal">null</span>, <span class="hljs-string">&quot;&#x1F3A8; Color: &quot;</span>, <span class="hljs-keyword">this</span>.input);
  }
  setState(state) { <span class="hljs-keyword">this</span>.input.value = state.color; }
}
</code></pre>
<h2 id="&#x7ED8;&#x56FE;&#x5DE5;&#x5177;">&#x7ED8;&#x56FE;&#x5DE5;&#x5177;</h2>
<p>&#x5728;&#x6211;&#x4EEC;&#x7ED8;&#x5236;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x6765;&#x63A7;&#x5236;&#x753B;&#x5E03;&#x4E0A;&#x7684;&#x9F20;&#x6807;&#x6216;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x6700;&#x57FA;&#x672C;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x7ED8;&#x56FE;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x4F60;&#x70B9;&#x51FB;&#x6216;&#x8F7B;&#x89E6;&#x7684;&#x4EFB;&#x4F55;&#x50CF;&#x7D20;&#xFF0C;&#x66F4;&#x6539;&#x4E3A;&#x5F53;&#x524D;&#x9009;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x3002; &#x5B83;&#x5206;&#x6D3E;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#xFF0C;&#x5C06;&#x56FE;&#x7247;&#x66F4;&#x65B0;&#x4E3A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6307;&#x7684;&#x50CF;&#x7D20;&#x8D4B;&#x4E3A;&#x5F53;&#x524D;&#x9009;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">draw</span>(<span class="hljs-params">pos, state, dispatch</span>) </span>{
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">drawPixel</span>(<span class="hljs-params">{x, y}, state</span>) </span>{
    <span class="hljs-keyword">let</span> drawn = {x, y, color: state.color};
    dispatch({picture: state.picture.draw([drawn])});
  }
  drawPixel(pos, state);
  <span class="hljs-keyword">return</span> drawPixel;
}
</code></pre>
<p>&#x8BE5;&#x51FD;&#x6570;&#x7ACB;&#x5373;&#x8C03;&#x7528;<code>drawPixel</code>&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x8FD4;&#x56DE;&#x5B83;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x7528;&#x6237;&#x5728;&#x56FE;&#x7247;&#x4E0A;&#x62D6;&#x52A8;&#x6216;&#x6ED1;&#x52A8;&#x65F6;&#xFF0C;&#x518D;&#x6B21;&#x4E3A;&#x65B0;&#x7684;&#x6240;&#x89E6;&#x6478;&#x7684;&#x50CF;&#x7D20;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7ED8;&#x5236;&#x8F83;&#x5927;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x77E9;&#x5F62;&#x3002; &#x77E9;&#x5F62;&#x5DE5;&#x5177;&#x5728;&#x5F00;&#x59CB;&#x62D6;&#x52A8;&#x7684;&#x70B9;&#x548C;&#x62D6;&#x52A8;&#x5230;&#x7684;&#x70B9;&#x4E4B;&#x95F4;&#x753B;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">rectangle</span>(<span class="hljs-params">start, state, dispatch</span>) </span>{
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">drawRectangle</span>(<span class="hljs-params">pos</span>) </span>{
    <span class="hljs-keyword">let</span> xStart = <span class="hljs-built_in">Math</span>.min(start.x, pos.x);
    <span class="hljs-keyword">let</span> yStart = <span class="hljs-built_in">Math</span>.min(start.y, pos.y);
    <span class="hljs-keyword">let</span> xEnd = <span class="hljs-built_in">Math</span>.max(start.x, pos.x);
    <span class="hljs-keyword">let</span> yEnd = <span class="hljs-built_in">Math</span>.max(start.y, pos.y);
    <span class="hljs-keyword">let</span> drawn = [];
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> y = yStart; y &lt;= yEnd; y++) {
      <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> x = xStart; x &lt;= xEnd; x++) {
        drawn.push({x, y, color: state.color});
      }
    }
    dispatch({picture: state.picture.draw(drawn)});
  }
  drawRectangle(start);
  <span class="hljs-keyword">return</span> drawRectangle;
}
</code></pre>
<p>&#x6B64;&#x5B9E;&#x73B0;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x62D6;&#x52A8;&#x65F6;&#xFF0C;&#x77E9;&#x5F62;&#x5C06;&#x4ECE;&#x539F;&#x59CB;&#x72B6;&#x6001;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x5728;&#x56FE;&#x7247;&#x4E0A;&#x3002; &#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x521B;&#x5EFA;&#x77E9;&#x5F62;&#x65F6;&#x5C06;&#x77E9;&#x5F62;&#x518D;&#x6B21;&#x653E;&#x5927;&#x548C;&#x7F29;&#x5C0F;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;&#x77E9;&#x5F62;&#x4E0D;&#x4F1A;&#x5728;&#x6700;&#x7EC8;&#x56FE;&#x7247;&#x4E2D;&#x6B8B;&#x7559;&#x3002; &#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x56FE;&#x7247;&#x5BF9;&#x8C61;&#x5B9E;&#x7528;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00; - &#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x6D2A;&#x6C34;&#x586B;&#x5145;&#x6D89;&#x53CA;&#x66F4;&#x591A;&#x4E1C;&#x897F;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x586B;&#x5145;&#x548C;&#x6307;&#x9488;&#x4E0B;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x548C;&#x989C;&#x8272;&#x76F8;&#x540C;&#x7684;&#x6240;&#x6709;&#x76F8;&#x90BB;&#x50CF;&#x7D20;&#x3002; &#x201C;&#x76F8;&#x90BB;&#x201D;&#x662F;&#x6307;&#x6C34;&#x5E73;&#x6216;&#x5782;&#x76F4;&#x76F4;&#x63A5;&#x76F8;&#x90BB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5BF9;&#x89D2;&#x7EBF;&#x3002; &#x6B64;&#x56FE;&#x7247;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x6807;&#x8BB0;&#x50CF;&#x7D20;&#x5904;&#x4F7F;&#x7528;&#x586B;&#x5145;&#x5DE5;&#x5177;&#x65F6;&#xFF0C;&#x7740;&#x8272;&#x7684;&#x4E00;&#x7EC4;&#x50CF;&#x7D20;&#xFF1A;</p>
<p><img src="img/19-2.svg" alt=""></p>
<p>&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x50CF;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x7684;&#x5BFB;&#x8DEF;&#x4EE3;&#x7801;&#x3002;&#x90A3;&#x4E2A;&#x4EE3;&#x7801;&#x641C;&#x7D22;&#x56FE;&#x6765;&#x67E5;&#x627E;&#x8DEF;&#x7EBF;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x641C;&#x7D22;&#x7F51;&#x683C;&#x6765;&#x67E5;&#x627E;&#x6240;&#x6709;&#x201C;&#x8FDE;&#x901A;&#x201D;&#x7684;&#x50CF;&#x7D20;&#x3002; &#x8DDF;&#x8E2A;&#x4E00;&#x7EC4;&#x53EF;&#x80FD;&#x7684;&#x8DEF;&#x7EBF;&#x7684;&#x95EE;&#x9898;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> around = [{dx: <span class="hljs-number">-1</span>, dy: <span class="hljs-number">0</span>}, {dx: <span class="hljs-number">1</span>, dy: <span class="hljs-number">0</span>},
                {dx: <span class="hljs-number">0</span>, dy: <span class="hljs-number">-1</span>}, {dx: <span class="hljs-number">0</span>, dy: <span class="hljs-number">1</span>}];

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">fill</span>(<span class="hljs-params">{x, y}, state, dispatch</span>) </span>{
  <span class="hljs-keyword">let</span> targetColor = state.picture.pixel(x, y);
  <span class="hljs-keyword">let</span> drawn = [{x, y, color: state.color}];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> done = <span class="hljs-number">0</span>; done &lt; drawn.length; done++) {
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> {dx, dy} <span class="hljs-keyword">of</span> around) {
      <span class="hljs-keyword">let</span> x = drawn[done].x + dx, y = drawn[done].y + dy;
      <span class="hljs-keyword">if</span> (x &gt;= <span class="hljs-number">0</span> &amp;&amp; x &lt; state.picture.width &amp;&amp;
          y &gt;= <span class="hljs-number">0</span> &amp;&amp; y &lt; state.picture.height &amp;&amp;
          state.picture.pixel(x, y) == targetColor &amp;&amp;
          !drawn.some(p =&gt; p.x == x &amp;&amp; p.y == y)) {
        drawn.push({x, y, color: state.color});
      }
    }
  }
  dispatch({picture: state.picture.draw(drawn)});
}
</code></pre>
<p>&#x7ED8;&#x5236;&#x5B8C;&#x6210;&#x7684;&#x50CF;&#x7D20;&#x7684;&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x517C;&#x4F5C;&#x51FD;&#x6570;&#x7684;&#x5DE5;&#x4F5C;&#x5217;&#x8868;&#x3002; &#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5230;&#x8FBE;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x770B;&#x770B;&#x4EFB;&#x4F55;&#x76F8;&#x90BB;&#x7684;&#x50CF;&#x7D20;&#x662F;&#x5426;&#x989C;&#x8272;&#x76F8;&#x540C;&#xFF0C;&#x5E76;&#x4E14;&#x5C1A;&#x672A;&#x8986;&#x76D6;&#x3002; &#x968F;&#x7740;&#x65B0;&#x50CF;&#x7D20;&#x7684;&#x6DFB;&#x52A0;&#xFF0C;&#x5FAA;&#x73AF;&#x8BA1;&#x6570;&#x5668;&#x843D;&#x540E;&#x4E8E;&#x7ED8;&#x5236;&#x5B8C;&#x6210;&#x7684;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x3002; &#x4EFB;&#x4F55;&#x524D;&#x9762;&#x7684;&#x50CF;&#x7D20;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x63A2;&#x7D22;&#x3002; &#x5F53;&#x5B83;&#x8D76;&#x4E0A;&#x957F;&#x5EA6;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x5269;&#x4E0B;&#x672A;&#x63A2;&#x6D4B;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x51FD;&#x6570;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4F60;&#x6307;&#x5B9A;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x6765;&#x5C06;&#x5176;&#x7528;&#x4F5C;&#x5F53;&#x524D;&#x7684;&#x7ED8;&#x56FE;&#x989C;&#x8272;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">pick</span>(<span class="hljs-params">pos, state, dispatch</span>) </span>{
  dispatch({color: state.picture.pixel(pos.x, pos.y)});
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x6D4B;&#x8BD5;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x4E86;&#xFF01;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-keyword">let</span> state = {
    tool: <span class="hljs-string">&quot;draw&quot;</span>,
    color: <span class="hljs-string">&quot;#000000&quot;</span>,
    picture: Picture.empty(<span class="hljs-number">60</span>, <span class="hljs-number">30</span>, <span class="hljs-string">&quot;#f0f0f0&quot;</span>)
  };
  <span class="hljs-keyword">let</span> app = <span class="hljs-keyword">new</span> PixelEditor(state, {
    tools: {draw, fill, rectangle, pick},
    controls: [ToolSelect, ColorSelect],
    dispatch(action) {
      state = updateState(state, action);
      app.setState(state);
    }
  });
  <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;div&quot;</span>).appendChild(app.dom);
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<h2 id="&#x4FDD;&#x5B58;&#x548C;&#x52A0;&#x8F7D;">&#x4FDD;&#x5B58;&#x548C;&#x52A0;&#x8F7D;</h2>
<p>&#x5F53;&#x6211;&#x4EEC;&#x753B;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x6770;&#x4F5C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x60F3;&#x8981;&#x4FDD;&#x5B58;&#x5B83;&#x4EE5;&#x5907;&#x540E;&#x7528;&#x3002; &#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x5F53;&#x524D;&#x56FE;&#x7247;&#x4E0B;&#x8F7D;&#x4E3A;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x3002; &#x8FD9;&#x4E2A;&#x63A7;&#x4EF6;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E2A;&#x6309;&#x94AE;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">SaveButton</span> </span>{
  <span class="hljs-keyword">constructor</span>(state) {
    <span class="hljs-keyword">this</span>.picture = state.picture;
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;button&quot;</span>, {
      onclick: () =&gt; <span class="hljs-keyword">this</span>.save()
    }, <span class="hljs-string">&quot;\u{1f4be} Save&quot;</span>);
  }
  save() {
    <span class="hljs-keyword">let</span> canvas = elt(<span class="hljs-string">&quot;canvas&quot;</span>);
    drawPicture(<span class="hljs-keyword">this</span>.picture, canvas, <span class="hljs-number">1</span>);
    <span class="hljs-keyword">let</span> link = elt(<span class="hljs-string">&quot;a&quot;</span>, {
      href: canvas.toDataURL(),
      download: <span class="hljs-string">&quot;pixelart.png&quot;</span>
    });
    <span class="hljs-built_in">document</span>.body.appendChild(link);
    link.click();
    link.remove();
  }
  setState(state) { <span class="hljs-keyword">this</span>.picture = state.picture; }
}
</code></pre>
<p>&#x7EC4;&#x4EF6;&#x4F1A;&#x8DDF;&#x8E2A;&#x5F53;&#x524D;&#x56FE;&#x7247;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x4FDD;&#x5B58;&#x65F6;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5B83;&#x3002; &#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x56FE;&#x50CF;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;<code>&lt;canvas&gt;</code>&#x5143;&#x7D20;&#x6765;&#x7ED8;&#x5236;&#x56FE;&#x7247;&#xFF08;&#x4E00;&#x6BD4;&#x4E00;&#x7684;&#x50CF;&#x7D20;&#x6BD4;&#x4F8B;&#xFF09;&#x3002;</p>
<p><code>canvas</code>&#x5143;&#x7D20;&#x4E0A;&#x7684;<code>toDataURL</code>&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EE5;<code>data:</code>&#x5F00;&#x5934;&#x7684; URL&#x3002; &#x4E0E;<code>http:</code>&#x548C;<code>https:</code>&#x7684; URL &#x4E0D;&#x540C;&#xFF0C;&#x6570;&#x636E; URL &#x5728; URL &#x4E2D;&#x5305;&#x542B;&#x6574;&#x4E2A;&#x8D44;&#x6E90;&#x3002; &#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x5F88;&#x957F;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4EFB;&#x610F;&#x56FE;&#x7247;&#x7684;&#x53EF;&#x7528;&#x94FE;&#x63A5;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x771F;&#x6B63;&#x4E0B;&#x8F7D;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5143;&#x7D20;&#xFF0C;&#x6307;&#x5411;&#x6B64; URL &#x5E76;&#x5177;&#x6709;<code>download</code>&#x5C5E;&#x6027;&#x3002; &#x70B9;&#x51FB;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#x540E;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x5BF9;&#x8BDD;&#x6846;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x8BE5;&#x94FE;&#x63A5;&#x6DFB;&#x52A0;&#x5230;&#x6587;&#x6863;&#xFF0C;&#x6A21;&#x62DF;&#x70B9;&#x51FB;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5C06;&#x5176;&#x5220;&#x9664;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x6280;&#x672F;&#x505A;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x5947;&#x602A;&#x3002;</p>
<p>&#x5E76;&#x4E14;&#x60C5;&#x51B5;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#x4E86;&#x3002; &#x6211;&#x4EEC;&#x4E5F;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5C06;&#x73B0;&#x6709;&#x7684;&#x56FE;&#x50CF;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x7EC4;&#x4EF6;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">LoadButton</span> </span>{
  <span class="hljs-keyword">constructor</span>(_, {dispatch}) {
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;button&quot;</span>, {
      onclick: () =&gt; startLoad(dispatch)
    }, <span class="hljs-string">&quot;\u{1f4c1} Load&quot;</span>);
  }
  setState() {}
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">startLoad</span>(<span class="hljs-params">dispatch</span>) </span>{
  <span class="hljs-keyword">let</span> input = elt(<span class="hljs-string">&quot;input&quot;</span>, {
    type: <span class="hljs-string">&quot;file&quot;</span>,
    onchange: () =&gt; finishLoad(input.files[<span class="hljs-number">0</span>], dispatch)
  });
  <span class="hljs-built_in">document</span>.body.appendChild(input);
  input.click();
  input.remove();
}
</code></pre>
<p>&#x4E3A;&#x4E86;&#x8BBF;&#x95EE;&#x7528;&#x6237;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x6587;&#x4EF6;&#x8F93;&#x5165;&#x5B57;&#x6BB5;&#x9009;&#x62E9;&#x6587;&#x4EF6;&#x3002; &#x4F46;&#x6211;&#x4E0D;&#x5E0C;&#x671B;&#x52A0;&#x8F7D;&#x6309;&#x94AE;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x6587;&#x4EF6;&#x8F93;&#x5165;&#x5B57;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x5355;&#x51FB;&#x6309;&#x94AE;&#x65F6;&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x5047;&#x88C5;&#x5B83;&#x81EA;&#x5DF1;&#x88AB;&#x5355;&#x51FB;&#x3002;</p>
<p>&#x5F53;&#x7528;&#x6237;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>FileReader</code>&#x8BBF;&#x95EE;&#x5176;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x518D;&#x6B21;&#x4F5C;&#x4E3A;&#x6570;&#x636E; URL&#x3002; &#x8BE5; URL &#x53EF;&#x7528;&#x4E8E;&#x521B;&#x5EFA;<code>&lt;img&gt;</code>&#x5143;&#x7D20;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x6B64;&#x7C7B;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x4ECE;&#x4E2D;&#x521B;&#x5EFA;<code>Picture</code>&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">finishLoad</span>(<span class="hljs-params">file, dispatch</span>) </span>{
  <span class="hljs-keyword">if</span> (file == <span class="hljs-literal">null</span>) <span class="hljs-keyword">return</span>;
  <span class="hljs-keyword">let</span> reader = <span class="hljs-keyword">new</span> FileReader();
  reader.addEventListener(<span class="hljs-string">&quot;load&quot;</span>, () =&gt; {
    <span class="hljs-keyword">let</span> image = elt(<span class="hljs-string">&quot;img&quot;</span>, {
      onload: () =&gt; dispatch({
        picture: pictureFromImage(image)
      }),
      src: reader.result
    });
  });
  reader.readAsDataURL(file);
}
</code></pre>
<p>&#x4E3A;&#x4E86;&#x8BBF;&#x95EE;&#x50CF;&#x7D20;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5148;&#x5C06;&#x56FE;&#x7247;&#x7ED8;&#x5236;&#x5230;<code>&lt;canvas&gt;</code>&#x5143;&#x7D20;&#x3002; <code>canvas</code>&#x4E0A;&#x4E0B;&#x6587;&#x6709;&#x4E00;&#x4E2A;<code>getImageData</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5141;&#x8BB8;&#x811A;&#x672C;&#x8BFB;&#x53D6;&#x5176;&#x50CF;&#x7D20;&#x3002; &#x6240;&#x4EE5;&#x4E00;&#x65E6;&#x56FE;&#x7247;&#x5728;&#x753B;&#x5E03;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5B83;&#x5E76;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;<code>Picture</code>&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">pictureFromImage</span>(<span class="hljs-params">image</span>) </span>{
  <span class="hljs-keyword">let</span> width = <span class="hljs-built_in">Math</span>.min(<span class="hljs-number">100</span>, image.width);
  <span class="hljs-keyword">let</span> height = <span class="hljs-built_in">Math</span>.min(<span class="hljs-number">100</span>, image.height);
  <span class="hljs-keyword">let</span> canvas = elt(<span class="hljs-string">&quot;canvas&quot;</span>, {width, height});
  <span class="hljs-keyword">let</span> cx = canvas.getContext(<span class="hljs-string">&quot;2d&quot;</span>);
  cx.drawImage(image, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">let</span> pixels = [];
  <span class="hljs-keyword">let</span> {data} = cx.getImageData(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);

  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">hex</span>(<span class="hljs-params">n</span>) </span>{
    <span class="hljs-keyword">return</span> n.toString(<span class="hljs-number">16</span>).padStart(<span class="hljs-number">2</span>, <span class="hljs-string">&quot;0&quot;</span>);
  }
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; data.length; i += <span class="hljs-number">4</span>) {
    <span class="hljs-keyword">let</span> [r, g, b] = data.slice(i, i + <span class="hljs-number">3</span>);
    pixels.push(<span class="hljs-string">&quot;#&quot;</span> + hex(r) + hex(g) + hex(b));
  }
  <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Picture(width, height, pixels);
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x56FE;&#x50CF;&#x7684;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x4E3A;<code>100&#xD7;100</code>&#x50CF;&#x7D20;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x66F4;&#x5927;&#x7684;&#x56FE;&#x50CF;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x663E;&#x793A;&#x5668;&#x4E0A;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x5F88;&#x5927;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x62D6;&#x6162;&#x754C;&#x9762;&#x3002;</p>
<p><code>getImageData</code>&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x7684;<code>data</code>&#x5C5E;&#x6027;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#x5206;&#x91CF;&#x7684;&#x6570;&#x7EC4;&#x3002; &#x5BF9;&#x4E8E;&#x7531;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7684;&#x77E9;&#x5F62;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x56DB;&#x4E2A;&#x503C;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x50CF;&#x7D20;&#x989C;&#x8272;&#x7684;&#x7EA2;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#xFF0C;&#x84DD;&#x8272;&#x548C; alpha &#x5206;&#x91CF;&#xFF0C;&#x6570;&#x5B57;&#x4ECB;&#x4E8E; 0 &#x548C; 255 &#x4E4B;&#x95F4;&#x3002;alpha &#x5206;&#x91CF;&#x8868;&#x793A;&#x4E0D;&#x900F;&#x660E;&#x5EA6; - &#x5F53;&#x5B83;&#x662F;&#x96F6;&#x65F6;&#x50CF;&#x7D20;&#x662F;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x5F53;&#x5B83;&#x662F; 255 &#x65F6;&#xFF0C;&#x5B83;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x3002;&#x51FA;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x5B83;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x989C;&#x8272;&#x7B26;&#x53F7;&#x4E2D;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x5206;&#x91CF;&#x4F7F;&#x7528;&#x7684;&#x4E24;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x6B63;&#x597D;&#x5BF9;&#x5E94;&#x4E8E; 0 &#x5230; 255 &#x7684;&#x8303;&#x56F4; - &#x4E24;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x8868;&#x793A;<code>16**2 = 256</code>&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x5B57;&#x3002; &#x6570;&#x5B57;&#x7684;<code>toString</code>&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F20;&#x5165;&#x8FDB;&#x5236;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;<code>n.toString(16)</code>&#x5C06;&#x4EA7;&#x751F;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x793A;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x90FD;&#x5360;&#x7528;&#x4E24;&#x4F4D;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7684;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#x8C03;&#x7528;<code>padStart</code>&#xFF0C;&#x5728;&#x5FC5;&#x8981;&#x65F6;&#x6DFB;&#x52A0;&#x524D;&#x5BFC;&#x96F6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x5E76;&#x4FDD;&#x5B58;&#x4E86;&#xFF01; &#x5728;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#x5269;&#x4E0B;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x3002;</p>
<h2 id="&#x64A4;&#x9500;&#x5386;&#x53F2;">&#x64A4;&#x9500;&#x5386;&#x53F2;</h2>
<p>&#x7F16;&#x8F91;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x534A;&#x662F;&#x72AF;&#x4E86;&#x5C0F;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x518D;&#x6B21;&#x7EA0;&#x6B63;&#x5B83;&#x4EEC;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x7ED8;&#x56FE;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x529F;&#x80FD;&#x662F;&#x64A4;&#x6D88;&#x5386;&#x53F2;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x64A4;&#x9500;&#x66F4;&#x6539;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x4EE5;&#x524D;&#x7248;&#x672C;&#x7684;&#x56FE;&#x7247;&#x3002; &#x7531;&#x4E8E;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x5F88;&#x5BB9;&#x6613;&#x3002; &#x4F46;&#x5B83;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x5E94;&#x7528;&#x72B6;&#x6001;&#x4E2D;&#x7684;&#x989D;&#x5916;&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x6DFB;&#x52A0;<code>done</code>&#x6570;&#x7EC4;&#x6765;&#x4FDD;&#x7559;&#x56FE;&#x7247;&#x7684;&#x4EE5;&#x524D;&#x7248;&#x672C;&#x3002; &#x7EF4;&#x62A4;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x9700;&#x8981;&#x66F4;&#x590D;&#x6742;&#x7684;&#x72B6;&#x6001;&#x66F4;&#x65B0;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5C06;&#x56FE;&#x7247;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x7EC4;&#x4E2D;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x5B58;&#x50A8;&#x6BCF;&#x4E00;&#x4E2A;&#x66F4;&#x6539;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x91CF;&#x4E4B;&#x540E;&#x7684;&#x66F4;&#x6539;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7B2C;&#x4E8C;&#x4E2A;&#x5C5E;&#x6027;<code>doneAt</code>&#xFF0C;&#x8DDF;&#x8E2A;&#x6211;&#x4EEC;&#x4E0A;&#x6B21;&#x5728;&#x5386;&#x53F2;&#x4E2D;&#x5B58;&#x50A8;&#x56FE;&#x7247;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">historyUpdateState</span>(<span class="hljs-params">state, action</span>) </span>{
  <span class="hljs-keyword">if</span> (action.undo == <span class="hljs-literal">true</span>) {
    <span class="hljs-keyword">if</span> (state.done.length == <span class="hljs-number">0</span>) <span class="hljs-keyword">return</span> state;
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.assign({}, state, {
      picture: state.done[<span class="hljs-number">0</span>],
      done: state.done.slice(<span class="hljs-number">1</span>),
      doneAt: <span class="hljs-number">0</span>
    });
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (action.picture &amp;&amp;
             state.doneAt &lt; <span class="hljs-built_in">Date</span>.now() - <span class="hljs-number">1000</span>) {
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.assign({}, state, action, {
      done: [state.picture, ...state.done],
      doneAt: <span class="hljs-built_in">Date</span>.now()
    });
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.assign({}, state, action);
  }
}
</code></pre>
<p>&#x5F53;&#x52A8;&#x4F5C;&#x662F;&#x64A4;&#x6D88;&#x52A8;&#x4F5C;&#x65F6;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5C06;&#x4ECE;&#x5386;&#x53F2;&#x4E2D;&#x83B7;&#x53D6;&#x6700;&#x8FD1;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x751F;&#x6210;&#x5F53;&#x524D;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x52A8;&#x4F5C;&#x5305;&#x542B;&#x65B0;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x4E14;&#x4E0A;&#x6B21;&#x5B58;&#x50A8;&#x4E1C;&#x897F;&#x7684;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;&#x4E86;&#x4E00;&#x79D2;&#xFF08;1000 &#x6BEB;&#x79D2;&#xFF09;&#xFF0C;&#x4F1A;&#x66F4;&#x65B0;<code>done</code>&#x548C;<code>doneAt</code>&#x5C5E;&#x6027;&#x6765;&#x5B58;&#x50A8;&#x4E0A;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x64A4;&#x6D88;&#x6309;&#x94AE;&#x7EC4;&#x4EF6;&#x4E0D;&#x4F1A;&#x505A;&#x592A;&#x591A;&#x4E8B;&#x60C5;&#x3002; &#x5B83;&#x5728;&#x70B9;&#x51FB;&#x65F6;&#x5206;&#x6D3E;&#x64A4;&#x6D88;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x64A4;&#x9500;&#x7684;&#x4E1C;&#x897F;&#x65F6;&#x7981;&#x7528;&#x81EA;&#x8EAB;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">UndoButton</span> </span>{
  <span class="hljs-keyword">constructor</span>(state, {dispatch}) {
    <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;button&quot;</span>, {
      onclick: () =&gt; dispatch({undo: <span class="hljs-literal">true</span>}),
      disabled: state.done.length == <span class="hljs-number">0</span>
    }, <span class="hljs-string">&quot;&#x2BAA; Undo&quot;</span>);
  }
  setState(state) {
    <span class="hljs-keyword">this</span>.dom.disabled = state.done.length == <span class="hljs-number">0</span>;
  }
}
</code></pre>
<h2 id="&#x8BA9;&#x6211;&#x4EEC;&#x7ED8;&#x56FE;&#x5427;">&#x8BA9;&#x6211;&#x4EEC;&#x7ED8;&#x56FE;&#x5427;</h2>
<p>&#x4E3A;&#x4E86;&#x5EFA;&#x7ACB;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x4E00;&#x7EC4;&#x5DE5;&#x5177;&#xFF0C;&#x4E00;&#x7EC4;&#x63A7;&#x4EF6;&#x548C;&#x4E00;&#x4E2A;&#x5206;&#x6D3E;&#x51FD;&#x6570;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x4F20;&#x9012;&#x7ED9;<code>PixelEditor</code>&#x6784;&#x9020;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x4E3B;&#x8981;&#x7EC4;&#x4EF6;&#x3002; &#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x7EC3;&#x4E60;&#x4E2D;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x7ED1;&#x5B9A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> startState = {
  tool: <span class="hljs-string">&quot;draw&quot;</span>,
  color: <span class="hljs-string">&quot;#000000&quot;</span>,
  picture: Picture.empty(<span class="hljs-number">60</span>, <span class="hljs-number">30</span>, <span class="hljs-string">&quot;#f0f0f0&quot;</span>),
  done: [],
  doneAt: <span class="hljs-number">0</span>
};

<span class="hljs-keyword">const</span> baseTools = {draw, fill, rectangle, pick};

<span class="hljs-keyword">const</span> baseControls = [
  ToolSelect, ColorSelect, SaveButton, LoadButton, UndoButton
];

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">startPixelEditor</span>(<span class="hljs-params">{state = startState,
                           tools = baseTools,
                           controls = baseControls}</span>) </span>{
  <span class="hljs-keyword">let</span> app = <span class="hljs-keyword">new</span> PixelEditor(state, {
    tools,
    controls,
    dispatch(action) {
      state = historyUpdateState(state, action);
      app.setState(state);
    }
  });
  <span class="hljs-keyword">return</span> app.dom;
}
</code></pre>
<p>&#x89E3;&#x6784;&#x5BF9;&#x8C61;&#x6216;&#x6570;&#x7EC4;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x540E;&#x9762;&#x4F7F;&#x7528;<code>=</code>&#xFF0C;&#x6765;&#x4E3A;&#x7ED1;&#x5B9A;&#x6307;&#x5B9A;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8BE5;&#x5C5E;&#x6027;&#x5728;&#x7F3A;&#x5931;&#x6216;&#x672A;&#x5B9A;&#x4E49;&#x65F6;&#x4F7F;&#x7528;&#x3002; <code>startPixelEditor</code>&#x51FD;&#x6570;&#x5229;&#x7528;&#x5B83;&#x6765;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x53EF;&#x9009;&#x5C5E;&#x6027;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x672A;&#x63D0;&#x4F9B;<code>tools</code>&#x5C5E;&#x6027;&#xFF0C;&#x5219;<code>tools</code>&#x5C06;&#x7ED1;&#x5B9A;&#x5230;<code>baseTools</code>&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x83B7;&#x5F97;&#x5B9E;&#x9645;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-js">&lt;div&gt;<span class="xml"><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></span>
&lt;script&gt;
  <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;div&quot;</span>)
    .appendChild(startPixelEditor({}));
<span class="xml"><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></span>
</code></pre>
<p>&#x6765;&#x5427;&#xFF0C;&#x753B;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002; &#x6211;&#x4F1A;&#x7B49;&#x7740;&#x4F60;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x5F88;&#x56F0;&#x96BE;">&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x5F88;&#x56F0;&#x96BE;</h2>
<p>&#x6D4F;&#x89C8;&#x5668;&#x6280;&#x672F;&#x662F;&#x60CA;&#x4EBA;&#x7684;&#x3002; &#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x5F3A;&#x5927;&#x7684;&#x754C;&#x9762;&#x79EF;&#x6728;&#xFF0C;&#x6392;&#x7248;&#x548C;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x68C0;&#x67E5;&#x548C;&#x8C03;&#x8BD5;&#x5E94;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x4F60;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x7F16;&#x5199;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7535;&#x8111;&#x548C;&#x624B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x6280;&#x672F;&#x662F;&#x8352;&#x8C2C;&#x7684;&#x3002; &#x4F60;&#x5FC5;&#x987B;&#x5B66;&#x4E60;&#x5927;&#x91CF;&#x611A;&#x8822;&#x7684;&#x6280;&#x5DE7;&#x548C;&#x96BE;&#x61C2;&#x7684;&#x4E8B;&#x5B9E;&#x624D;&#x80FD;&#x638C;&#x63E1;&#x5B83;&#xFF0C;&#x800C;&#x5B83;&#x63D0;&#x4F9B;&#x7684;&#x9ED8;&#x8BA4;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x68D8;&#x624B;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x559C;&#x6B22;&#x7528;&#x51E0;&#x5C42;&#x62BD;&#x8C61;&#x6765;&#x5C01;&#x88C5;&#x5B83;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x5B83;&#x3002;</p>
<p>&#x867D;&#x7136;&#x60C5;&#x51B5;&#x80AF;&#x5B9A;&#x6709;&#x6240;&#x6539;&#x5584;&#xFF0C;&#x4F46;&#x5B83;&#x4EE5;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x5143;&#x7D20;&#x6765;&#x89E3;&#x51B3;&#x7F3A;&#x70B9;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6539;&#x5584;&#x4E86;&#x5B83; - &#x4E5F;&#x521B;&#x9020;&#x4E86;&#x66F4;&#x591A;&#x590D;&#x6742;&#x6027;&#x3002; &#x6570;&#x767E;&#x4E07;&#x4E2A;&#x7F51;&#x7AD9;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x6027;&#x65E0;&#x6CD5;&#x771F;&#x6B63;&#x88AB;&#x53D6;&#x4EE3;&#x3002; &#x5373;&#x4F7F;&#x53EF;&#x80FD;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x51B3;&#x5B9A;&#x5B83;&#x5E94;&#x8BE5;&#x7531;&#x4EC0;&#x4E48;&#x53D6;&#x4EE3;&#x3002;</p>
<p>&#x6280;&#x672F;&#x4ECE;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x771F;&#x7A7A;&#x4E2D; - &#x6211;&#x4EEC;&#x53D7;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x53CA;&#x4EA7;&#x751F;&#x5B83;&#x4EEC;&#x7684;&#x793E;&#x4F1A;&#xFF0C;&#x7ECF;&#x6D4E;&#x548C;&#x5386;&#x53F2;&#x56E0;&#x7D20;&#x7684;&#x5236;&#x7EA6;&#x3002; &#x8FD9;&#x53EF;&#x80FD;&#x5F88;&#x70E6;&#x4EBA;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x7684;&#x662F;&#xFF0C;&#x8BD5;&#x56FE;&#x7406;&#x89E3;&#x73B0;&#x6709;&#x7684;&#x6280;&#x672F;&#x73B0;&#x5B9E;&#x5982;&#x4F55;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x662F;&#x8FD9;&#x6837; - &#x800C;&#x4E0D;&#x662F;&#x5BF9;&#x6297;&#x5B83;&#xFF0C;&#x6216;&#x8005;&#x8F6C;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x65B0;&#x7684;&#x62BD;&#x8C61;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002; &#x6211;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x548C;&#x6570;&#x636E;&#x6D41;&#x7EA6;&#x5B9A;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x7C97;&#x7CD9;&#x7684;&#x62BD;&#x8C61;&#x3002; &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x6709;&#x4E9B;&#x5E93;&#x8BD5;&#x56FE;&#x4F7F;&#x7528;&#x6237;&#x754C;&#x9762;&#x7F16;&#x7A0B;&#x66F4;&#x6109;&#x5FEB;&#x3002; &#x5728;&#x7F16;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;React &#x548C; Angular &#x662F;&#x4E3B;&#x6D41;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x6846;&#x67B6;&#x5E26;&#x6709;&#x6574;&#x4E2A;&#x5168;&#x5BB6;&#x6876;&#x3002; &#x5982;&#x679C;&#x4F60;&#x5BF9;&#x7F16;&#x5199; Web &#x5E94;&#x7528;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x8C03;&#x67E5;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x6765;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x597D;&#x5904;&#x3002;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<p>&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x8FD8;&#x6709;&#x63D0;&#x5347;&#x7A7A;&#x95F4;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x66F4;&#x591A;&#x7279;&#x6027;&#x4F5C;&#x4E3A;&#x7EC3;&#x4E60;&#x3002;</p>
<h3 id="&#x952E;&#x76D8;&#x7ED1;&#x5B9A;">&#x952E;&#x76D8;&#x7ED1;&#x5B9A;</h3>
<p>&#x5C06;&#x952E;&#x76D8;&#x5FEB;&#x6377;&#x952E;&#x6DFB;&#x52A0;&#x5230;&#x5E94;&#x7528;&#x3002; &#x5DE5;&#x5177;&#x540D;&#x79F0;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x5DE5;&#x5177;&#xFF0C;&#x800C;<code>control-Z</code>&#x6216;<code>command-Z</code>&#x6FC0;&#x6D3B;&#x64A4;&#x6D88;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4FEE;&#x6539;<code>PixelEditor</code>&#x7EC4;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#x5B83;&#x3002; &#x4E3A;<code>&lt;div&gt;</code>&#x5143;&#x7D20;&#x5305;&#x88C5;&#x6DFB;&#x52A0;<code>tabIndex</code>&#x5C5E;&#x6027; 0&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x952E;&#x76D8;&#x7126;&#x70B9;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4E0E;<code>tabindex</code>&#x5C5E;&#x6027;&#x5BF9;&#x5E94;&#x7684;&#x5C5E;&#x6027;&#x79F0;&#x4E3A;<code>tabIndex</code>&#xFF0C;<code>I</code>&#x5927;&#x5199;&#xFF0C;&#x6211;&#x4EEC;&#x7684;<code>elt</code>&#x51FD;&#x6570;&#x9700;&#x8981;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x3002; &#x76F4;&#x63A5;&#x5728;&#x8BE5;&#x5143;&#x7D20;&#x4E0A;&#x6CE8;&#x518C;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5FC5;&#x987B;&#x5148;&#x5355;&#x51FB;&#xFF0C;&#x89E6;&#x6478;&#x6216;&#x6309;&#x4E0B; TAB &#x9009;&#x62E9;&#x5E94;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x952E;&#x76D8;&#x4E0E;&#x5176;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#x5177;&#x6709;<code>ctrlKey</code>&#x548C;<code>metaKey</code>&#xFF08;&#x7528;&#x4E8E; Mac &#x4E0A;&#x7684;<code>Command</code>&#x952E;&#xFF09;&#x5C5E;&#x6027;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x67E5;&#x770B;&#x8FD9;&#x4E9B;&#x952E;&#x662F;&#x5426;&#x88AB;&#x6309;&#x4E0B;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-comment">// The original PixelEditor class. Extend the constructor.</span>
  <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PixelEditor</span> </span>{
    <span class="hljs-keyword">constructor</span>(state, config) {
      <span class="hljs-keyword">let</span> {tools, controls, dispatch} = config;
      <span class="hljs-keyword">this</span>.state = state;

      <span class="hljs-keyword">this</span>.canvas = <span class="hljs-keyword">new</span> PictureCanvas(state.picture, pos =&gt; {
        <span class="hljs-keyword">let</span> tool = tools[<span class="hljs-keyword">this</span>.state.tool];
        <span class="hljs-keyword">let</span> onMove = tool(pos, <span class="hljs-keyword">this</span>.state, dispatch);
        <span class="hljs-keyword">if</span> (onMove) {
          <span class="hljs-keyword">return</span> pos =&gt; onMove(pos, <span class="hljs-keyword">this</span>.state, dispatch);
        }
      });
      <span class="hljs-keyword">this</span>.controls = controls.map(
        Control =&gt; <span class="hljs-keyword">new</span> Control(state, config));
      <span class="hljs-keyword">this</span>.dom = elt(<span class="hljs-string">&quot;div&quot;</span>, {}, <span class="hljs-keyword">this</span>.canvas.dom, elt(<span class="hljs-string">&quot;br&quot;</span>),
                     ...this.controls.reduce(
                       (a, c) =&gt; a.concat(<span class="hljs-string">&quot; &quot;</span>, c.dom), []));
    }
    setState(state) {
      <span class="hljs-keyword">this</span>.state = state;
      <span class="hljs-keyword">this</span>.canvas.setState(state.picture);
      <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> ctrl <span class="hljs-keyword">of</span> <span class="hljs-keyword">this</span>.controls) ctrl.setState(state);
    }
  }

  <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;div&quot;</span>)
    .appendChild(startPixelEditor({}));
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<h3 id="&#x9AD8;&#x6548;&#x7ED8;&#x56FE;">&#x9AD8;&#x6548;&#x7ED8;&#x56FE;</h3>
<p>&#x7ED8;&#x56FE;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x6240;&#x505A;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x90FD;&#x53D1;&#x751F;&#x5728;<code>drawPicture</code>&#x4E2D;&#x3002; &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x72B6;&#x6001;&#x5E76;&#x66F4;&#x65B0; DOM &#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x5F00;&#x9500;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#xFF0C;&#x4F46;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x753B;&#x5E03;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x50CF;&#x7D20;&#x662F;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>&#x627E;&#x5230;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x5B9E;&#x9645;&#x66F4;&#x6539;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x4F7F;<code>PictureCanvas</code>&#x7684;<code>setState</code>&#x65B9;&#x6CD5;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;<code>drawPicture</code>&#x4E5F;&#x7531;&#x4FDD;&#x5B58;&#x6309;&#x94AE;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x66F4;&#x6539;&#x5B83;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x66F4;&#x6539;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x65E7;&#x7528;&#x9014;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x540D;&#x79F0;&#x521B;&#x5EFA;&#x65B0;&#x7248;&#x672C;&#x3002;</p>
<p>&#x53E6;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x5176;<code>width</code>&#x6216;<code>height</code>&#x5C5E;&#x6027;&#x6765;&#x66F4;&#x6539;<code>&lt;canvas&gt;</code>&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5C06;&#x6E05;&#x9664;&#x5B83;&#xFF0C;&#x4F7F;&#x5176;&#x518D;&#x6B21;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-comment">// Change this method</span>
  PictureCanvas.prototype.setState = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">picture</span>) </span>{
    <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.picture == picture) <span class="hljs-keyword">return</span>;
    <span class="hljs-keyword">this</span>.picture = picture;
    drawPicture(<span class="hljs-keyword">this</span>.picture, <span class="hljs-keyword">this</span>.dom, scale);
  };

  <span class="hljs-comment">// You may want to use or change this as well</span>
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">drawPicture</span>(<span class="hljs-params">picture, canvas, scale</span>) </span>{
    canvas.width = picture.width * scale;
    canvas.height = picture.height * scale;
    <span class="hljs-keyword">let</span> cx = canvas.getContext(<span class="hljs-string">&quot;2d&quot;</span>);

    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> y = <span class="hljs-number">0</span>; y &lt; picture.height; y++) {
      <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> x = <span class="hljs-number">0</span>; x &lt; picture.width; x++) {
        cx.fillStyle = picture.pixel(x, y);
        cx.fillRect(x * scale, y * scale, scale, scale);
      }
    }
  }

  <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;div&quot;</span>)
    .appendChild(startPixelEditor({}));
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<h3 id="&#x5706;">&#x5706;</h3>
<p>&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>circle</code>&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5F53;&#x4F60;&#x62D6;&#x52A8;&#x65F6;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x5B9E;&#x5FC3;&#x5706;&#x3002; &#x5706;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x4E8E;&#x62D6;&#x52A8;&#x6216;&#x89E6;&#x6478;&#x624B;&#x52BF;&#x5F00;&#x59CB;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5176;&#x534A;&#x5F84;&#x7531;&#x62D6;&#x52A8;&#x7684;&#x8DDD;&#x79BB;&#x51B3;&#x5B9A;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span>&gt;</span><span class="javascript">
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">circle</span>(<span class="hljs-params">pos, state, dispatch</span>) </span>{
    <span class="hljs-comment">// Your code here</span>
  }

  <span class="hljs-keyword">let</span> dom = startPixelEditor({
    tools: <span class="hljs-built_in">Object</span>.assign({}, baseTools, {circle})
  });
  <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;div&quot;</span>).appendChild(dom);
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<h3 id="&#x5408;&#x9002;&#x7684;&#x76F4;&#x7EBF;">&#x5408;&#x9002;&#x7684;&#x76F4;&#x7EBF;</h3>
<p>&#x8FD9;&#x662F;&#x6BD4;&#x524D;&#x4E24;&#x4E2A;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x7EC3;&#x4E60;&#xFF0C;&#x5B83;&#x5C06;&#x8981;&#x6C42;&#x4F60;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; &#x5728;&#x5F00;&#x59CB;&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x6709;&#x5145;&#x8DB3;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x8010;&#x5FC3;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x8981;&#x56E0;&#x6700;&#x521D;&#x7684;&#x5931;&#x8D25;&#x800C;&#x611F;&#x5230;&#x6C14;&#x9981;&#x3002;</p>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#xFF0C;&#x5F53;&#x4F60;&#x9009;&#x62E9;&#x7ED8;&#x56FE;&#x5DE5;&#x5177;&#x5E76;&#x5FEB;&#x901F;&#x5728;&#x56FE;&#x7247;&#x4E0A;&#x62D6;&#x52A8;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x6761;&#x95ED;&#x5408;&#x76F4;&#x7EBF;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x7531;&#x4E8E;<code>&quot;mousemove&quot;</code>&#x6216;<code>&quot;touchmove&quot;</code>&#x4E8B;&#x4EF6;&#x6CA1;&#x6709;&#x5FEB;&#x5230;&#x8DB3;&#x4EE5;&#x547D;&#x4E2D;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x70B9;&#xFF0C;&#x5728;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6709;&#x7A7A;&#x9699;&#x3002;</p>
<p>&#x6539;&#x8FDB;&#x7ED8;&#x5236;&#x5DE5;&#x5177;&#xFF0C;&#x4F7F;&#x5176;&#x7ED8;&#x5236;&#x5B8C;&#x6574;&#x7684;&#x76F4;&#x7EBF;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x79FB;&#x52A8;&#x5904;&#x7406;&#x5668;&#x8BB0;&#x4F4F;&#x524D;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8FDE;&#x63A5;&#x5230;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x4E3A;&#x6B64;&#xFF0C;&#x7531;&#x4E8E;&#x50CF;&#x7D20;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x8DDD;&#x79BB;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x76F4;&#x7EBF;&#x7ED8;&#x5236;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x76F4;&#x7EBF;&#x662F;&#x8FDE;&#x63A5;&#x50CF;&#x7D20;&#x7684;&#x94FE;&#x6761;&#xFF0C;&#x4ECE;&#x8D77;&#x70B9;&#x5230;&#x7EC8;&#x70B9;&#x5C3D;&#x53EF;&#x80FD;&#x76F4;&#x3002;&#x5BF9;&#x89D2;&#x7EBF;&#x76F8;&#x90BB;&#x7684;&#x50CF;&#x7D20;&#x4E5F;&#x7B97;&#x4F5C;&#x8FDE;&#x63A5;&#x3002; &#x6240;&#x4EE5;&#x659C;&#x7EBF;&#x5E94;&#x8BE5;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x5DE6;&#x8FB9;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53F3;&#x8FB9;&#x7684;&#x56FE;&#x7247;&#x3002;</p>
<p><img src="img/19-3.svg" alt=""></p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x5728;&#x4E24;&#x4E2A;&#x4EFB;&#x610F;&#x70B9;&#x95F4;&#x7ED8;&#x5236;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x7EE7;&#x7EED;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x5B9A;&#x4E49;<code>line</code>&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x5728;&#x62D6;&#x52A8;&#x7684;&#x8D77;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#x4E4B;&#x95F4;&#x7ED8;&#x5236;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;</p>
<pre><code class="lang-js">&lt;div&gt;<span class="xml"><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></span>
&lt;script&gt;
  <span class="hljs-comment">// The old draw tool. Rewrite this.</span>
  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">draw</span>(<span class="hljs-params">pos, state, dispatch</span>) </span>{
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">drawPixel</span>(<span class="hljs-params">{x, y}, state</span>) </span>{
      <span class="hljs-keyword">let</span> drawn = {x, y, color: state.color};
      dispatch({picture: state.picture.draw([drawn])});
    }
    drawPixel(pos, state);
    <span class="hljs-keyword">return</span> drawPixel;
  }

  <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">line</span>(<span class="hljs-params">pos, state, dispatch</span>) </span>{
    <span class="hljs-comment">// Your code here</span>
  }

  <span class="hljs-keyword">let</span> dom = startPixelEditor({
    tools: {draw, line, fill, rectangle, pick}
  });
  <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;div&quot;</span>).appendChild(dom);
<span class="xml"><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></span>
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="18.html" class="navigation navigation-prev " aria-label="Previous page: 十八、HTTP 和表单">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="20.html" class="navigation navigation-next " aria-label="Next page: 二十、Node.js">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十九、项目：像素艺术编辑器","level":"1.21","depth":1,"next":{"title":"二十、Node.js","level":"1.22","depth":1,"path":"20.md","ref":"20.md","articles":[]},"previous":{"title":"十八、HTTP 和表单","level":"1.20","depth":1,"path":"18.md","ref":"18.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"19.md","mtime":"2019-12-08T16:07:04.991Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

