
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>二、程序结构 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3.html" />
    
    
    <link rel="prev" href="1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >二、程序结构</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E8C;&#x3001;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;">&#x4E8C;&#x3001;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;</h2>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/02_program_structure.html" target="_blank">Program Structure</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>And my heart glows bright red under my filmy, translucent skin and they have to administer 10cc of JavaScript to get me to come back. (I respond well to toxins in the blood.) Man, that stuff will kick the peaches right out your gills!</p>
<p>why&#xFF0C;&#x300A;Why&apos;s (Poignant) Guide to Ruby&#x300B;</p>
</blockquote>
<p><img src="img/2-0.jpg" alt=""></p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x505A;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x4E0A;&#x79F0;&#x4E3A;&#x7F16;&#x7A0B;&#x7684;&#x4E8B;&#x60C5;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x6269;&#x5C55;&#x6211;&#x4EEC;&#x5BF9; JavaScript &#x8BED;&#x8A00;&#x7684;&#x638C;&#x63A7;&#xFF0C;&#x8D85;&#x51FA;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x770B;&#x5230;&#x7684;&#x540D;&#x8BCD;&#x548C;&#x53E5;&#x5B50;&#x7247;&#x65AD;&#xFF0C;&#x76F4;&#x5230;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x6709;&#x610F;&#x4E49;&#x7684;&#x6563;&#x6587;&#x3002;</p>
<h2 id="&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x8BED;&#x53E5;">&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x8BED;&#x53E5;</h2>
<p>&#x5728;&#x7B2C; 1 &#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x5B83;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x503C;&#xFF0C;&#x5E76;&#x5E94;&#x7528;&#x4E86;&#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x83B7;&#x5F97;&#x65B0;&#x7684;&#x503C;&#x3002; &#x50CF;&#x8FD9;&#x6837;&#x521B;&#x5EFA;&#x503C;&#x662F;&#x4EFB;&#x4F55; JavaScript &#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x5FC5;&#x987B;&#x5728;&#x66F4;&#x5927;&#x7684;&#x7ED3;&#x6784;&#x4E2D;&#x6784;&#x5EFA;&#xFF0C;&#x624D;&#x80FD;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x505A;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x628A;&#x4EA7;&#x751F;&#x503C;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x79F0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x6309;&#x7167;&#x5B57;&#x9762;&#x542B;&#x4E49;&#x7F16;&#x5199;&#x7684;&#x503C;&#xFF08;&#x6BD4;&#x5982;<code>22</code>&#x6216;<code>&quot;psychoanalysis&quot;</code>&#xFF09;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x800C;&#x62EC;&#x53F7;&#x5F53;&#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3001;&#x4F7F;&#x7528;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#x8FDE;&#x63A5;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6216;&#x4F7F;&#x7528;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4ECD;&#x7136;&#x90FD;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x8FD9;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x57FA;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x63A5;&#x53E3;&#x4E4B;&#x7F8E;&#x3002; &#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5176;&#x65B9;&#x5F0F;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x7684;&#x4ECE;&#x53E5;&#x5D4C;&#x5957; - &#x4ECE;&#x53E5;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x4ECE;&#x53E5;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002; &#x8FD9;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x63CF;&#x8FF0;&#x4EFB;&#x610F;&#x590D;&#x6742;&#x8BA1;&#x7B97;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#x7247;&#x6BB5;&#xFF0C;&#x5219; JavaScript &#x8BED;&#x53E5;&#x5BF9;&#x5E94;&#x4E8E;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x53E5;&#x5B50;&#x3002; &#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x5217;&#x8BED;&#x53E5;&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x7531;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x5176;&#x540E;&#x7684;&#x5206;&#x53F7;&#x7EC4;&#x6210;&#x3002;&#x6BD4;&#x5982;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-number">1</span>;
!<span class="hljs-literal">false</span>;
</code></pre>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x3002; &#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x4EC5;&#x4EC5;&#x6EE1;&#x8DB3;&#x4E8E;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x7531;&#x95ED;&#x5408;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x3002; &#x4E00;&#x4E2A;&#x58F0;&#x660E;&#x662F;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EA;&#x6709;&#x5728;&#x5F71;&#x54CD;&#x5230;&#x4E16;&#x754C;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x6210;&#x7ACB;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x67D0;&#x4E9B;&#x4E1C;&#x897F; - &#x8FD9;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x4E16;&#x754C; - &#x6216;&#x8005;&#x5B83;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x673A;&#x5668;&#x7684;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x4ECE;&#x800C;&#x5F71;&#x54CD;&#x540E;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x3002; &#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x88AB;&#x79F0;&#x4E3A;&#x526F;&#x4F5C;&#x7528;&#x3002; &#x524D;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x4EC5;&#x4EC5;&#x4EA7;&#x751F;&#x503C;<code>1</code>&#x548C;<code>true</code>&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x5373;&#x5C06;&#x5B83;&#x4EEC;&#x6254;&#x6389;&#x3002; &#x8FD9;&#x7ED9;&#x4E16;&#x754C;&#x6CA1;&#x6709;&#x7559;&#x4E0B;&#x4EC0;&#x4E48;&#x5370;&#x8C61;&#x3002; &#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;JavaScript &#x5141;&#x8BB8;&#x60A8;&#x5728;&#x8BED;&#x53E5;&#x7ED3;&#x5C3E;&#x5904;&#x7701;&#x7565;&#x5206;&#x53F7;&#x3002; &#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x5426;&#x5219;&#x4E0B;&#x4E00;&#x884C;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x540C;&#x4E00;&#x8BED;&#x53E5;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x4F55;&#x65F6;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x7701;&#x7565;&#x5B83;&#x7684;&#x89C4;&#x5219;&#x6709;&#x70B9;&#x590D;&#x6742;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002; &#x6240;&#x4EE5;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x5206;&#x53F7;&#x7684;&#x8BED;&#x53E5;&#x90FD;&#x4F1A;&#x6709;&#x5206;&#x53F7;&#x3002; &#x81F3;&#x5C11;&#x5728;&#x4F60;&#x66F4;&#x4E86;&#x89E3;&#x7701;&#x7565;&#x5206;&#x53F7;&#x7684;&#x7EC6;&#x8282;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x4E5F;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<h2 id="&#x7ED1;&#x5B9A;">&#x7ED1;&#x5B9A;</h2>
<p>&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF1F; &#x5B83;&#x5982;&#x4F55;&#x8BB0;&#x4F4F;&#x4E1C;&#x897F;&#xFF1F; &#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x5982;&#x4F55;&#x4ECE;&#x65E7;&#x503C;&#x4E2D;&#x4EA7;&#x751F;&#x65B0;&#x503C;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x65E7;&#x503C;&#xFF0C;&#x65B0;&#x503C;&#x5FC5;&#x987B;&#x7ACB;&#x5373;&#x4F7F;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x4F1A;&#x518D;&#x5EA6;&#x6D88;&#x5931;&#x3002; &#x4E3A;&#x4E86;&#x6355;&#x83B7;&#x548C;&#x4FDD;&#x5B58;&#x503C;&#xFF0C;JavaScript &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x7ED1;&#x5B9A;&#x6216;&#x53D8;&#x91CF;&#x7684;&#x4E1C;&#x897F;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> caught = <span class="hljs-number">5</span> * <span class="hljs-number">5</span>;
</code></pre>
<p>&#x8FD9;&#x662F;&#x7B2C;&#x4E8C;&#x79CD;&#x8BED;&#x53E5;&#x3002; &#x5173;&#x952E;&#x5B57;&#xFF08;keyword&#xFF09;<code>let</code>&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x6253;&#x7B97;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x3002; &#x5B83;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x7ED1;&#x5B9A;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x7ACB;&#x5373;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x4F7F;&#x7528;<code>=</code>&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x524D;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>caught</code>&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x6765;&#x6355;&#x83B7;&#x4E58;&#x4EE5;<code>5 * 5</code>&#x6240;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x5728;&#x5B9A;&#x4E49;&#x7ED1;&#x5B9A;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x7684;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x8868;&#x8FBE;&#x5F0F;&#x3002; &#x8FD9;&#x79CD;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x662F;&#x7ED1;&#x5B9A;&#x5F53;&#x524D;&#x6240;&#x6301;&#x6709;&#x7684;&#x503C;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ten = <span class="hljs-number">10</span>;
<span class="hljs-built_in">console</span>.log(ten * ten);
<span class="hljs-comment">// &#x2192; 100</span>
</code></pre>
<p>&#x5F53;&#x7ED1;&#x5B9A;&#x6307;&#x5411;&#x67D0;&#x4E2A;&#x503C;&#x65F6;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B83;&#x6C38;&#x8FDC;&#x4E0E;&#x8BE5;&#x503C;&#x7ED1;&#x5B9A;&#x3002; &#x53EF;&#x4EE5;&#x5728;&#x73B0;&#x6709;&#x7684;&#x7ED1;&#x5B9A;&#x4E0A;&#x968F;&#x65F6;&#x4F7F;&#x7528;<code>=</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x4E0E;&#x5F53;&#x524D;&#x503C;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x8BA9;&#x5B83;&#x4EEC;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> mood = <span class="hljs-string">&quot;light&quot;</span>;
<span class="hljs-built_in">console</span>.log(mood);
<span class="hljs-comment">// &#x2192; light</span>
mood = <span class="hljs-string">&quot;dark&quot;</span>;
<span class="hljs-built_in">console</span>.log(mood);
<span class="hljs-comment">// &#x2192; dark</span>
</code></pre>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x5C06;&#x7ED1;&#x5B9A;&#x60F3;&#x8C61;&#x4E3A;&#x89E6;&#x624B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76D2;&#x5B50;&#x3002; &#x4ED6;&#x4EEC;&#x4E0D;&#x5305;&#x542B;&#x503C;; &#x4ED6;&#x4EEC;&#x6355;&#x83B7;&#x503C; - &#x4E24;&#x4E2A;&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002; &#x7A0B;&#x5E8F;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5B83;&#x8FD8;&#x5728;&#x5F15;&#x7528;&#x7684;&#x503C;&#x3002; &#x5F53;&#x4F60;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x957F;&#x51FA;&#x4E00;&#x4E2A;&#x89E6;&#x624B;&#x6765;&#x6355;&#x83B7;&#x5B83;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x91CD;&#x65B0;&#x8D34;&#x4E0A;&#x4F60;&#x73B0;&#x6709;&#x7684;&#x89E6;&#x624B;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002; &#x4E3A;&#x4E86;&#x8BB0;&#x4F4F; Luigi &#x6B20;&#x4F60;&#x7684;&#x7F8E;&#x5143;&#x6570;&#x91CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x3002; &#x7136;&#x540E;&#x5F53;&#x4ED6;&#x8FD8;&#x4F60; 35 &#x7F8E;&#x5143;&#x65F6;&#xFF0C;&#x4F60;&#x8D4B;&#x4E88;&#x8FD9;&#x4E2A;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> luigisDebt = <span class="hljs-number">140</span>;
luigisDebt = luigisDebt - <span class="hljs-number">35</span>;
<span class="hljs-built_in">console</span>.log(luigisDebt);
<span class="hljs-comment">// &#x2192; 105</span>
</code></pre>
<p>&#x5F53;&#x4F60;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x800C;&#x6CA1;&#x6709;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;&#x503C;&#x65F6;&#xFF0C;&#x89E6;&#x624B;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x6355;&#x83B7;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EA;&#x80FD;&#x6355;&#x83B7;&#x7A7A;&#x6C14;&#x3002; &#x5982;&#x679C;&#x4F60;&#x8BF7;&#x6C42;&#x4E00;&#x4E2A;&#x7A7A;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;<code>undefined</code>&#x503C;&#x3002;</p>
<p>&#x4E00;&#x4E2A;<code>let</code>&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B9A;&#x4E49;&#x591A;&#x4E2A;&#x7ED1;&#x5B9A;&#xFF0C;&#x5B9A;&#x4E49;&#x5FC5;&#x9700;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> one = <span class="hljs-number">1</span>, two = <span class="hljs-number">2</span>;
<span class="hljs-built_in">console</span>.log(one + two);
<span class="hljs-comment">// &#x2192; 3</span>
</code></pre>
<p><code>var</code>&#x548C;<code>const</code>&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x7ED1;&#x5B9A;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;<code>let</code>&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> name = <span class="hljs-string">&quot;Ayda&quot;</span>;
<span class="hljs-keyword">const</span> greeting = <span class="hljs-string">&quot;Hello &quot;</span>;
<span class="hljs-built_in">console</span>.log(greeting + name);
<span class="hljs-comment">// &#x2192; Hello Ayda</span>
</code></pre>
<p>&#x7B2C;&#x4E00;&#x4E2A;<code>var</code>&#xFF08;&#x201C;variable&#x201D;&#x7684;&#x7B80;&#x5199;&#xFF09;&#x662F; JavaScript 2015 &#x4E4B;&#x524D;&#x58F0;&#x660E;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x6211;&#x4EEC;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x4F1A;&#x8BB2;&#x5230;&#x5B83;&#x4E0E;<code>let</code>&#x7684;&#x786E;&#x5207;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x3002; &#x73B0;&#x5728;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x5B83;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x505A;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5F88;&#x5C11;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x4E00;&#x4E9B;&#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<p><code>const</code>&#x8FD9;&#x4E2A;&#x8BCD;&#x4EE3;&#x8868;&#x5E38;&#x91CF;&#x3002; &#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x53D8;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x5B58;&#x5728;&#xFF0C;&#x5B83;&#x5C31;&#x6307;&#x5411;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002; &#x8FD9;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7ED1;&#x5B9A;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x5B83;&#x4EEC;&#x5411;&#x503C;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x540D;&#x8BCD;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5F15;&#x7528;&#x5B83;&#x3002;</p>
<h2 id="&#x7ED1;&#x5B9A;&#x540D;&#x79F0;">&#x7ED1;&#x5B9A;&#x540D;&#x79F0;</h2>
<p>&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x5355;&#x8BCD;&#x3002; &#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x662F;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F8B;&#x5982;<code>catch22</code>&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x4F46;&#x540D;&#x79F0;&#x4E0D;&#x80FD;&#x4EE5;&#x6570;&#x5B57;&#x5F00;&#x5934;&#x3002; &#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x7F8E;&#x5143;&#x7B26;&#x53F7;&#xFF08;<code>$</code>&#xFF09;&#x6216;&#x4E0B;&#x5212;&#x7EBF;&#xFF08;<code>_</code>&#xFF09;&#xFF0C;&#x4F46;&#x4E0D;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x6807;&#x70B9;&#x7B26;&#x53F7;&#x6216;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x3002;</p>
<p>&#x5177;&#x6709;&#x7279;&#x6B8A;&#x542B;&#x4E49;&#x7684;&#x8BCD;&#xFF0C;&#x5982;<code>let</code>&#xFF0C;&#x662F;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x7528;&#x4F5C;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x3002; &#x5728;&#x672A;&#x6765;&#x7684; JavaScript &#x7248;&#x672C;&#x4E2D;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x201C;&#x4FDD;&#x7559;&#x4F9B;&#x4F7F;&#x7528;&#x201D;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x4F5C;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x3002; &#x5173;&#x952E;&#x5B57;&#x548C;&#x4FDD;&#x7559;&#x5B57;&#x7684;&#x5B8C;&#x6574;&#x5217;&#x8868;&#x76F8;&#x5F53;&#x957F;&#xFF1A;</p>
<pre><code>break case catch class const continue debugger default
delete do else enum export extends false finally for
function if implements import interface in instanceof let
new package private protected public return static super
switch this throw true try typeof var void while with yield
</code></pre><p>&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002; &#x521B;&#x5EFA;&#x7ED1;&#x5B9A;&#x65F6;&#x4F1A;&#x4EA7;&#x751F;&#x610F;&#x5916;&#x7684;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x60A8;&#x662F;&#x5426;&#x5C1D;&#x8BD5;&#x5B9A;&#x4E49;&#x4FDD;&#x7559;&#x5B57;&#x3002;</p>
<h2 id="&#x73AF;&#x5883;">&#x73AF;&#x5883;</h2>
<p>&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x7ED1;&#x5B9A;&#x53CA;&#x5176;&#x503C;&#x7684;&#x96C6;&#x5408;&#x79F0;&#x4E3A;&#x73AF;&#x5883;&#x3002; &#x5F53;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x4E0D;&#x662F;&#x7A7A;&#x7684;&#x3002; &#x5B83;&#x603B;&#x662F;&#x5305;&#x542B;&#x4F5C;&#x4E3A;&#x8BED;&#x8A00;&#x6807;&#x51C6;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x8FD8;&#x5177;&#x6709;&#x4E00;&#x4E9B;&#x7ED1;&#x5B9A;&#xFF0C;&#x63D0;&#x4F9B;&#x4E0E;&#x5468;&#x56F4;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x529F;&#x51FD;&#x6570;&#x80FD;&#x53EF;&#x4EE5;&#x4E0E;&#x5F53;&#x524D;&#x52A0;&#x8F7D;&#x7684;&#x7F51;&#x7AD9;&#x4EA4;&#x4E92;&#x5E76;&#x8BFB;&#x53D6;&#x9F20;&#x6807;&#x548C;&#x952E;&#x76D8;&#x8F93;&#x5165;&#x3002;</p>
<h2 id="&#x51FD;&#x6570;">&#x51FD;&#x6570;</h2>
<p>&#x5728;&#x9ED8;&#x8BA4;&#x73AF;&#x5883;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x8BB8;&#x591A;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x4E3A;&#x51FD;&#x6570;&#x3002; &#x51FD;&#x6570;&#x662F;&#x5305;&#x88F9;&#x5728;&#x503C;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x7247;&#x6BB5;&#x3002; &#x4E3A;&#x4E86;&#x8FD0;&#x884C;&#x5305;&#x88F9;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x503C;&#x5E94;&#x7528;&#x4E8E;&#x5B83;&#x4EEC;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x7ED1;&#x5B9A;<code>prompt</code>&#x5305;&#x542B;&#x4E00;&#x51FD;&#x6570;&#xFF0C;&#x4E2A;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x5C0F;&#x5BF9;&#x8BDD;&#x6846;&#xFF0C;&#x8BF7;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;&#x3002; &#x5B83;&#x662F;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x7684;&#xFF1A;</p>
<pre><code class="lang-js">prompt(<span class="hljs-string">&quot;Enter passcode&quot;</span>);
</code></pre>
<p><img src="img/2-1.png" alt=""></p>
<p>&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x88AB;&#x79F0;&#x4E3A;&#x8C03;&#x7528;&#xFF0C;&#x6216;&#x5E94;&#x7528;&#x5B83;&#xFF08;invoke&#xFF0C;call&#xFF0C;apply&#xFF09;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x751F;&#x6210;&#x51FD;&#x6570;&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E4B;&#x540E;&#x653E;&#x7F6E;&#x62EC;&#x53F7;&#x6765;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x3002; &#x901A;&#x5E38;&#x4F60;&#x4F1A;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x6301;&#x6709;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x3002; &#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x503C;&#x88AB;&#x8D4B;&#x4E88;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x7A0B;&#x5E8F;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>prompt</code>&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x6587;&#x672C;&#x6765;&#x663E;&#x793A;&#x5728;&#x5BF9;&#x8BDD;&#x6846;&#x4E2D;&#x3002; &#x8D4B;&#x4E88;&#x51FD;&#x6570;&#x7684;&#x503C;&#x79F0;&#x4E3A;&#x53C2;&#x6570;&#x3002; &#x4E0D;&#x540C;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x91CF;&#x6216;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x3002;</p>
<p><code>prompt</code>&#x51FD;&#x6570;&#x5728;&#x73B0;&#x4EE3; Web &#x7F16;&#x7A0B;&#x4E2D;&#x7528;&#x5904;&#x4E0D;&#x5927;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x6240;&#x5F97;&#x5BF9;&#x8BDD;&#x6846;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5728;&#x73A9;&#x5177;&#x7A0B;&#x5E8F;&#x548C;&#x5B9E;&#x9A8C;&#x4E2D;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<h2 id="consolelog&#x51FD;&#x6570;"><code>console.log</code>&#x51FD;&#x6570;</h2>
<p>&#x5728;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4F7F;&#x7528;<code>console.log</code>&#x6765;&#x8F93;&#x51FA;&#x503C;&#x3002; &#x5927;&#x591A;&#x6570; JavaScript &#x7CFB;&#x7EDF;&#xFF08;&#x5305;&#x62EC;&#x6240;&#x6709;&#x73B0;&#x4EE3; Web &#x6D4F;&#x89C8;&#x5668;&#x548C; Node.js&#xFF09;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;<code>console.log</code>&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x5176;&#x53C2;&#x6570;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x8BBE;&#x5907;&#x3002; &#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x8F93;&#x51FA;&#x51FA;&#x73B0;&#x5728; JavaScript &#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x3002; &#x6D4F;&#x89C8;&#x5668;&#x754C;&#x9762;&#x7684;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x9690;&#x85CF;&#x7684;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x60A8;&#x6309; F12 &#x6216;&#x5728; Mac &#x4E0A;&#x6309; Command-Option-I &#x65F6;&#x6253;&#x5F00;&#x5B83;&#x3002; &#x5982;&#x679C;&#x8FD9;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x8BF7;&#x5728;&#x83DC;&#x5355;&#x4E2D;&#x641C;&#x7D22;&#x540D;&#x4E3A;&#x201C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5DE5;&#x5177;&#x201D;&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x82F1;&#x6587;&#x7248;&#x9875;&#x9762;&#x4E0A;&#x8FD0;&#x884C;&#x793A;&#x4F8B;&#xFF08;&#x6216;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#xFF09;&#x65F6;&#xFF0C;&#x4F1A;&#x5728;&#x793A;&#x4F8B;&#x4E4B;&#x540E;&#x663E;&#x793A;<code>console.log</code>&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684; JavaScript &#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x663E;&#x793A;&#x3002;</p>
</blockquote>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> x = <span class="hljs-number">30</span>;
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;the value of x is&quot;</span>, x);
<span class="hljs-comment">// &#x2192; the value of x is 30</span>
</code></pre>
<p>&#x5C3D;&#x7BA1;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x53E5;&#x53F7;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x662F;<code>console.log</code>&#x786E;&#x5B9E;&#x62E5;&#x6709;&#x3002; &#x8FD9;&#x662F;&#x56E0;&#x4E3A;<code>console.log</code>&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7ED1;&#x5B9A;&#x3002; &#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5B83;&#x4ECE;<code>console</code>&#x7ED1;&#x5B9A;&#x6240;&#x6301;&#x6709;&#x7684;&#x503C;&#x4E2D;&#x68C0;&#x7D22;<code>log</code>&#x5C5E;&#x6027;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x5F04;&#x6E05;&#x695A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;</p>
<h2 id="&#x8FD4;&#x56DE;&#x503C;">&#x8FD4;&#x56DE;&#x503C;</h2>
<p>&#x663E;&#x793A;&#x5BF9;&#x8BDD;&#x6846;&#x6216;&#x5C06;&#x6587;&#x5B57;&#x5199;&#x5165;&#x5C4F;&#x5E55;&#x662F;&#x4E00;&#x4E2A;&#x526F;&#x4F5C;&#x7528;&#x3002; &#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x4EA7;&#x751F;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5F88;&#x591A;&#x51FD;&#x6570;&#x90FD;&#x5F88;&#x6709;&#x7528;&#x3002; &#x51FD;&#x6570;&#x4E5F;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x503C;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x5C31;&#x6709;&#x7528;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x51FD;&#x6570;<code>Math.max</code>&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x6570;&#x5E76;&#x8FD4;&#x56DE;&#x6700;&#x5927;&#x503C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.max(<span class="hljs-number">2</span>, <span class="hljs-number">4</span>));
<span class="hljs-comment">// &#x2192; 4</span>
</code></pre>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#x65F6;&#xFF0C;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;&#x8FD4;&#x56DE;&#x8BE5;&#x503C;&#x3002; &#x4EFB;&#x4F55;&#x4EA7;&#x751F;&#x503C;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F; JavaScript &#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x5728;&#x8F83;&#x5927;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002; &#x5728;&#x8FD9;&#x91CC;&#xFF0C;<code>Math.min</code>&#x7684;&#x8C03;&#x7528;&#xFF08;&#x4E0E;<code>Math.max</code>&#x76F8;&#x53CD;&#xFF09;&#x7528;&#x4F5C;&#x52A0;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.min(<span class="hljs-number">2</span>, <span class="hljs-number">4</span>) + <span class="hljs-number">100</span>);
<span class="hljs-comment">// &#x2192; 102</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x5F53;&#x4E2D;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x3002;</p>
<h2 id="&#x63A7;&#x5236;&#x6D41;">&#x63A7;&#x5236;&#x6D41;</h2>
<p>&#x5F53;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BED;&#x53E5;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#x4E00;&#x6837;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x6267;&#x884C;&#x3002; &#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x7A0B;&#x5E8F;&#x6709;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x8981;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4E4B;&#x540E;&#x6267;&#x884C;&#xFF0C;&#x663E;&#x793A;&#x8BE5;&#x6570;&#x5B57;&#x7684;&#x5E73;&#x65B9;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> theNumber = <span class="hljs-built_in">Number</span>(prompt(<span class="hljs-string">&quot;Pick a number&quot;</span>));
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Your number is the square root of &quot;</span> +
            theNumber * theNumber);
</code></pre>
<p><code>Number</code>&#x51FD;&#x6570;&#x5C06;&#x4E00;&#x4E2A;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002; &#x6211;&#x4EEC;&#x9700;&#x8981;&#x8FD9;&#x79CD;&#x8F6C;&#x6362;&#xFF0C;&#x56E0;&#x4E3A;<code>prompt</code>&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002; &#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x51FD;&#x6570;&#x53EB;&#x505A;<code>String</code>&#x548C;<code>Boolean</code>&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x76F4;&#x7EBF;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x7684;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x793A;&#x610F;&#x56FE;&#xFF1A;</p>
<p><img src="img/2-2.svg" alt=""></p>
<h2 id="&#x6761;&#x4EF6;&#x6267;&#x884C;">&#x6761;&#x4EF6;&#x6267;&#x884C;</h2>
<p>&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x76F4;&#x8DEF;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x60F3;&#x521B;&#x5EFA;&#x4E00;&#x6761;&#x5206;&#x53C9;&#x8DEF;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x8BE5;&#x7A0B;&#x5E8F;&#x6839;&#x636E;&#x5F53;&#x524D;&#x7684;&#x60C5;&#x51B5;&#x91C7;&#x53D6;&#x9002;&#x5F53;&#x7684;&#x5206;&#x652F;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x6761;&#x4EF6;&#x6267;&#x884C;&#x3002;</p>
<p><img src="img/2-3.svg" alt=""></p>
<p>&#x5728; JavaScript &#x4E2D;&#xFF0C;&#x6761;&#x4EF6;&#x6267;&#x884C;&#x4F7F;&#x7528;<code>if</code>&#x5173;&#x952E;&#x5B57;&#x521B;&#x5EFA;&#x3002; &#x5728;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x5E0C;&#x671B;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4EC5;&#x5F53;&#x8F93;&#x5165;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x6253;&#x7B97;&#x663E;&#x793A;&#x8F93;&#x5165;&#x7684;&#x5E73;&#x65B9;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> theNumber = <span class="hljs-built_in">Number</span>(prompt(<span class="hljs-string">&quot;Pick a number&quot;</span>, <span class="hljs-string">&quot;&quot;</span>));
<span class="hljs-keyword">if</span> (!<span class="hljs-built_in">isNaN</span>(theNumber))
  alert(<span class="hljs-string">&quot;Your number is the square root of &quot;</span> +
        theNumber * theNumber);
</code></pre>
<p>&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x8F93;&#x5165;<code>&quot;parrot&quot;</code>&#xFF0C;&#x5219;&#x4E0D;&#x663E;&#x793A;&#x8F93;&#x51FA;&#x3002;</p>
<p><code>if</code>&#x5173;&#x952E;&#x5B57;&#x6839;&#x636E;&#x5E03;&#x5C14;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x6267;&#x884C;&#x6216;&#x8DF3;&#x8FC7;&#x8BED;&#x53E5;&#x3002; &#x51B3;&#x5B9A;&#x6027;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5199;&#x5728;&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x540E;&#xFF0C;&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x8981;&#x6267;&#x884C;&#x7684;&#x8BED;&#x53E5;&#x3002;</p>
<p><code>Number.isNaN</code>&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684; JavaScript &#x51FD;&#x6570;&#xFF0C;&#x4EC5;&#x5F53;&#x5B83;&#x7ED9;&#x51FA;&#x7684;&#x53C2;&#x6570;&#x662F;<code>NaN</code>&#x65F6;&#x624D;&#x8FD4;&#x56DE;<code>true</code>&#x3002; &#x5F53;&#x4F60;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;&#x4E0D;&#x4EE3;&#x8868;&#x6709;&#x6548;&#x6570;&#x5B57;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;<code>Number</code>&#x51FD;&#x6570;&#x6070;&#x597D;&#x8FD4;&#x56DE;<code>NaN</code>&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6761;&#x4EF6;&#x7FFB;&#x8BD1;&#x4E3A;&#x201C;&#x5982;&#x679C;<code>theNumber</code>&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6837;&#x505A;&#x201D;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>if</code>&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x88AB;&#x5927;&#x62EC;&#x53F7;&#xFF08;<code>{</code>&#x548C;<code>}</code>&#xFF09;&#x62EC;&#x8D77;&#x6765;&#x3002; &#x5B83;&#x4EEC;&#x53EF;&#x7528;&#x4E8E;&#x5C06;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x8BED;&#x53E5;&#x5206;&#x7EC4;&#x5230;&#x5355;&#x4E2A;&#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x79F0;&#x4E3A;&#x4EE3;&#x7801;&#x5757;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x5B83;&#x4EEC;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x662F;&#x5426;&#x9700;&#x8981;&#xFF0C;&#x5927;&#x591A;&#x6570; JavaScript &#x7A0B; &#x5E8F;&#x5458;&#x5728;&#x6BCF;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x88AB;&#x5305;&#x88F9;&#x7684;&#x8BED;&#x53E5;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002; &#x9664;&#x4E86;&#x5076;&#x5C14;&#x7684;&#x4E00;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x5927;&#x591A;&#x4F1A;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x7EA6;&#x5B9A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">if</span> (<span class="hljs-number">1</span> + <span class="hljs-number">1</span> == <span class="hljs-number">2</span>) <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;It&apos;s true&quot;</span>);
<span class="hljs-comment">// &#x2192; It&apos;s true</span>
</code></pre>
<p>&#x60A8;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x53EA;&#x6267;&#x884C;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#x65F6;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x4F1A;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x7684;&#x4EE3;&#x7801;&#x3002; &#x8BE5;&#x66FF;&#x4EE3;&#x8DEF;&#x5F84;&#x7531;&#x56FE;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x3002; &#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x4F7F;&#x7528;<code>if</code>&#x548C;<code>else</code>&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x66FF;&#x4EE3;&#x6267;&#x884C;&#x8DEF;&#x5F84;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> theNumber = <span class="hljs-built_in">Number</span>(prompt(<span class="hljs-string">&quot;Pick a number&quot;</span>));
<span class="hljs-keyword">if</span> (!<span class="hljs-built_in">Number</span>.isNaN(theNumber)) {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Your number is the square root of &quot;</span> +
              theNumber * theNumber);
} <span class="hljs-keyword">else</span> {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Hey. Why didn&apos;t you give me a number?&quot;</span>);
}
</code></pre>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x8DEF;&#x5F84;&#x591A;&#x4E8E;&#x4E24;&#x6761;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x591A;&#x4E2A;<code>if/else</code>&#x5BF9;&#x94FE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> num = <span class="hljs-built_in">Number</span>(prompt(<span class="hljs-string">&quot;Pick a number&quot;</span>, <span class="hljs-string">&quot;0&quot;</span>));

<span class="hljs-keyword">if</span> (num &lt; <span class="hljs-number">10</span>) {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Small&quot;</span>);
} <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (num &lt; <span class="hljs-number">100</span>) {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Medium&quot;</span>);
} <span class="hljs-keyword">else</span> {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Large&quot;</span>);
}
</code></pre>
<p>&#x8BE5;&#x7A0B;&#x5E8F;&#x9996;&#x5148;&#x4F1A;&#x68C0;&#x67E5;<code>num</code>&#x662F;&#x5426;&#x5C0F;&#x4E8E; 10&#x3002;&#x5982;&#x679C;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x663E;&#x793A;<code>&quot;Small&quot;</code>&#x7684;&#x8FD9;&#x6761;&#x8DEF;&#x5F84;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x5219;&#x9009;&#x62E9;<code>else</code>&#x5206;&#x652F;&#xFF0C;<code>else</code>&#x5206;&#x652F;&#x81EA;&#x8EAB;&#x5305;&#x542B;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;<code>if</code>&#x3002;&#x5982;&#x679C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6761;&#x4EF6;&#x5373;<code>num</code>&#x5C0F;&#x4E8E; 100 &#x6210;&#x7ACB;&#xFF0C;&#x4E14;&#x6570;&#x5B57;&#x7684;&#x8303;&#x56F4;&#x5728; 10 &#x5230; 100 &#x4E4B;&#x95F4;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x663E;&#x793A;<code>&quot;Medium&quot;</code>&#x7684;&#x8FD9;&#x6761;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x4E0A;&#x8FF0;&#x6761;&#x4EF6;&#x5747;&#x4E0D;&#x6EE1;&#x8DB3;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x6700;&#x540E;&#x4E00;&#x6761;<code>else</code>&#x5206;&#x652F;&#x8DEF;&#x5F84;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x6A21;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="img/2-4.svg" alt=""></p>
<h2 id="while&#x548C;do&#x5FAA;&#x73AF;"><code>while</code>&#x548C;<code>do</code>&#x5FAA;&#x73AF;</h2>
<p>&#x73B0;&#x8003;&#x8651;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x8F93;&#x51FA; 0 &#x5230; 12 &#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x5076;&#x6570;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x7F16;&#x5199;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">0</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">2</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">4</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">6</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">8</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">10</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">12</span>);
</code></pre>
<p>&#x8BE5;&#x7A0B;&#x5E8F;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x7F16;&#x7A0B;&#x7684;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x51CF;&#x5C11;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x800C;&#x975E;&#x589E;&#x52A0;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C0F;&#x4E8E; 1000 &#x7684;&#x5076;&#x6570;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6240;&#x9700;&#x7684;&#x662F;&#x91CD;&#x590D;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x79CD;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x79F0;&#x4E3A;&#x5FAA;&#x73AF;&#x3002;</p>
<p><img src="img/2-5.svg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x63A7;&#x5236;&#x6D41;&#x6765;&#x8BA9;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x56DE;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x8BA1;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> number = <span class="hljs-number">0</span>;
<span class="hljs-keyword">while</span> (number &lt;= <span class="hljs-number">12</span>) {
  <span class="hljs-built_in">console</span>.log(number);
  number = number + <span class="hljs-number">2</span>;
}
<span class="hljs-comment">// &#x2192; 0</span>
<span class="hljs-comment">// &#x2192; 2</span>
<span class="hljs-comment">//   &#x2026; etcetera</span>
</code></pre>
<p>&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x4EE5;&#x5173;&#x952E;&#x5B57;<code>while</code>&#x5F00;&#x5934;&#x3002;&#x5728;&#x5173;&#x952E;&#x5B57;<code>while</code>&#x540E;&#x7D27;&#x8DDF;&#x4E00;&#x4E2A;&#x7528;&#x62EC;&#x53F7;&#x62EC;&#x8D77;&#x6765;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x62EC;&#x53F7;&#x540E;&#x7D27;&#x8DDF;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#xFF0C;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x4E0E;<code>if</code>&#x8BED;&#x53E5;&#x7C7B;&#x4F3C;&#x3002;&#x53EA;&#x8981;&#x8868;&#x8FBE;&#x5F0F;&#x4EA7;&#x751F;&#x7684;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x5E03;&#x5C14;&#x503C;&#x540E;&#x4E3A;<code>true</code>&#xFF0C;&#x8BE5;&#x5FAA;&#x73AF;&#x4F1A;&#x6301;&#x7EED;&#x8FDB;&#x5165;&#x62EC;&#x53F7;&#x540E;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x3002;</p>
<p><code>number</code>&#x7ED1;&#x5B9A;&#x6F14;&#x793A;&#x4E86;&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x7A0B;&#x5E8F;&#x8FDB;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x91CD;&#x590D;&#x65F6;&#xFF0C;<code>number</code>&#x7684;&#x503C;&#x90FD;&#x6BD4;&#x4EE5;&#x524D;&#x7684;&#x503C;&#x591A; 2&#x3002; &#x5728;&#x6BCF;&#x6B21;&#x91CD;&#x590D;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x6570;&#x5B57; 12 &#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x6765;&#x51B3;&#x5B9A;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5426;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6765;&#x8BA1;&#x7B97;&#x5E76;&#x663E;&#x793A;<code>2**10</code>&#xFF08;2 &#x7684; 10 &#x6B21;&#x65B9;&#xFF09;&#x7684;&#x7ED3;&#x679C;&#x3002;  &#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x7ED1;&#x5B9A;&#xFF1A;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x6211;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x4E58;&#x4EE5; 2 &#x7684;&#x6B21;&#x6570;&#x3002; &#x8BE5;&#x5FAA;&#x73AF;&#x6D4B;&#x8BD5;&#x7B2C;&#x4E8C;&#x4E2A;&#x7ED1;&#x5B9A;&#x662F;&#x5426;&#x5DF2;&#x8FBE;&#x5230; 10&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5219;&#x66F4;&#x65B0;&#x8FD9;&#x4E24;&#x4E2A;&#x7ED1;&#x5B9A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> result = <span class="hljs-number">1</span>;
<span class="hljs-keyword">let</span> counter = <span class="hljs-number">0</span>;
<span class="hljs-keyword">while</span> (counter &lt; <span class="hljs-number">10</span>) {
  result = result * <span class="hljs-number">2</span>;
  counter = counter + <span class="hljs-number">1</span>;
}
<span class="hljs-built_in">console</span>.log(result);
<span class="hljs-comment">// &#x2192; 1024</span>
</code></pre>
<p>&#x8BA1;&#x6570;&#x5668;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;<code>1</code>&#x5F00;&#x59CB;&#x5E76;&#x68C0;&#x67E5;<code>&lt;= 10</code>&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x6F84;&#x6E05;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4ECE; 0 &#x5F00;&#x59CB;&#x8BA1;&#x6570;&#x662F;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;</p>
<p><code>do</code>&#x5FAA;&#x73AF;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x7C7B;&#x4F3C;&#x4E8E;<code>while</code>&#x5FAA;&#x73AF;&#x3002;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x533A;&#x522B;&#xFF1A;<code>do</code>&#x5FAA;&#x73AF;&#x81F3;&#x5C11;&#x6267;&#x884C;&#x4E00;&#x904D;&#x5FAA;&#x73AF;&#x4F53;&#xFF0C;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x5B8C;&#x5FAA;&#x73AF;&#x4F53;&#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x5F00;&#x59CB;&#x68C0;&#x6D4B;&#x5FAA;&#x73AF;&#x6761;&#x4EF6;&#x3002;<code>do</code>&#x5FAA;&#x73AF;&#x4E2D;&#x5C06;&#x6761;&#x4EF6;&#x68C0;&#x6D4B;&#x653E;&#x5728;&#x5FAA;&#x73AF;&#x4F53;&#x540E;&#x9762;&#xFF0C;&#x6B63;&#x53CD;&#x6620;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> yourName;
<span class="hljs-keyword">do</span> {
  yourName = prompt(<span class="hljs-string">&quot;Who are you?&quot;</span>);
} <span class="hljs-keyword">while</span> (!yourName);
<span class="hljs-built_in">console</span>.log(yourName);
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F1A;&#x5F3A;&#x5236;&#x4F60;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x3002; &#x5B83;&#x4F1A;&#x4E00;&#x518D;&#x8BE2;&#x95EE;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x5F97;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x662F;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x3002; <code>!</code>&#x8FD0;&#x7B97;&#x7B26;&#x4F1A;&#x5C06;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x518D;&#x53D6;&#x53CD;&#xFF0C;&#x9664;&#x4E86;<code>&quot;&quot;</code>&#x4E4B;&#x5916;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x8F6C;&#x6362;&#x4E3A;<code>true</code>&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x5FAA;&#x73AF;&#x6301;&#x7EED;&#x8FDB;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x60A8;&#x63D0;&#x4F9B;&#x4E86;&#x975E;&#x7A7A;&#x540D;&#x79F0;&#x3002;</p>
<h2 id="&#x4EE3;&#x7801;&#x7F29;&#x8FDB;">&#x4EE3;&#x7801;&#x7F29;&#x8FDB;</h2>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x8BED;&#x53E5;&#x524D;&#x6DFB;&#x52A0;&#x7A7A;&#x683C;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x8BED;&#x53E5;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x662F;&#x5FC5;&#x9700;&#x7684; - &#x6CA1;&#x6709;&#x5B83;&#x4EEC;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x4F1A;&#x63A5;&#x53D7;&#x8BE5;&#x7A0B;&#x5E8F;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6362;&#x884C;&#x7B26;&#x4E5F;&#x662F;&#x53EF;&#x9009;&#x7684;&#x3002; &#x5982;&#x679C;&#x4F60;&#x559C;&#x6B22;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x4E3A;&#x5F88;&#x957F;&#x7684;&#x4E00;&#x884C;&#x3002;</p>
<p>&#x5757;&#x5185;&#x7F29;&#x8FDB;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4F7F;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002; &#x5728;&#x5176;&#x4ED6;&#x5757;&#x5185;&#x5F00;&#x542F;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x770B;&#x5230;&#x5757;&#x7684;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#xFF0C;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x5757;&#x5F00;&#x59CB;&#x4F4D;&#x7F6E;&#x3002; &#x901A;&#x8FC7;&#x9002;&#x5F53;&#x7684;&#x7F29;&#x8FDB;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x89C6;&#x89C9;&#x5F62;&#x72B6;&#x5BF9;&#x5E94;&#x5176;&#x5185;&#x90E8;&#x5757;&#x7684;&#x5F62;&#x72B6;&#x3002; &#x6211;&#x559C;&#x6B22;&#x4E3A;&#x6BCF;&#x4E2A;&#x5F00;&#x542F;&#x7684;&#x5757;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x7A7A;&#x683C;&#xFF0C;&#x4F46;&#x98CE;&#x683C;&#x4E0D;&#x540C; - &#x6709;&#x4E9B;&#x4EBA;&#x4F7F;&#x7528;&#x56DB;&#x4E2A;&#x7A7A;&#x683C;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x4EBA;&#x4F7F;&#x7528;&#x5236;&#x8868;&#x7B26;&#x3002; &#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B0;&#x5757;&#x6DFB;&#x52A0;&#x76F8;&#x540C;&#x7684;&#x7A7A;&#x683C;&#x91CF;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">if</span> (<span class="hljs-literal">false</span> != <span class="hljs-literal">true</span>) {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;That makes sense.&quot;</span>);
  <span class="hljs-keyword">if</span> (<span class="hljs-number">1</span> &lt; <span class="hljs-number">2</span>) {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;No surprise there.&quot;</span>);
  }
}
</code></pre>
<p>&#x5927;&#x591A;&#x6570;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x7A0B;&#x5E8F;&#xFF08;&#x5305;&#x62EC;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x90A3;&#x4E2A;&#xFF09;&#x5C06;&#x901A;&#x8FC7;&#x81EA;&#x52A8;&#x7F29;&#x8FDB;&#x65B0;&#x884C;&#x6765;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;</p>
<h2 id="for&#x5FAA;&#x73AF;"><code>for</code>&#x5FAA;&#x73AF;</h2>
<p>&#x8BB8;&#x591A;&#x5FAA;&#x73AF;&#x9075;&#x5FAA;<code>while</code>&#x793A;&#x4F8B;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x89C4;&#x5F8B;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x7ED1;&#x5B9A;&#x6765;&#x8DDF;&#x8E2A;&#x5FAA;&#x73AF;&#x7684;&#x8FDB;&#x5EA6;&#x3002; &#x7136;&#x540E;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;<code>while</code>&#x5FAA;&#x73AF;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x68C0;&#x67E5;&#x8BA1;&#x6570;&#x5668;&#x662F;&#x5426;&#x5DF2;&#x8FBE;&#x5230;&#x5176;&#x6700;&#x7EC8;&#x503C;&#x3002; &#x5728;&#x5FAA;&#x73AF;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x66F4;&#x65B0;&#x8BA1;&#x6570;&#x5668;&#x6765;&#x8DDF;&#x8E2A;&#x8FDB;&#x5EA6;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x79CD;&#x89C4;&#x5F8B;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#xFF0C;JavaScript &#x548C;&#x7C7B;&#x4F3C;&#x7684;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7A0D;&#x77ED;&#x800C;&#x4E14;&#x66F4;&#x5168;&#x9762;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;<code>for</code>&#x5FAA;&#x73AF;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> number = <span class="hljs-number">0</span>; number &lt;= <span class="hljs-number">12</span>; number = number + <span class="hljs-number">2</span>)
  <span class="hljs-built_in">console</span>.log(number);
<span class="hljs-comment">// &#x2192; 0</span>
<span class="hljs-comment">// &#x2192; 2</span>
<span class="hljs-comment">//   &#x2026; etcetera</span>
</code></pre>
<p>&#x8BE5;&#x7A0B;&#x5E8F;&#x4E0E;&#x4E4B;&#x524D;&#x7684;&#x5076;&#x6570;&#x6253;&#x5370;&#x793A;&#x4F8B;&#x5B8C;&#x5168;&#x7B49;&#x4EF7;&#x3002; &#x552F;&#x4E00;&#x7684;&#x53D8;&#x5316;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x4E0E;&#x5FAA;&#x73AF;&#x201C;&#x72B6;&#x6001;&#x201D;&#x76F8;&#x5173;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x5728;<code>for</code>&#x4E4B;&#x540E;&#x88AB;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x5173;&#x952E;&#x5B57;<code>for</code>&#x540E;&#x9762;&#x7684;&#x62EC;&#x53F7;&#x4E2D;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x5206;&#x53F7;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5206;&#x53F7;&#x524D;&#x9762;&#x7684;&#x662F;&#x5FAA;&#x73AF;&#x7684;&#x521D;&#x59CB;&#x5316;&#x90E8;&#x5206;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x3002;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x5219;&#x662F;&#x5224;&#x65AD;&#x5FAA;&#x73AF;&#x662F;&#x5426;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x7684;&#x68C0;&#x67E5;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#x5219;&#x662F;&#x7528;&#x4E8E;&#x6BCF;&#x4E2A;&#x5FAA;&#x73AF;&#x8FED;&#x4EE3;&#x540E;&#x66F4;&#x65B0;&#x72B6;&#x6001;&#x7684;&#x8BED;&#x53E5;&#x3002;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<code>for</code>&#x5FAA;&#x73AF;&#x6BD4;<code>while</code>&#x8BED;&#x53E5;&#x66F4;&#x7B80;&#x77ED;&#x6E05;&#x6670;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;<code>for</code>&#x5FAA;&#x73AF;&#x4EE3;&#x66FF;<code>while</code>&#x5FAA;&#x73AF;&#xFF0C;&#x6765;&#x8BA1;&#x7B97;<code>2**10</code>&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> result = <span class="hljs-number">1</span>;
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> counter = <span class="hljs-number">0</span>; counter &lt; <span class="hljs-number">10</span>; counter = counter + <span class="hljs-number">1</span>)
  result = result * <span class="hljs-number">2</span>;
<span class="hljs-built_in">console</span>.log(result);
<span class="hljs-comment">// &#x2192; 1024</span>
</code></pre>
<h2 id="&#x8DF3;&#x51FA;&#x5FAA;&#x73AF;">&#x8DF3;&#x51FA;&#x5FAA;&#x73AF;</h2>
<p>&#x9664;&#x4E86;&#x5FAA;&#x73AF;&#x6761;&#x4EF6;&#x4E3A;<code>false</code>&#x65F6;&#x5FAA;&#x73AF;&#x4F1A;&#x7ED3;&#x675F;&#x4EE5;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;<code>break</code>&#x8BED;&#x53E5;&#x6765;&#x7ACB;&#x5373;&#x8DF3;&#x51FA;&#x5FAA;&#x73AF;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x5C55;&#x793A;&#x4E86;<code>break</code>&#x8BED;&#x53E5;&#x7684;&#x7528;&#x6CD5;&#x3002;&#x8BE5;&#x7A0B;&#x5E8F;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x627E;&#x51FA;&#x7B2C;&#x4E00;&#x4E2A;&#x5927;&#x4E8E;&#x7B49;&#x4E8E; 20 &#x4E14;&#x80FD;&#x88AB; 7 &#x6574;&#x9664;&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> current = <span class="hljs-number">20</span>; ; current++) {
  <span class="hljs-keyword">if</span> (current % <span class="hljs-number">7</span> == <span class="hljs-number">0</span>) 
    <span class="hljs-keyword">break</span>;
  }
}
<span class="hljs-comment">// &#x2192; 21</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4F59;&#x6570;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<code>%</code>&#xFF09;&#x6765;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x662F;&#x5426;&#x80FD;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x6574;&#x9664;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x6574;&#x9664;&#xFF0C;&#x5219;&#x4F59;&#x6570;&#x4E3A; 0&#x3002;</p>
<p>&#x672C;&#x4F8B;&#x4E2D;&#x7684;<code>for</code>&#x8BED;&#x53E5;&#x7701;&#x7565;&#x4E86;&#x68C0;&#x67E5;&#x5FAA;&#x73AF;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9664;&#x975E;&#x6267;&#x884C;&#x4E86;&#x5185;&#x90E8;&#x7684;<code>break</code>&#x8BED;&#x53E5;&#xFF0C;&#x5426;&#x5219;&#x5FAA;&#x73AF;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x7ED3;&#x675F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x5220;&#x9664;&#x8FD9;&#x4E2A;<code>break</code>&#x8BED;&#x53E5;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x4E0D;&#x5C0F;&#x5FC3;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x603B;&#x662F;&#x4EA7;&#x751F;<code>true</code>&#x7684;&#x7ED3;&#x675F;&#x6761;&#x4EF6;&#xFF0C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x9677;&#x5165;&#x6B7B;&#x5FAA;&#x73AF;&#x4E2D;&#x3002; &#x6B7B;&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5B8C;&#x6210;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4EF6;&#x574F;&#x4E8B;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x60A8;&#x5728;&#xFF08;&#x82F1;&#x6587;&#x7248;&#xFF09;&#x8FD9;&#x4E9B;&#x9875;&#x9762;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#x521B;&#x5EFA;&#x4E86;&#x6B7B;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x5219;&#x901A;&#x5E38;&#x4F1A;&#x8BE2;&#x95EE;&#x60A8;&#x662F;&#x5426;&#x8981;&#x5728;&#x51E0;&#x79D2;&#x949F;&#x540E;&#x505C;&#x6B62;&#x8BE5;&#x811A;&#x672C;&#x3002; &#x5982;&#x679C;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x60A8;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x5173;&#x95ED;&#x60A8;&#x6B63;&#x5728;&#x5904;&#x7406;&#x7684;&#x9009;&#x9879;&#x5361;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x67D0;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5173;&#x95ED;&#x6574;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4EE5;&#x4FBF;&#x6062;&#x590D;&#x3002;</p>
</blockquote>
<p><code>continue</code>&#x5173;&#x952E;&#x5B57;&#x4E0E;<code>break</code>&#x7C7B;&#x4F3C;&#xFF0C;&#x4E5F;&#x4F1A;&#x5BF9;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;&#x5FAA;&#x73AF;&#x4F53;&#x4E2D;&#x7684;<code>continue</code>&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x8DF3;&#x51FA;&#x5FAA;&#x73AF;&#x4F53;&#xFF0C;&#x5E76;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x8F6E;&#x5FAA;&#x73AF;&#x8FED;&#x4EE3;&#x3002;</p>
<h2 id="&#x66F4;&#x65B0;&#x7ED1;&#x5B9A;&#x7684;&#x7B80;&#x4FBF;&#x65B9;&#x6CD5;">&#x66F4;&#x65B0;&#x7ED1;&#x5B9A;&#x7684;&#x7B80;&#x4FBF;&#x65B9;&#x6CD5;</h2>
<p>&#x7A0B;&#x5E8F;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6839;&#x636E;&#x7ED1;&#x5B9A;&#x7684;&#x539F;&#x503C;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x5E76;&#x66F4;&#x65B0;&#x503C;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x5FAA;&#x73AF;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x66F4;&#x52A0;&#x5E38;&#x89C1;&#x3002;</p>
<pre><code class="lang-js">counter = counter + <span class="hljs-number">1</span>;
</code></pre>
<p>JavaScript &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7B80;&#x4FBF;&#x5199;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-js">counter += <span class="hljs-number">1</span>;
</code></pre>
<p>JavaScript &#x8FD8;&#x4E3A;&#x5176;&#x4ED6;&#x8FD0;&#x7B97;&#x7B26;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x7B80;&#x4FBF;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;<code>result*=2</code>&#x53EF;&#x4EE5;&#x5C06;<code>result</code>&#x53D8;&#x4E3A;&#x539F;&#x6765;&#x7684;&#x4E24;&#x500D;&#xFF0C;&#x800C;<code>counter-=1</code>&#x53EF;&#x4EE5;&#x5C06;<code>counter</code>&#x51CF; 1&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7A0D;&#x5FAE;&#x7B80;&#x5316;&#x6211;&#x4EEC;&#x7684;&#x8BA1;&#x6570;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> number = <span class="hljs-number">0</span>; number &lt;= <span class="hljs-number">12</span>; number += <span class="hljs-number">2</span>)
  <span class="hljs-built_in">console</span>.log(number);
</code></pre>
<p>&#x5BF9;&#x4E8E;<code>counter+=1</code>&#x548C;<code>counter-=1</code>&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#xFF0C;<code>counter+=1</code>&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x4E3A;<code>counter++</code>&#xFF0C;<code>counter-=1</code>&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x4E3A;<code>counter--</code>&#x3002;</p>
<h2 id="switch&#x6761;&#x4EF6;&#x5206;&#x652F;"><code>switch</code>&#x6761;&#x4EF6;&#x5206;&#x652F;</h2>
<p>&#x6211;&#x4EEC;&#x5F88;&#x5C11;&#x4F1A;&#x7F16;&#x5199;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">if</span> (x == <span class="hljs-string">&quot;value1&quot;</span>) action1();
<span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (x == <span class="hljs-string">&quot;value2&quot;</span>) action2();
<span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (x == <span class="hljs-string">&quot;value3&quot;</span>) action3();
<span class="hljs-keyword">else</span> defaultAction();
</code></pre>
<p>&#x6709;&#x4E00;&#x79CD;&#x540D;&#x4E3A;<code>switch</code>&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x4E3A;&#x4E86;&#x4EE5;&#x66F4;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x8FBE;&#x8FD9;&#x79CD;&#x201C;&#x5206;&#x53D1;&#x201D;&#x3002; &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;JavaScript &#x4E3A;&#x6B64;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x5B83;&#x4ECE; C/Java &#x8BED;&#x8A00;&#x4E2D;&#x7EE7;&#x627F;&#x800C;&#x6765;&#xFF09;&#x6709;&#x4E9B;&#x7B28;&#x62D9; - <code>if</code>&#x8BED;&#x53E5;&#x94FE;&#x770B;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x66F4;&#x597D;&#x3002; &#x8FD9;&#x91CC;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">switch</span> (prompt(<span class="hljs-string">&quot;What is the weather like?&quot;</span>)) {
  <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;rainy&quot;</span>:
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Remember to bring an umbrella.&quot;</span>);
    <span class="hljs-keyword">break</span>;
  <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;sunny&quot;</span>:
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Dress lightly.&quot;</span>);
  <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;cloudy&quot;</span>:
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Go outside.&quot;</span>);
    <span class="hljs-keyword">break</span>;
  <span class="hljs-keyword">default</span>:
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Unknown weather type!&quot;</span>);
    <span class="hljs-keyword">break</span>;
}
</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;<code>switch</code>&#x6253;&#x5F00;&#x7684;&#x5757;&#x5185;&#x653E;&#x7F6E;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;<code>case</code>&#x6807;&#x7B7E;&#x3002; &#x7A0B;&#x5E8F;&#x4F1A;&#x5728;&#x5411;<code>switch</code>&#x63D0;&#x4F9B;&#x7684;&#x503C;&#x7684;&#x5BF9;&#x5E94;&#x6807;&#x7B7E;&#x5904;&#x5F00;&#x59CB;&#x6267;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5339;&#x914D;&#x503C;&#xFF0C;&#x5219;&#x5728;<code>default</code>&#x5904;&#x5F00;&#x59CB;&#x3002; &#x751A;&#x81F3;&#x8DE8;&#x8D8A;&#x4E86;&#x5176;&#x4ED6;&#x6807;&#x7B7E;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x8FBE;&#x5230;&#x4E86;<code>break</code>&#x58F0;&#x660E;&#x3002; &#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x793A;&#x4F8B;&#x4E2D;&#x7684;<code>&quot;sunny&quot;</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5728;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x4E0B;&#x5171;&#x4EAB;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#xFF08;&#x5B83;&#x5EFA;&#x8BAE;&#x5728;&#x6674;&#x5929;&#x548C;&#x591A;&#x4E91;&#x5929;&#x6C14;&#x5916;&#x51FA;&#xFF09;&#x3002; &#x4F46;&#x8981;&#x5C0F;&#x5FC3; - &#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8BB0;&#x8FD9;&#x6837;&#x7684;<code>break</code>&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4F60;&#x4E0D;&#x60F3;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="&#x5927;&#x5199;">&#x5927;&#x5199;</h2>
<p>&#x7ED1;&#x5B9A;&#x540D;&#x4E2D;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x7A7A;&#x683C;&#xFF0C;&#x4F46;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x5355;&#x8BCD;&#x6709;&#x52A9;&#x4E8E;&#x6E05;&#x6670;&#x8868;&#x8FBE;&#x7ED1;&#x5B9A;&#x7684;&#x5B9E;&#x9645;&#x7528;&#x9014;&#x3002;&#x5F53;&#x7ED1;&#x5B9A;&#x540D;&#x4E2D;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5355;&#x8BCD;&#x65F6;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x591A;&#x79CD;&#x5199;&#x6CD5;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7684;&#x51E0;&#x79CD;&#x7ED1;&#x5B9A;&#x540D;&#x4E66;&#x5199;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-js">fuzzylittleturtle
fuzzy_little_turtle
FuzzyLittleTurtle
fuzzyLittleTurtle
</code></pre>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x9605;&#x8BFB;&#x3002; &#x6211;&#x66F4;&#x559C;&#x6B22;&#x4E0B;&#x5212;&#x7EBF;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x6709;&#x70B9;&#x75DB;&#x82E6;&#x3002; &#x6807;&#x51C6;&#x7684; JavaScript &#x51FD;&#x6570;&#x548C;&#x5927;&#x591A;&#x6570; JavaScript &#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x9075;&#x5FAA;&#x6700;&#x5E95;&#x4E0B;&#x7684;&#x98CE;&#x683C; - &#x9664;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x8BCD;&#x4EE5;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F1A;&#x5C06;&#x6BCF;&#x4E2A;&#x8BCD;&#x7684;&#x9996;&#x5B57;&#x6BCD;&#x5927;&#x5199;&#x3002; &#x8981;&#x4E60;&#x60EF;&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x4E8B;&#x5E76;&#x4E0D;&#x56F0;&#x96BE;&#xFF0C;&#x800C;&#x4E14;&#x6DF7;&#x5408;&#x547D;&#x540D;&#x98CE;&#x683C;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4EBA;&#x53CD;&#x611F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x7EA6;&#x5B9A;&#x3002;</p>
<p>&#x5728;&#x6781;&#x5C11;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7ED1;&#x5B9A;&#x540D;&#x9996;&#x5B57;&#x6BCD;&#x4E5F;&#x4F1A;&#x5927;&#x5199;&#xFF0C;&#x6BD4;&#x5982;<code>Number</code>&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7528;&#x6765;&#x8868;&#x793A;&#x8BE5;&#x51FD;&#x6570;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x7B2C;6&#x7AE0;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7EA0;&#x7ED3;&#x4E8E;&#x8868;&#x9762;&#x4E0A;&#x7684;&#x98CE;&#x683C;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<h2 id="&#x6CE8;&#x91CA;">&#x6CE8;&#x91CA;</h2>
<p>&#x901A;&#x5E38;&#xFF0C;&#x539F;&#x59CB;&#x4EE3;&#x7801;&#x5E76;&#x4E0D;&#x80FD;&#x4F20;&#x8FBE;&#x4F60;&#x8BA9;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F20;&#x8FBE;&#x7ED9;&#x8BFB;&#x8005;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x4EE5;&#x795E;&#x79D8;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x4E86;&#x89E3;&#x5B83;&#x3002; &#x5728;&#x5176;&#x4ED6;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x53EA;&#x60F3;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F5C;&#x4E3A;&#x4F60;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x8FD9;&#x662F;&#x6CE8;&#x91CA;&#x7684;&#x7528;&#x9014;&#x3002;</p>
<p>&#x6CE8;&#x91CA;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#xFF0C;&#x800C;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x65F6;&#x8BA1;&#x7B97;&#x673A;&#x4F1A;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x6389;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x3002;JavaScript &#x4E2D;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x5199;&#x5355;&#x884C;&#x6CE8;&#x91CA;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x659C;&#x6760;&#x5B57;&#x7B26;&#x5F00;&#x5934;&#xFF0C;&#x5E76;&#x5728;&#x540E;&#x9762;&#x6DFB;&#x52A0;&#x6587;&#x672C;&#x6CE8;&#x91CA;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> accountBalance = calculateBalance(account);
<span class="hljs-comment">// It&apos;s a green hollow where a river sings</span>
accountBalance.adjust();
<span class="hljs-comment">// Madly catching white tatters in the grass.</span>
<span class="hljs-keyword">let</span> report = <span class="hljs-keyword">new</span> Report();
<span class="hljs-comment">// Where the sun on the proud mountain rings:</span>
addToReport(accountBalance, report);
<span class="hljs-comment">// It&apos;s a little valley, foaming like light in a glass.</span>
</code></pre>
<p><code>//</code>&#x6CE8;&#x91CA;&#x53EA;&#x80FD;&#x5230;&#x8FBE;&#x884C;&#x5C3E;&#x3002; <code>/*</code>&#x548C;<code>*/</code>&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x662F;&#x5426;&#x5305;&#x542B;&#x6362;&#x884C;&#x7B26;&#x3002; &#x8FD9;&#x5BF9;&#x6DFB;&#x52A0;&#x6587;&#x4EF6;&#x6216;&#x7A0B;&#x5E8F;&#x5757;&#x7684;&#x4FE1;&#x606F;&#x5757;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">/*
 I first found this number scrawled on the back of one of
 an old notebook. Since then, it has often dropped by,
 showing up in phone numbers and the serial numbers of
 products that I&apos;ve bought. It obviously likes me, so I&apos;ve
 decided to keep it.
*/</span>
<span class="hljs-keyword">const</span> myNumber = <span class="hljs-number">11213</span>;
</code></pre>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x5E76;&#x4E86;&#x89E3;&#x4E86;&#x7A0B;&#x5E8F;&#x7531;&#x8BED;&#x53E5;&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x6BCF;&#x6761;&#x8BED;&#x53E5;&#x53C8;&#x6709;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E86;&#x66F4;&#x591A;&#x8BED;&#x53E5;&#x3002;&#x5728;&#x8BED;&#x53E5;&#x4E2D;&#x5F80;&#x5F80;&#x5305;&#x542B;&#x4E86;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x800C;&#x8868;&#x8FBE;&#x5F0F;&#x8FD8;&#x53EF;&#x4EE5;&#x7531;&#x66F4;&#x5C0F;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x6309;&#x987A;&#x5E8F;&#x7F16;&#x5199;&#xFF0C;&#x5E76;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x6267;&#x884C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#xFF08;<code>if</code>&#x3001;<code>else</code>&#x548C;<code>switch</code>&#xFF09;&#x6216;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#xFF08;<code>while</code>&#x3001;<code>do</code>&#x548C;<code>for</code>&#xFF09;&#x6765;&#x6539;&#x53D8;&#x7A0B;&#x5E8F;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x3002;</p>
<p>&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x7528;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x540D;&#x5BF9;&#x5176;&#x5F15;&#x7528;&#x3002;&#x800C;&#x4E14;&#x5728;&#x8BB0;&#x5F55;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x72B6;&#x6001;&#x65F6;&#x5341;&#x5206;&#x6709;&#x7528;&#x3002;&#x73AF;&#x5883;&#x662F;&#x4E00;&#x7EC4;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x7ED1;&#x5B9A;&#x96C6;&#x5408;&#x3002;JavaScript &#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x603B;&#x4F1A;&#x5305;&#x542B;&#x4E00;&#x7CFB;&#x5217;&#x6709;&#x7528;&#x7684;&#x6807;&#x51C6;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x503C;&#xFF0C;&#x7528;&#x4E8E;&#x5C01;&#x88C5;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>functionName(arg1, arg2)</code>&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x6765;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x3002;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x503C;&#x3002;</p>
<h2 id="&#x4E60;&#x9898;">&#x4E60;&#x9898;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x6E05;&#x695A;&#x5728;&#x54EA;&#x91CC;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E60;&#x9898;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x672C;&#x4E66;&#x7684;&#x7B80;&#x4ECB;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x7EC3;&#x4E60;&#x90FD;&#x4EE5;&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x5F00;&#x59CB;&#x3002; &#x9605;&#x8BFB;&#x5E76;&#x5C1D;&#x8BD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x3002; &#x5982;&#x679C;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x9605;&#x8BFB;&#x7EC3;&#x4E60;&#x540E;&#x7684;&#x63D0;&#x793A;&#x3002; &#x672C;&#x4E66;&#x4E0D;&#x5305;&#x542B;&#x7EC3;&#x4E60;&#x7684;&#x5B8C;&#x6574;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x60A8;&#x53EF;&#x4EE5;&#x5728; <a href="https://eloquentjavascript.net/code#2" target="_blank">eloquentjavascript.net/code</a> &#x4E0A;&#x5728;&#x7EBF;&#x67E5;&#x627E;&#x5B83;&#x4EEC;&#x3002; &#x5982;&#x679C;&#x4F60;&#x60F3;&#x4ECE;&#x7EC3;&#x4E60;&#x4E2D;&#x5B66;&#x5230;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4EC5;&#x5728;&#x4F60;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x4E4B;&#x540E;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x5728;&#x4F60;&#x52AA;&#x529B;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x800C;&#x611F;&#x5230;&#x5934;&#x75BC;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h3 id="loopingatriangle">LoopingaTriangle</h3>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#xFF0C;&#x8C03;&#x7528; 7 &#x6B21;<code>console.log</code>&#x51FD;&#x6570;&#xFF0C;&#x6253;&#x5370;&#x51FA;&#x5982;&#x4E0B;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#xFF1A;</p>
<pre><code>#
##
###
####
#####
######
#######
</code></pre><p>&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x5C0F;&#x6280;&#x5DE7;&#xFF0C;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x540E;&#x52A0;&#x4E0A;<code>.length</code>&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> abc = <span class="hljs-string">&quot;abc&quot;</span>;
<span class="hljs-built_in">console</span>.log(abc.length);
<span class="hljs-comment">// &#x2192; 3</span>
</code></pre>
<h3 id="fizzbuzz">FizzBuzz</h3>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x7528;<code>console.log</code>&#x6253;&#x5370;&#x51FA;&#x4ECE; 1 &#x5230; 100 &#x7684;&#x6240;&#x6709;&#x6570;&#x5B57;&#x3002;&#x4E0D;&#x8FC7;&#x6709;&#x4E24;&#x79CD;&#x4F8B;&#x5916;&#x60C5;&#x51B5;&#xFF1A;&#x5F53;&#x6570;&#x5B57;&#x80FD;&#x88AB; 3 &#x6574;&#x9664;&#x65F6;&#xFF0C;&#x4E0D;&#x6253;&#x5370;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x6253;&#x5370;<code>&quot;Fizz&quot;</code>&#x3002;&#x5F53;&#x6570;&#x5B57;&#x80FD;&#x88AB; 5 &#x6574;&#x9664;&#x65F6;&#xFF08;&#x4F46;&#x4E0D;&#x80FD;&#x88AB; 3 &#x6574;&#x9664;&#xFF09;&#xFF0C;&#x4E0D;&#x6253;&#x5370;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x6253;&#x5370;<code>&quot;Buzz&quot;</code>&#x3002;</p>
<p>&#x5F53;&#x4EE5;&#x4E0A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x540E;&#xFF0C;&#x8BF7;&#x4FEE;&#x6539;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BA9;&#x7A0B;&#x5E8F;&#x5728;&#x9047;&#x5230;&#x80FD;&#x540C;&#x65F6;&#x88AB; 3 &#x4E0E; 5 &#x6574;&#x9664;&#x7684;&#x6570;&#x5B57;&#x65F6;&#xFF0C;&#x6253;&#x5370;&#x51FA;<code>&quot;FizzBuzz&quot;</code>&#x3002;</p>
<p>&#xFF08;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x9762;&#x8BD5;&#x95EE;&#x9898;&#xFF0C;&#x636E;&#x8BF4;&#x5254;&#x9664;&#x4E86;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x5458;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x7684;&#x52B3;&#x52A8;&#x529B;&#x5E02;&#x573A;&#x4EF7;&#x503C;&#x5C31;&#x4F1A;&#x4E0A;&#x5347;&#x3002;&#xFF09;</p>
<h3 id="&#x68CB;&#x76D8;">&#x68CB;&#x76D8;</h3>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7528;&#x4E8E;&#x8868;&#x793A;<code>8&#xD7;8</code>&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6362;&#x884C;&#x7B26;&#x5206;&#x9694;&#x884C;&#x3002;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x662F;&#x7A7A;&#x683C;&#x6216;&#x5B57;&#x7B26;<code>&quot;#&quot;</code>&#x3002;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x5F20;&#x68CB;&#x76D8;&#x3002;</p>
<p>&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x4F20;&#x9012;&#x7ED9;<code>console.log</code>&#x5C06;&#x4F1A;&#x8F93;&#x51FA;&#x4EE5;&#x4E0B;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code> # # # #
# # # #
 # # # #
# # # #
 # # # #
# # # #
 # # # #
# # # #
</code></pre><p>&#x5F53;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x8FD9;&#x6837;&#x7684;&#x8F93;&#x51FA;&#x540E;&#xFF0C;&#x8BF7;&#x5B9A;&#x4E49;&#x7ED1;&#x5B9A;<code>size=8</code>&#xFF0C;&#x5E76;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x4EFB;&#x610F;&#x5C3A;&#x5BF8;&#xFF08;&#x957F;&#x5BBD;&#x7531;<code>size</code>&#x786E;&#x5B9A;&#xFF09;&#x7684;&#x68CB;&#x76D8;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x7ED9;&#x5B9A;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x7684;&#x7F51;&#x683C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.html" class="navigation navigation-prev " aria-label="Previous page: 一、值，类型和运算符">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3.html" class="navigation navigation-next " aria-label="Next page: 三、函数">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"二、程序结构","level":"1.4","depth":1,"next":{"title":"三、函数","level":"1.5","depth":1,"path":"3.md","ref":"3.md","articles":[]},"previous":{"title":"一、值，类型和运算符","level":"1.3","depth":1,"path":"1.md","ref":"1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"2.md","mtime":"2019-12-08T16:07:04.992Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

