
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>四、数据结构：对象和数组 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="5.html" />
    
    
    <link rel="prev" href="3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >四、数据结构：对象和数组</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x56DB;&#x3001;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;">&#x56DB;&#x3001;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;</h2>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/04_data.html" target="_blank">Data Structures: Objects and Arrays</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>On two occasions I have been asked, &#x2018;Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?&#x2019; [...] I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question.</p>
<p>Charles Babbage&#xFF0C;&#x300A;Passages from the Life of a Philosopher&#x300B;&#xFF08;1864&#xFF09;</p>
</blockquote>
<p><img src="img/4-0.jpg" alt=""></p>
<p>&#x6570;&#x5B57;&#xFF0C;&#x5E03;&#x5C14;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x6784;&#x5EFA;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x539F;&#x5B50;&#x3002; &#x4E0D;&#x8FC7;&#xFF0C;&#x8BB8;&#x591A;&#x7C7B;&#x578B;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x539F;&#x5B50;&#x3002; &#x5BF9;&#x8C61;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5C06;&#x503C;&#xFF08;&#x5305;&#x62EC;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#xFF09;&#x653E;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x6765;&#x6784;&#x5EFA;&#x66F4;&#x590D;&#x6742;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6784;&#x5EFA;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x53D7;&#x5230;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x5728;&#x7B80;&#x5355;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E0A;&#x8FD0;&#x884C;&#x3002; &#x672C;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002; &#x5230;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x77E5;&#x9053;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x6709;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x5C06;&#x7740;&#x624B;&#x4E8E;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x793A;&#x4F8B;&#xFF0C;&#x5F53;&#x6982;&#x5FF5;&#x9002;&#x7528;&#x4E8E;&#x624B;&#x5934;&#x95EE;&#x9898;&#x65F6;&#x5F15;&#x5165;&#x5B83;&#x4EEC;&#x3002; &#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x57FA;&#x4E8E;&#x672C;&#x6587;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x51FD;&#x6570;&#x548C;&#x7ED1;&#x5B9A;&#x3002;</p>
<h2 id="&#x677E;&#x9F20;&#x4EBA;">&#x677E;&#x9F20;&#x4EBA;</h2>
<p>&#x4E00;&#x822C;&#x5728;&#x665A;&#x4E0A;&#x516B;&#x70B9;&#x5230;&#x5341;&#x70B9;&#x4E4B;&#x95F4;&#xFF0C;&#x96C5;&#x514B;&#x5C31;&#x4F1A;&#x53D8;&#x8EAB;&#x6210;&#x4E3A;&#x4E00;&#x53EA;&#x6BDB;&#x8338;&#x8338;&#x7684;&#x677E;&#x9F20;&#xFF0C;&#x5C3E;&#x5DF4;&#x4E0A;&#x7684;&#x6BDB;&#x5341;&#x5206;&#x6D53;&#x5BC6;&#x3002;</p>
<p>&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x96C5;&#x514B;&#x975E;&#x5E38;&#x9AD8;&#x5174;&#x4ED6;&#x6CA1;&#x6709;&#x53D8;&#x6210;&#x7ECF;&#x5178;&#x7684;&#x72FC;&#x4EBA;&#x3002; &#x4E0E;&#x53D8;&#x6210;&#x72FC;&#x76F8;&#x6BD4;&#xFF0C;&#x53D8;&#x6210;&#x677E;&#x9F20;&#x7684;&#x786E;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x5C11;&#x7684;&#x95EE;&#x9898;&#x3002; &#x4ED6;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5076;&#x7136;&#x5403;&#x6389;&#x90BB;&#x5C45;&#xFF08;&#x90A3;&#x4F1A;&#x5F88;&#x5C34;&#x5C2C;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x62C5;&#x5FC3;&#x88AB;&#x90BB;&#x5C45;&#x7684;&#x732B;&#x5403;&#x6389;&#x3002; &#x4ED6;&#x5728;&#x6A61;&#x6728;&#x6811;&#x51A0;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x8584;&#x8584;&#x7684;&#x6811;&#x679D;&#x4E0A;&#x9192;&#x6765;&#xFF0C;&#x8D64;&#x8EAB;&#x88F8;&#x4F53;&#x5E76;&#x8FF7;&#x5931;&#x65B9;&#x5411;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x6B21;&#x5076;&#x7136;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x5728;&#x665A;&#x4E0A;&#x9501;&#x4E0A;&#x4E86;&#x623F;&#x95F4;&#x7684;&#x95E8;&#x7A97;&#xFF0C;&#x5E76;&#x5728;&#x5730;&#x677F;&#x4E0A;&#x653E;&#x4E86;&#x51E0;&#x4E2A;&#x6838;&#x6843;&#xFF0C;&#x6765;&#x4F7F;&#x81EA;&#x5DF1;&#x5FD9;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x732B;&#x548C;&#x6811;&#x7684;&#x95EE;&#x9898;&#x3002; &#x4F46;&#x96C5;&#x514B;&#x5B81;&#x613F;&#x5B8C;&#x5168;&#x6446;&#x8131;&#x4ED6;&#x7684;&#x72B6;&#x51B5;&#x3002; &#x4E0D;&#x89C4;&#x5F8B;&#x53D1;&#x751F;&#x7684;&#x53D8;&#x8EAB;&#x4F7F;&#x4ED6;&#x6000;&#x7591;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x7531;&#x67D0;&#x79CD;&#x4E1C;&#x897F;&#x89E6;&#x53D1;&#x3002; &#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4ED6;&#x76F8;&#x4FE1;&#x53EA;&#x6709;&#x5728;&#x4ED6;&#x9760;&#x8FD1;&#x6A61;&#x6811;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#x3002; &#x4F46;&#x662F;&#x907F;&#x5F00;&#x6A61;&#x6811;&#x4E0D;&#x80FD;&#x963B;&#x6B62;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x96C5;&#x514B;&#x5207;&#x6362;&#x5230;&#x4E86;&#x66F4;&#x79D1;&#x5B66;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5F00;&#x59CB;&#x6BCF;&#x5929;&#x8BB0;&#x5F55;&#x4ED6;&#x5728;&#x67D0;&#x4E00;&#x5929;&#x6240;&#x505A;&#x7684;&#x6BCF;&#x4EF6;&#x4E8B;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x662F;&#x5426;&#x53D8;&#x8EAB;&#x3002; &#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x4ED6;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x7F29;&#x5C0F;&#x89E6;&#x53D1;&#x53D8;&#x8EAB;&#x7684;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x4ED6;&#x9700;&#x8981;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x5B58;&#x50A8;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<h2 id="&#x6570;&#x636E;&#x96C6;">&#x6570;&#x636E;&#x96C6;</h2>
<p>&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x5927;&#x91CF;&#x7684;&#x6570;&#x5B57;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x5176;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x673A;&#x5668;&#x5185;&#x5B58;&#x4E2D;&#x8868;&#x793A;&#x3002; &#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x8868;&#x793A;&#x4E00;&#x7EC4;&#x6570;&#x5B57; 2, 3, 5, 7 &#x548C; 11&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x521B;&#x5EFA; - &#x6BD5;&#x7ADF;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x6709;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5927;&#x91CF;&#x6570;&#x636E;&#x653E;&#x5165;&#x5B83;&#x4EEC;&#x4E2D;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;<code>&quot;2 3 5 7 11&quot;</code>&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x8868;&#x793A;&#x3002; &#x4F46;&#x8FD9;&#x5F88;&#x7B28;&#x62D9;&#x3002; &#x4F60;&#x5FC5;&#x987B;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x63D0;&#x53D6;&#x6570;&#x5B57;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x8F6C;&#x6362;&#x56DE;&#x6570;&#x5B57;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;JavaScript&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x6570;&#x7EC4;&#xFF0C;&#x5C06;&#x4E00;&#x8FDE;&#x4E32;&#x7684;&#x503C;&#x5199;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x5F53;&#x4E2D;&#xFF0C;&#x503C;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x9017;&#x53F7;&#xFF08;<code>,</code>&#xFF09;&#x5206;&#x9694;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> listOfNumbers = [<span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">5</span>, <span class="hljs-number">7</span>, <span class="hljs-number">11</span>];
<span class="hljs-built_in">console</span>.log(listOfNumbers[<span class="hljs-number">2</span>]);
<span class="hljs-comment">// &#x2192; 5</span>
<span class="hljs-built_in">console</span>.log(listOfNumbers[<span class="hljs-number">0</span>]);
<span class="hljs-comment">// &#x2192; 2</span>
<span class="hljs-built_in">console</span>.log(listOfNumbers[<span class="hljs-number">2</span> - <span class="hljs-number">1</span>]);
<span class="hljs-comment">// &#x2192; 3</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x540C;&#x6837;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x6765;&#x83B7;&#x53D6;&#x6570;&#x7EC4;&#x5F53;&#x4E2D;&#x7684;&#x503C;&#x3002;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x540E;&#x7D27;&#x8DDF;&#x4E00;&#x5BF9;&#x65B9;&#x62EC;&#x53F7;&#xFF0C;&#x5E76;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x586B;&#x5199;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x5728;&#x5DE6;&#x4FA7;&#x8868;&#x8FBE;&#x5F0F;&#x91CC;&#x67E5;&#x627E;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x7ED9;&#x5B9A;&#x7684;&#x7D22;&#x5F15;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x662F;&#x96F6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x3002; &#x6240;&#x4EE5;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7528;<code>listOfNumbers[0]</code>&#x83B7;&#x53D6;&#x3002; &#x57FA;&#x4E8E;&#x96F6;&#x7684;&#x8BA1;&#x6570;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x6709;&#x7740;&#x60A0;&#x4E45;&#x7684;&#x4F20;&#x7EDF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x610F;&#x4E49;&#x5F88;&#x5927;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x6765;&#x4E60;&#x60EF;&#x3002; &#x5C06;&#x7D22;&#x5F15;&#x770B;&#x4F5C;&#x8981;&#x8DF3;&#x8FC7;&#x7684;&#x9879;&#x76EE;&#x6570;&#x91CF;&#xFF0C;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x8BA1;&#x6570;&#x3002;</p>
<h2 id="&#x5C5E;&#x6027;">&#x5C5E;&#x6027;</h2>
<p>&#x5728;&#x4E4B;&#x524D;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x53EF;&#x7591;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;<code>myString.length</code>&#xFF08;&#x83B7;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#xFF09;&#x548C;<code>Math.max</code>&#xFF08;&#x6700;&#x5927;&#x503C;&#x51FD;&#x6570;&#xFF09;&#x3002; &#x8FD9;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x5C5E;&#x6027;&#x3002; &#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BBF;&#x95EE;<code>myString</code>&#x4E2D;&#x7684;<code>length</code>&#x5C5E;&#x6027;&#x3002; &#x7B2C;&#x4E8C;&#x4E2A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BBF;&#x95EE;<code>Math</code>&#x5BF9;&#x8C61;&#xFF08;&#x5B83;&#x662F;&#x6570;&#x5B66;&#x76F8;&#x5173;&#x5E38;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x7684;&#x96C6;&#x5408;&#xFF09;&#x4E2D;&#x7684;&#x540D;&#x4E3A;<code>max</code>&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x5728; JavaScript &#x4E2D;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x503C;&#x90FD;&#x6709;&#x5C5E;&#x6027;&#x3002;&#x4F46;<code>null</code>&#x548C;<code>undefined</code>&#x6CA1;&#x6709;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C1D;&#x8BD5;&#x8BBF;&#x95EE;<code>null</code>&#x548C;<code>undefined</code>&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-literal">null</span>.length;
<span class="hljs-comment">// &#x2192; TypeError: null has no properties</span>
</code></pre>
<p>&#x5728;JavaScript&#x4E2D;&#x8BBF;&#x95EE;&#x5C5E;&#x6027;&#x7684;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x662F;&#x70B9;&#xFF08;<code>.</code>&#xFF09;&#x548C;&#x65B9;&#x62EC;&#x53F7;&#xFF08;<code>[]</code>&#xFF09;&#x3002; <code>value.x</code>&#x548C;<code>value [x]</code>&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;<code>value</code>&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x3002; &#x533A;&#x522B;&#x5728;&#x4E8E;&#x5982;&#x4F55;&#x89E3;&#x91CA;<code>x</code>&#x3002; &#x4F7F;&#x7528;&#x70B9;&#x65F6;&#xFF0C;&#x70B9;&#x540E;&#x9762;&#x7684;&#x5355;&#x8BCD;&#x662F;&#x8BE5;&#x5C5E;&#x6027;&#x7684;&#x5B57;&#x9762;&#x540D;&#x79F0;&#x3002; &#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x65F6;&#xFF0C;&#x4F1A;&#x6C42;&#x89E3;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x83B7;&#x53D6;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x3002; &#x9274;&#x4E8E;<code>value.x</code>&#x83B7;&#x53D6;<code>value</code>&#x7684;&#x540D;&#x4E3A;<code>x</code>&#x7684;&#x5C5E;&#x6027;&#xFF0C;<code>value [x]</code>&#x5C1D;&#x8BD5;&#x6C42;&#x89E3;&#x8868;&#x8FBE;&#x5F0F;<code>x</code>&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x4F60;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5C5E;&#x6027;&#x53EB;&#x505A;<code>color</code>&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4F1A;&#x5199;<code>value.color</code>&#x3002; &#x5982;&#x679C;&#x4F60;&#x60F3;&#x63D0;&#x53D6;&#x5C5E;&#x6027;&#x7531;&#x7ED1;&#x5B9A;<code>i</code>&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x503C;&#x547D;&#x540D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5199;<code>value [i]</code>&#x3002; &#x5C5E;&#x6027;&#x540D;&#x79F0;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F46;&#x70B9;&#x7B26;&#x53F7;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x6709;&#x6548;&#x7ED1;&#x5B9A;&#x540D;&#x7684;&#x540D;&#x79F0;&#x3002; &#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BBF;&#x95EE;&#x540D;&#x4E3A;<code>2</code>&#x6216;<code>John Doe</code>&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#xFF1A;<code>value[2]</code>&#x6216;<code>value[&quot;John Doe&quot;]</code>&#x3002;</p>
<p>&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4EE5;&#x6570;&#x7EC4;&#x5C5E;&#x6027;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x3002; &#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x80FD;&#x7528;&#x70B9;&#x53F7;&#x6765;&#x8868;&#x793A;&#x6570;&#x5B57;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x7D22;&#x5F15;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x62EC;&#x53F7;&#x6765;&#x8868;&#x8FBE;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x6570;&#x7EC4;&#x7684;<code>length</code>&#x5C5E;&#x6027;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5B83;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x5143;&#x7D20;&#x3002; &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x540D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x7ED1;&#x5B9A;&#x540D;&#xFF0C;&#x6211;&#x4EEC;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x901A;&#x5E38;&#x5199;<code>array.length</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6BD4;<code>array[&quot;length&quot;]</code>&#x66F4;&#x5BB9;&#x6613;&#x7F16;&#x5199;&#x3002;</p>
<h2 id="&#x65B9;&#x6CD5;">&#x65B9;&#x6CD5;</h2>
<p>&#x9664;&#x4E86;<code>length</code>&#x5C5E;&#x6027;&#x4E4B;&#x5916;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x6301;&#x6709;&#x51FD;&#x6570;&#x503C;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> doh = <span class="hljs-string">&quot;Doh&quot;</span>;
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> doh.toUpperCase);
<span class="hljs-comment">// &#x2192; function</span>
<span class="hljs-built_in">console</span>.log(doh.toUpperCase());
<span class="hljs-comment">// &#x2192; DOH</span>
</code></pre>
<p>&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x6709;<code>toUpperCase</code>&#x5C5E;&#x6027;&#x3002; &#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x5B57;&#x6BCD;&#x8F6C;&#x6362;&#x4E3A;&#x5927;&#x5199;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x526F;&#x672C;&#x3002; &#x53E6;&#x5916;&#x8FD8;&#x6709;<code>toLowerCase</code>&#x3002;</p>
<p>&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5728;&#x8C03;&#x7528;<code>toUpperCase</code>&#x65F6;&#x4F20;&#x9012;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x8BE5;&#x51FD;&#x6570;&#x8BBF;&#x95EE;&#x4E86;&#x5B57;&#x7B26;&#x4E32;<code>&quot;Doh&quot;</code>&#xFF0C;&#x5373;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x5C5E;&#x6027;&#x6240;&#x5C5E;&#x7684;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x7B2C; 6 &#x7AE0;&#x4E2D;&#x9610;&#x8FF0;&#x8FD9;&#x5176;&#x4E2D;&#x7684;&#x539F;&#x7406;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5C06;&#x5305;&#x542B;&#x51FD;&#x6570;&#x7684;&#x5C5E;&#x6027;&#x79F0;&#x4E3A;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;<code>toUpperCase</code>&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x6B64;&#x793A;&#x4F8B;&#x6F14;&#x793A;&#x4E86;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x64CD;&#x4F5C;&#x6570;&#x7EC4;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> sequence = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
sequence.push(<span class="hljs-number">4</span>);
sequence.push(<span class="hljs-number">5</span>);
<span class="hljs-built_in">console</span>.log(sequence);
<span class="hljs-comment">// &#x2192; [1, 2, 3, 4, 5]</span>
<span class="hljs-built_in">console</span>.log(sequence.pop());
<span class="hljs-comment">// &#x2192; 5</span>
<span class="hljs-built_in">console</span>.log(sequence);
<span class="hljs-comment">// &#x2192; [1, 2, 3, 4]</span>
</code></pre>
<p><code>push</code>&#x65B9;&#x6CD5;&#x5C06;&#x503C;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x7EC4;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x800C;<code>pop</code>&#x65B9;&#x6CD5;&#x5219;&#x76F8;&#x53CD;&#xFF0C;&#x5220;&#x9664;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x503C;&#x5E76;&#x5C06;&#x5176;&#x8FD4;&#x56DE;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6709;&#x70B9;&#x611A;&#x8822;&#x7684;&#x540D;&#x5B57;&#x662F;&#x6808;&#x7684;&#x4F20;&#x7EDF;&#x672F;&#x8BED;&#x3002; &#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x6808;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4F60;&#x5C06;&#x503C;&#x63A8;&#x5165;&#x5E76;&#x6309;&#x76F8;&#x53CD;&#x987A;&#x5E8F;&#x518D;&#x6B21;&#x5F39;&#x51FA;&#xFF0C;&#x6700;&#x540E;&#x6DFB;&#x52A0;&#x7684;&#x5185;&#x5BB9;&#x9996;&#x5148;&#x88AB;&#x79FB;&#x9664;&#x3002; &#x8FD9;&#x4E9B;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#x5F88;&#x5E38;&#x89C1; - &#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x8BB0;&#x5F97;&#x524D;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6808;&#xFF0C;&#x5B83;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<h2 id="&#x5BF9;&#x8C61;">&#x5BF9;&#x8C61;</h2>
<p>&#x56DE;&#x5230;&#x677E;&#x9F20;&#x4EBA;&#x7684;&#x793A;&#x4F8B;&#x3002; &#x4E00;&#x7EC4;&#x6BCF;&#x65E5;&#x7684;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x3002; &#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x6761;&#x76EE;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x7531;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x6216;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7EC4;&#x6210; - &#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x4E00;&#x7CFB;&#x5217;&#x6D3B;&#x52A8;&#x548C;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x8868;&#x660E;&#x96C5;&#x514B;&#x662F;&#x5426;&#x53D8;&#x6210;&#x4E86;&#x677E;&#x9F20;&#x3002; &#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x5206;&#x7EC4;&#x7684;&#x503C;&#x653E;&#x5165;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x5C5E;&#x6027;&#x96C6;&#x5408;&#x3002; &#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5927;&#x62EC;&#x53F7;&#x4F5C;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> day1 = {
  squirrel: <span class="hljs-literal">false</span>,
  events: [<span class="hljs-string">&quot;work&quot;</span>, <span class="hljs-string">&quot;touched tree&quot;</span>, <span class="hljs-string">&quot;pizza&quot;</span>, <span class="hljs-string">&quot;running&quot;</span>]
};
<span class="hljs-built_in">console</span>.log(day1.squirrel);
<span class="hljs-comment">// &#x2192; false</span>
<span class="hljs-built_in">console</span>.log(day1.wolf);
<span class="hljs-comment">// &#x2192; undefined</span>
day1.wolf = <span class="hljs-literal">false</span>;
<span class="hljs-built_in">console</span>.log(day1.wolf);
<span class="hljs-comment">// &#x2192; false</span>
</code></pre>
<p>&#x5927;&#x62EC;&#x53F7;&#x5185;&#x6709;&#x4E00;&#x5217;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x5C5E;&#x6027;&#x3002; &#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;&#x540E;&#x8DDF;&#x4E00;&#x4E2A;&#x5192;&#x53F7;&#x548C;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5199;&#x4E3A;&#x591A;&#x884C;&#x65F6;&#xFF0C;&#x50CF;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x90A3;&#x6837;&#xFF0C;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x7F29;&#x8FDB;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#x3002; &#x540D;&#x79F0;&#x4E0D;&#x662F;&#x6709;&#x6548;&#x7ED1;&#x5B9A;&#x540D;&#x79F0;&#x6216;&#x6709;&#x6548;&#x6570;&#x5B57;&#x7684;&#x5C5E;&#x6027;&#x5FC5;&#x987B;&#x52A0;&#x5F15;&#x53F7;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> descriptions = {
  work: <span class="hljs-string">&quot;Went to work&quot;</span>,
  <span class="hljs-string">&quot;touched tree&quot;</span>: <span class="hljs-string">&quot;Touched a tree&quot;</span>
};
</code></pre>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5927;&#x62EC;&#x53F7;&#x5728; JavaScript &#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x542B;&#x4E49;&#x3002; &#x5728;&#x8BED;&#x53E5;&#x7684;&#x5F00;&#x5934;&#xFF0C;&#x4ED6;&#x4EEC;&#x8D77;&#x59CB;&#x4E86;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x5757;&#x3002; &#x5728;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#xFF0C;&#x4ED6;&#x4EEC;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002; &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8BED;&#x53E5;&#x5F88;&#x5C11;&#x4EE5;&#x82B1;&#x62EC;&#x53F7;&#x5BF9;&#x8C61;&#x5F00;&#x59CB;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x660E;&#x786E;&#x6027;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5927;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x5C5E;&#x6027;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;<code>undefined</code>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;=&#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x7ED9;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x8868;&#x8FBE;&#x5F0F;&#x8D4B;&#x503C;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x5C5E;&#x6027;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x9879;&#x64CD;&#x4F5C;&#x5C31;&#x4F1A;&#x66FF;&#x6362;&#x539F;&#x6709;&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x5C5E;&#x6027;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x4F1A;&#x5728;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x4E2D;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x7B80;&#x8981;&#x56DE;&#x987E;&#x6211;&#x4EEC;&#x7684;&#x7ED1;&#x5B9A;&#x7684;&#x89E6;&#x624B;&#x6A21;&#x578B; - &#x5C5E;&#x6027;&#x7ED1;&#x5B9A;&#x4E5F;&#x7C7B;&#x4F3C;&#x3002; &#x4ED6;&#x4EEC;&#x6355;&#x83B7;&#x503C;&#xFF0C;&#x4F46;&#x5176;&#x4ED6;&#x7ED1;&#x5B9A;&#x548C;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x4F1A;&#x6301;&#x6709;&#x8FD9;&#x4E9B;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5BF9;&#x8C61;&#x60F3;&#x8C61;&#x6210;&#x6709;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x89E6;&#x624B;&#x7684;&#x7AE0;&#x9C7C;&#xFF0C;&#x6BCF;&#x4E2A;&#x89E6;&#x624B;&#x4E0A;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x7684;&#x7EB9;&#x8EAB;&#x3002;</p>
<p><code>delete</code>&#x8FD0;&#x7B97;&#x7B26;&#x5207;&#x65AD;&#x7AE0;&#x9C7C;&#x7684;&#x89E6;&#x624B;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x5143;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x4E8E;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x5C06;&#x4ECE;&#x5BF9;&#x8C61;&#x4E2D;&#x5220;&#x9664;&#x6307;&#x5B9A;&#x7684;&#x5C5E;&#x6027;&#x3002; &#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x5E38;&#x89C1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> anObject = {left: <span class="hljs-number">1</span>, right: <span class="hljs-number">2</span>};
<span class="hljs-built_in">console</span>.log(anObject.left);
<span class="hljs-comment">// &#x2192; 1</span>
<span class="hljs-keyword">delete</span> anObject.left;
<span class="hljs-built_in">console</span>.log(anObject.left);
<span class="hljs-comment">// &#x2192; undefined</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;left&quot;</span> <span class="hljs-keyword">in</span> anObject);
<span class="hljs-comment">// &#x2192; false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;right&quot;</span> <span class="hljs-keyword">in</span> anObject);
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>
<p>&#x5F53;&#x5E94;&#x7528;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x4E8C;&#x5143;<code>in</code>&#x8FD0;&#x7B97;&#x7B26;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x8BE5;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5177;&#x6709;&#x540D;&#x79F0;&#x4E3A;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x3002; &#x5C06;&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x4E3A;<code>undefined</code>&#xFF0C;&#x548C;&#x5B9E;&#x9645;&#x5220;&#x9664;&#x5B83;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BF9;&#x8C61;&#x4ECD;&#x7136;&#x5177;&#x6709;&#x5C5E;&#x6027;&#xFF08;&#x5B83;&#x53EA;&#x662F;&#x6CA1;&#x6709;&#x6709;&#x610F;&#x4E49;&#x7684;&#x503C;&#xFF09;&#xFF0C;&#x800C;&#x5728;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C5E;&#x6027;&#x4E0D;&#x518D;&#x5B58;&#x5728;&#xFF0C;<code>in</code>&#x4F1A;&#x8FD4;&#x56DE;<code>false</code>&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x627E;&#x51FA;&#x5BF9;&#x8C61;&#x5177;&#x6709;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Object.keys</code>&#x51FD;&#x6570;&#x3002; &#x4F60;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x7EC4; - &#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.keys({x: <span class="hljs-number">0</span>, y: <span class="hljs-number">0</span>, z: <span class="hljs-number">2</span>}));
<span class="hljs-comment">// &#x2192; [&quot;x&quot;, &quot;y&quot;, &quot;z&quot;]</span>
</code></pre>
<p><code>Object.assign</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> objectA = {a: <span class="hljs-number">1</span>, b: <span class="hljs-number">2</span>};
<span class="hljs-built_in">Object</span>.assign(objectA, {b: <span class="hljs-number">3</span>, c: <span class="hljs-number">4</span>});
<span class="hljs-built_in">console</span>.log(objectA);
<span class="hljs-comment">// &#x2192; {a: 1, b: 3, c: 4}</span>
</code></pre>
<p>&#x7136;&#x540E;&#xFF0C;&#x6570;&#x7EC4;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x5BF9;&#x8C61;&#xFF0C;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5BF9;&#x8C61;&#x5E8F;&#x5217;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6C42;&#x89E3;<code>typeof []</code>&#xFF0C;&#x5B83;&#x4F1A;&#x4EA7;&#x751F;<code>object</code>&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B83;&#x4EEC;&#x662F;&#x957F;&#x800C;&#x5E73;&#x5766;&#x7684;&#x7AE0;&#x9C7C;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x89E6;&#x624B;&#x6574;&#x9F50;&#x6392;&#x5217;&#xFF0C;&#x5E76;&#x4EE5;&#x6570;&#x5B57;&#x6807;&#x8BB0;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x96C5;&#x514B;&#x7684;&#x65E5;&#x8BB0;&#x8868;&#x793A;&#x4E3A;&#x5BF9;&#x8C61;&#x6570;&#x7EC4;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> journal = [
  {events: [<span class="hljs-string">&quot;work&quot;</span>, <span class="hljs-string">&quot;touched tree&quot;</span>, <span class="hljs-string">&quot;pizza&quot;</span>,
            <span class="hljs-string">&quot;running&quot;</span>, <span class="hljs-string">&quot;television&quot;</span>],
   squirrel: <span class="hljs-literal">false</span>},
  {events: [<span class="hljs-string">&quot;work&quot;</span>, <span class="hljs-string">&quot;ice cream&quot;</span>, <span class="hljs-string">&quot;cauliflower&quot;</span>,
            <span class="hljs-string">&quot;lasagna&quot;</span>, <span class="hljs-string">&quot;touched tree&quot;</span>, <span class="hljs-string">&quot;brushed teeth&quot;</span>],
   squirrel: <span class="hljs-literal">false</span>},
  {events: [<span class="hljs-string">&quot;weekend&quot;</span>, <span class="hljs-string">&quot;cycling&quot;</span>, <span class="hljs-string">&quot;break&quot;</span>, <span class="hljs-string">&quot;peanuts&quot;</span>,
            <span class="hljs-string">&quot;beer&quot;</span>],
   squirrel: <span class="hljs-literal">true</span>},
  <span class="hljs-comment">/* and so on... */</span>
];
</code></pre>
<h2 id="&#x53EF;&#x53D8;&#x6027;">&#x53EF;&#x53D8;&#x6027;</h2>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5373;&#x5C06;&#x5F00;&#x59CB;&#x771F;&#x6B63;&#x7684;&#x7F16;&#x7A0B;&#x3002; &#x9996;&#x5148;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x8981;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5BF9;&#x8C61;&#x503C;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x3002; &#x524D;&#x9762;&#x51E0;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#xFF08;&#x5982;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5E03;&#x5C14;&#x503C;&#xFF09;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684; -- &#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E0D;&#x53EF;&#x80FD;&#x4FEE;&#x6539;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5E76;&#x4ECE;&#x5B83;&#x4EEC;&#x6D3E;&#x751F;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x91C7;&#x7528;&#x7279;&#x5B9A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x65F6;&#xFF0C;&#x8BE5;&#x503C;&#x5C06;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002; &#x91CC;&#x9762;&#x7684;&#x6587;&#x5B57;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5305;&#x542B;<code>&quot;cat&quot;</code>&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x4E0D;&#x53EF;&#x80FD;&#x4FEE;&#x6539;&#x4F60;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x6765;&#x4F7F;&#x5B83;&#x53D8;&#x6210;<code>&quot;rat&quot;</code>&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x5176;&#x5C5E;&#x6027;&#xFF0C;&#x4F7F;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x503C;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;120 &#x548C; 120 &#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x770B;&#x4F5C;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x6307;&#x5411;&#x76F8;&#x540C;&#x7684;&#x7269;&#x7406;&#x4F4D;&#x3002; &#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x62E5;&#x6709;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E24;&#x4E2A;&#x5F15;&#x7528;&#xFF0C;&#x548C;&#x62E5;&#x6709;&#x5305;&#x542B;&#x76F8;&#x540C;&#x5C5E;&#x6027;&#x7684;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#x3002; &#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> object1 = {value: <span class="hljs-number">10</span>};
<span class="hljs-keyword">let</span> object2 = object1;
<span class="hljs-keyword">let</span> object3 = {value: <span class="hljs-number">10</span>};

<span class="hljs-built_in">console</span>.log(object1 == object2);
<span class="hljs-comment">// &#x2192; true</span>
<span class="hljs-built_in">console</span>.log(object1 == object3);
<span class="hljs-comment">// &#x2192; false</span>

object1.value = <span class="hljs-number">15</span>;
<span class="hljs-built_in">console</span>.log(object2.value);
<span class="hljs-comment">// &#x2192; 15</span>
<span class="hljs-built_in">console</span>.log(object3.value);
<span class="hljs-comment">// &#x2192; 10</span>
</code></pre>
<p><code>object1</code>&#x548C;<code>object2</code>&#x7ED1;&#x5B9A;&#x6301;&#x6709;&#x76F8;&#x540C;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6539;&#x53D8;<code>object1</code>&#x4F1A;&#x6539;&#x53D8;<code>object2</code>&#x7684;&#x503C;&#x3002; &#x636E;&#x8BF4;&#x4ED6;&#x4EEC;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8EAB;&#x4EFD;&#x3002; &#x7ED1;&#x5B9A;<code>object3</code>&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x6700;&#x521D;&#x5305;&#x542B;&#x7684;&#x5C5E;&#x6027;&#x4E0E;<code>object1</code>&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8FC7;&#x7740;&#x5355;&#x72EC;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
<p>&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x662F;&#x53EF;&#x53D8;&#x7684;&#x6216;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0E;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x7684;&#x884C;&#x4E3A;&#x65B9;&#x5F0F;&#x662F;&#x5206;&#x5F00;&#x7684;&#x3002; &#x5373;&#x4F7F;&#x6570;&#x503C;&#x4E0D;&#x53D8;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>let</code>&#x7ED1;&#x5B9A;&#x6765;&#x8DDF;&#x8E2A;&#x4E00;&#x4E2A;&#x53D8;&#x5316;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x7ED1;&#x5B9A;&#x6240;&#x6307;&#x5411;&#x7684;&#x503C;&#x3002;&#x4E0E;&#x4E4B;&#x7C7B;&#x4F3C;&#xFF0C;&#x867D;&#x7136;&#x5BF9;&#x8C61;&#x7684;<code>const</code>&#x7ED1;&#x5B9A;&#x672C;&#x8EAB;&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#xFF0C;&#x5E76;&#x4E14;&#x59CB;&#x7EC8;&#x6307;&#x5411;&#x76F8;&#x540C;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> score = {visitors: <span class="hljs-number">0</span>, home: <span class="hljs-number">0</span>};
<span class="hljs-comment">// This is okay</span>
score.visitors = <span class="hljs-number">1</span>;
<span class="hljs-comment">// This isn&apos;t allowed</span>
score = {visitors: <span class="hljs-number">1</span>, home: <span class="hljs-number">1</span>};
</code></pre>
<p>&#x5F53;&#x4F60;&#x7528; JavaScript &#x7684;<code>==</code>&#x8FD0;&#x7B97;&#x7B26;&#x6BD4;&#x8F83;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5B83;&#x6309;&#x7167;&#x8EAB;&#x4EFD;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF1A;&#x4EC5;&#x5F53;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x503C;&#x4E25;&#x683C;&#x76F8;&#x540C;&#x65F6;&#x624D;&#x4EA7;&#x751F;<code>true</code>&#x3002; &#x6BD4;&#x8F83;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x8FD4;&#x56DE;<code>false</code>&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x5C5E;&#x6027;&#x76F8;&#x540C;&#x3002; JavaScript &#x4E2D;&#x6CA1;&#x6709;&#x5185;&#x7F6E;&#x7684;&#x201C;&#x6DF1;&#x5C42;&#x201D;&#x6BD4;&#x8F83;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x6309;&#x7167;&#x5185;&#x5BB9;&#x6BD4;&#x8F83;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x5B83;&#xFF08;&#x8FD9;&#x662F;&#x672C;&#x7AE0;&#x672B;&#x5C3E;&#x7684;&#x4E00;&#x4E2A;&#x7EC3;&#x4E60;&#xFF09;&#x3002;</p>
<h2 id="&#x677E;&#x9F20;&#x4EBA;&#x7684;&#x8BB0;&#x5F55;">&#x677E;&#x9F20;&#x4EBA;&#x7684;&#x8BB0;&#x5F55;</h2>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x96C5;&#x514B;&#x5F00;&#x59CB;&#x4E86;&#x4ED6;&#x7684; JavaScript &#x4E4B;&#x65C5;&#xFF0C;&#x5E76;&#x642D;&#x5EFA;&#x4E86;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x6BCF;&#x5929;&#x8BB0;&#x5F55;&#x7684;&#x4E00;&#x5957;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> journal = [];

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">addEntry</span>(<span class="hljs-params">events, squirrel</span>) </span>{
  journal.push({events, squirrel});
}
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#x6DFB;&#x52A0;&#x5230;&#x65E5;&#x8BB0;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x5947;&#x602A;&#x3002; &#x5B83;&#x4E0D;&#x50CF;<code>events:events</code>&#x90A3;&#x6837;&#x58F0;&#x660E;&#x5C5E;&#x6027;&#xFF0C;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5199;&#xFF0C;&#x610F;&#x601D;&#x4E00;&#x6837; - &#x5982;&#x679C;&#x5927;&#x62EC;&#x53F7;&#x4E2D;&#x7684;&#x5C5E;&#x6027;&#x540D;&#x540E;&#x9762;&#x6CA1;&#x6709;&#x503C;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x6765;&#x81EA;&#x76F8;&#x540C;&#x540D;&#x79F0;&#x7684;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x5341;&#x70B9; -- &#x6216;&#x8005;&#x6709;&#x65F6;&#x5019;&#x662F;&#x4E0B;&#x4E00;&#x5929;&#x7684;&#x65E9;&#x6668;&#xFF0C;&#x4ECE;&#x5B83;&#x7684;&#x4E66;&#x67B6;&#x9876;&#x90E8;&#x722C;&#x4E0B;&#x6765;&#x4E4B;&#x540E; -- &#x96C5;&#x514B;&#x8BB0;&#x5F55;&#x4E86;&#x8FD9;&#x4E00;&#x5929;&#x3002;</p>
<pre><code class="lang-js">addEntry([<span class="hljs-string">&quot;work&quot;</span>, <span class="hljs-string">&quot;touched tree&quot;</span>, <span class="hljs-string">&quot;pizza&quot;</span>, <span class="hljs-string">&quot;running&quot;</span>,
          <span class="hljs-string">&quot;television&quot;</span>], <span class="hljs-literal">false</span>);
addEntry([<span class="hljs-string">&quot;work&quot;</span>, <span class="hljs-string">&quot;ice cream&quot;</span>, <span class="hljs-string">&quot;cauliflower&quot;</span>, <span class="hljs-string">&quot;lasagna&quot;</span>,
          <span class="hljs-string">&quot;touched tree&quot;</span>, <span class="hljs-string">&quot;brushed teeth&quot;</span>], <span class="hljs-literal">false</span>);
addEntry([<span class="hljs-string">&quot;weekend&quot;</span>, <span class="hljs-string">&quot;cycling&quot;</span>, <span class="hljs-string">&quot;break&quot;</span>, <span class="hljs-string">&quot;peanuts&quot;</span>,
          <span class="hljs-string">&quot;beer&quot;</span>], <span class="hljs-literal">true</span>);
</code></pre>
<p>&#x4E00;&#x65E6;&#x4ED6;&#x6709;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x4ED6;&#x6253;&#x7B97;&#x4F7F;&#x7528;&#x7EDF;&#x8BA1;&#x5B66;&#x6765;&#x627E;&#x51FA;&#x54EA;&#x4E9B;&#x4E8B;&#x4EF6;&#x53EF;&#x80FD;&#x4E0E;&#x53D8;&#x6210;&#x677E;&#x9F20;&#x6709;&#x5173;&#x3002;</p>
<p>&#x5173;&#x8054;&#x6027;&#x662F;&#x7EDF;&#x8BA1;&#x7ED1;&#x5B9A;&#x4E4B;&#x95F4;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#x7684;&#x5EA6;&#x91CF;&#x3002; &#x7EDF;&#x8BA1;&#x7ED1;&#x5B9A;&#x4E0E;&#x7F16;&#x7A0B;&#x7ED1;&#x5B9A;&#x4E0D;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002; &#x5728;&#x7EDF;&#x8BA1;&#x5B66;&#x4E2D;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x4F1A;&#x6709;&#x4E00;&#x7EC4;&#x5EA6;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x7ED1;&#x5B9A;&#x90FD;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x5EA6;&#x91CF;&#x6765;&#x6D4B;&#x91CF;&#x3002; &#x7ED1;&#x5B9A;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;&#x901A;&#x5E38;&#x8868;&#x793A;&#x4E3A;&#x4ECE; -1 &#x5230; 1 &#x7684;&#x503C;&#x3002; &#x76F8;&#x5173;&#x6027;&#x4E3A;&#x96F6;&#x610F;&#x5473;&#x7740;&#x7ED1;&#x5B9A;&#x4E0D;&#x76F8;&#x5173;&#x3002; &#x76F8;&#x5173;&#x6027;&#x4E3A;&#x4E00;&#x8868;&#x660E;&#x4E24;&#x8005;&#x5B8C;&#x5168;&#x76F8;&#x5173; - &#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#xFF0C;&#x4F60;&#x4E5F;&#x77E5;&#x9053;&#x53E6;&#x4E00;&#x4E2A;&#x3002; &#x8D1F;&#x4E00;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x662F;&#x5B8C;&#x5168;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x662F;&#x76F8;&#x53CD;&#x7684; - &#x5F53;&#x4E00;&#x4E2A;&#x662F;&#x771F;&#x7684;&#x65F6;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x5047;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x5E03;&#x5C14;&#x7ED1;&#x5B9A;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;&#x5EA6;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; phi &#x7CFB;&#x6570;&#xFF08;<code>&#x3D5;</code>&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#xFF0C;&#x8F93;&#x5165;&#x4E3A;&#x4E00;&#x4E2A;&#x9891;&#x7387;&#x8868;&#x683C;&#xFF0C;&#x5305;&#x542B;&#x89C2;&#x6D4B;&#x7ED1;&#x5B9A;&#x7684;&#x4E0D;&#x540C;&#x7EC4;&#x5408;&#x7684;&#x6B21;&#x6570;&#x3002; &#x516C;&#x5F0F;&#x7684;&#x8F93;&#x51FA;&#x662F; -1 &#x548C; 1 &#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5403;&#x6BD4;&#x8428;&#x7684;&#x4E8B;&#x4EF6;&#x653E;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x9891;&#x7387;&#x8868;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x5EA6;&#x91CF;&#x4E2D;&#x7684;&#x7EC4;&#x5408;&#x7684;&#x51FA;&#x73B0;&#x6B21;&#x6570;&#x3002;</p>
<p><img src="img/4-1.svg" alt=""></p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;&#x90A3;&#x4E2A;&#x8868;&#x683C;&#x79F0;&#x4E3A;<code>n</code>&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x5217;&#x516C;&#x5F0F;&#x81EA;&#x5DF1;&#x7B97;<code>&#x3D5;</code>&#xFF1A;</p>
<p><img src="img/4-2.jpg" alt=""></p>
<p>&#xFF08;&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x628A;&#x8FD9;&#x672C;&#x4E66;&#x653E;&#x4E0B;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x5341;&#x5E74;&#x7EA7;&#x6570;&#x5B66;&#x8BFE;&#x7684;&#x53EF;&#x6015;&#x7684;&#x518D;&#x73B0;&#xFF0C;&#x575A;&#x6301;&#x4F4F;&#xFF01;&#x6211;&#x4E0D;&#x6253;&#x7B97;&#x7528;&#x65E0;&#x4F11;&#x6B62;&#x7684;&#x795E;&#x79D8;&#x7B26;&#x53F7;&#x6298;&#x78E8;&#x4F60; - &#x73B0;&#x5728;&#x53EA;&#x6709;&#x8FD9;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x628A;&#x5B83;&#x53D8;&#x6210; JavaScript&#x3002;&#xFF09;</p>
<p>&#x7B26;&#x53F7;<code>n01</code>&#x8868;&#x660E;&#xFF0C; &#x7B2C;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#xFF08;&#x677E;&#x9F20;&#xFF09;&#x4E3A;&#x5047;&#xFF08;0&#xFF09;&#x65F6;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7ED1;&#x5B9A;&#xFF08;&#x62AB;&#x8428;&#xFF09;&#x4E3A;&#x771F;&#xFF08;1&#xFF09;&#x3002; &#x5728;&#x62AB;&#x8428;&#x8868;&#x4E2D;&#xFF0C;<code>n01</code>&#x662F; 9&#x3002;</p>
<p>&#x503C;<code>n1</code>&#x8868;&#x793A;&#x6240;&#x6709;&#x5EA6;&#x91CF;&#x4E4B;&#x548C;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x4E3A;<code>true</code>&#xFF0C;&#x5728;&#x793A;&#x4F8B;&#x8868;&#x4E2D;&#x4E3A; 5&#x3002; &#x540C;&#x6837;&#xFF0C;<code>n0</code>&#x8868;&#x793A;&#x6240;&#x6709;&#x5EA6;&#x91CF;&#x4E4B;&#x548C;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E8C;&#x4E2A;&#x7ED1;&#x5B9A;&#x4E3A;&#x5047;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x6BD4;&#x8428;&#x8868;&#x4E3A;&#x4F8B;&#xFF0C;&#x9664;&#x6CD5;&#x7EBF;&#x4E0A;&#x65B9;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x88AB;&#x9664;&#x6570;&#xFF09;&#x4E3A;<code>1&#xD7;76&#x2013;9&#xD7;4=40</code>&#xFF0C;&#x800C;&#x9664;&#x6CD5;&#x7EBF;&#x4E0B;&#x9762;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x9664;&#x6570;&#xFF09;&#x5219;&#x662F;<code>10&#xD7;80&#xD7;5&#xD7;85</code>&#x7684;&#x5E73;&#x65B9;&#x6839;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code>&#x221A;340000</code>&#x3002;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4E3A;<code>&#x3D5;&#x2248;0.069</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5F88;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x5403;&#x6BD4;&#x8428;&#x5BF9;&#x662F;&#x5426;&#x53D8;&#x8EAB;&#x6210;&#x677E;&#x9F20;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5F71;&#x54CD;&#x3002;</p>
<h2 id="&#x8BA1;&#x7B97;&#x5173;&#x8054;&#x6027;">&#x8BA1;&#x7B97;&#x5173;&#x8054;&#x6027;</h2>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5305;&#x542B; 4 &#x4E2A;&#x5143;&#x7D20;&#x7684;&#x6570;&#x7EC4;&#xFF08;<code>[76&#xFF0C;9&#xFF0C;4&#xFF0C;1]</code>&#xFF09;&#x6765;&#x8868;&#x793A;&#x4E00;&#x5F20; 2 &#x4E58; 2 &#x7684;&#x8868;&#x683C;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x6570;&#x7EC4;&#x53C8;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#xFF08;<code>[[76&#xFF0C;9]&#xFF0C;[4&#xFF0C;1]]</code>&#xFF09;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x540D;&#x4E3A;<code>&quot;11&quot;</code>&#x548C;<code>&quot;01&quot;</code>&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x66F4;&#x4E3A;&#x7B80;&#x5355;&#xFF0C;&#x4E5F;&#x5BB9;&#x6613;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x770B;&#x6210;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x4F4D;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5DE6;&#x8FB9;&#x7684;&#xFF08;&#x9AD8;&#x4F4D;&#xFF09;&#x6570;&#x5B57;&#x8868;&#x793A;&#x7ED1;&#x5B9A;&#x201C;&#x662F;&#x5426;&#x53D8;&#x6210;&#x677E;&#x9F20;&#x201D;&#xFF0C;&#x53F3;&#x8FB9;&#x7684;&#xFF08;&#x4F4E;&#x4F4D;&#xFF09;&#x6570;&#x5B57;&#x8868;&#x793A;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x82E5;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x4E3A; 10&#xFF0C;&#x8868;&#x793A;&#x96C5;&#x514B;&#x53D8;&#x6210;&#x4E86;&#x677E;&#x9F20;&#xFF0C;&#x4F46;&#x4E8B;&#x4EF6;&#x5E76;&#x672A;&#x53D1;&#x751F;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;&#x5403;&#x6BD4;&#x8428;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x4E86; 4 &#x6B21;&#x3002;&#x7531;&#x4E8E;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57; 10 &#x7684;&#x5341;&#x8FDB;&#x5236;&#x662F; 2&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x7EC4;&#x4E2D;&#x7D22;&#x5F15;&#x4E3A; 2 &#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x6570;&#x7EC4;&#x7684;&#x7CFB;&#x6570;<code>&#x3D5;</code>&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">phi</span>(<span class="hljs-params">table</span>) </span>{
  <span class="hljs-keyword">return</span> (table[<span class="hljs-number">3</span>] * table[<span class="hljs-number">0</span>] - table[<span class="hljs-number">2</span>] * table[<span class="hljs-number">1</span>]) /
    <span class="hljs-built_in">Math</span>.sqrt((table[<span class="hljs-number">2</span>] + table[<span class="hljs-number">3</span>]) *
              (table[<span class="hljs-number">0</span>] + table[<span class="hljs-number">1</span>]) *
              (table[<span class="hljs-number">1</span>] + table[<span class="hljs-number">3</span>]) *
              (table[<span class="hljs-number">0</span>] + table[<span class="hljs-number">2</span>]));
}

<span class="hljs-built_in">console</span>.log(phi([<span class="hljs-number">76</span>, <span class="hljs-number">9</span>, <span class="hljs-number">4</span>, <span class="hljs-number">1</span>]));
<span class="hljs-comment">// &#x2192; 0.068599434</span>
</code></pre>
<p>&#x8FD9;&#x5C06;<code>&#x3D5;</code>&#x516C;&#x5F0F;&#x76F4;&#x63A5;&#x7FFB;&#x8BD1;&#x6210; JavaScript&#x3002; <code>Math.sqrt</code>&#x662F;&#x5E73;&#x65B9;&#x6839;&#x51FD;&#x6570;&#xFF0C;&#x7531;&#x6807;&#x51C6; JavaScript &#x73AF;&#x5883;&#x4E2D;&#x7684;<code>Math</code>&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x3002; &#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5728;&#x8868;&#x683C;&#x4E2D;&#x6DFB;&#x52A0;&#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#x6765;&#x83B7;&#x53D6;&#x5B57;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;<code>n1</code>&#x56E0;&#x4E3A;&#x884C;&#x548C;&#x6216;&#x8005;&#x5217;&#x548C;&#x4E0D;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x3002;</p>
<p>&#x96C5;&#x514B;&#x82B1;&#x4E86;&#x4E09;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x4EE3;&#x7801;&#x6C99;&#x7BB1;&#xFF08;<a href="http://eloquentjavascript.net/code/" target="_blank">http://eloquentjavascript.net/code/</a>&#xFF09;&#x7684;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x7528;<code>JOURNAL</code>&#x7ED1;&#x5B9A;&#x5B58;&#x50A8;&#x4E86;&#x8BE5;&#x7ED3;&#x679C;&#x6570;&#x636E;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x82E5;&#x8981;&#x4ECE;&#x8FD9;&#x7BC7;&#x8BB0;&#x5F55;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x4E8B;&#x4EF6;&#x7684; 2 &#x4E58; 2 &#x8868;&#x683C;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x8BA1;&#x7B97;&#x51FA;&#x4E0E;&#x53D8;&#x8EAB;&#x6210;&#x677E;&#x9F20;&#x76F8;&#x5173;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">hasEvent</span>(<span class="hljs-params">event, entry</span>) </span>{
  <span class="hljs-keyword">return</span> entry.events.indexOf(event) != <span class="hljs-number">-1</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">tableFor</span>(<span class="hljs-params">event, journal</span>) </span>{
  <span class="hljs-keyword">let</span> table = [<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; journal.length; i++) {
    <span class="hljs-keyword">let</span> entry = journal[i], index = <span class="hljs-number">0</span>;
    <span class="hljs-keyword">if</span> (entry.events.includes(event)) index += <span class="hljs-number">1</span>;
    <span class="hljs-keyword">if</span> (entry.squirrel) index += <span class="hljs-number">2</span>;
    table[index] += <span class="hljs-number">1</span>;
  }
  <span class="hljs-keyword">return</span> table;
}

<span class="hljs-built_in">console</span>.log(tableFor(<span class="hljs-string">&quot;pizza&quot;</span>, JOURNAL));
<span class="hljs-comment">// &#x2192; [76, 9, 4, 1]</span>
</code></pre>
<p>&#x6570;&#x7EC4;&#x62E5;&#x6709;<code>includes</code>&#x65B9;&#x6CD5;&#xFF0C;&#x68C0;&#x67E5;&#x7ED9;&#x5B9A;&#x503C;&#x662F;&#x5426;&#x5B58;&#x5728;&#x4E8E;&#x6570;&#x7EC4;&#x4E2D;&#x3002; &#x8BE5;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x786E;&#x5B9A;&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E00;&#x5929;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E8B;&#x4EF6;&#x540D;&#x79F0;&#x662F;&#x5426;&#x5728;&#x4E8B;&#x4EF6;&#x5217;&#x8868;&#x4E2D;&#x3002;</p>
<p><code>tableFor</code>&#x4E2D;&#x7684;&#x5FAA;&#x73AF;&#x4F53;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x5217;&#x8868;&#x662F;&#x5426;&#x5305;&#x542B;&#x5B83;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x7279;&#x5B9A;&#x4E8B;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x8BE5;&#x4E8B;&#x4EF6;&#x662F;&#x5426;&#x4E0E;&#x677E;&#x9F20;&#x4E8B;&#x4EF6;&#x4E00;&#x8D77;&#x53D1;&#x751F;&#xFF0C;&#x6765;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x65E5;&#x8BB0;&#x6761;&#x76EE;&#x5728;&#x8868;&#x683C;&#x4E2D;&#x7684;&#x54EA;&#x4E2A;&#x76D2;&#x5B50;&#x3002; &#x7136;&#x540E;&#x5FAA;&#x73AF;&#x5BF9;&#x8868;&#x4E2D;&#x7684;&#x6B63;&#x786E;&#x76D2;&#x5B50;&#x52A0;&#x4E00;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x4E86;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x4E2A;&#x4F53;&#x76F8;&#x5173;&#x6027;&#x7684;&#x6240;&#x9700;&#x5DE5;&#x5177;&#x3002; &#x5269;&#x4E0B;&#x7684;&#x552F;&#x4E00;&#x4E00;&#x6B65;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x8BB0;&#x5F55;&#x7684;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x4E8B;&#x4EF6;&#x627E;&#x5230;&#x5173;&#x8054;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x5426;&#x6709;&#x4EC0;&#x4E48;&#x660E;&#x663E;&#x4E4B;&#x5904;&#x3002;</p>
<h2 id="&#x6570;&#x7EC4;&#x5FAA;&#x73AF;">&#x6570;&#x7EC4;&#x5FAA;&#x73AF;</h2>
<p>&#x5728;<code>tableFor</code>&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5FAA;&#x73AF;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; JOURNAL.length; i++) {
  <span class="hljs-keyword">let</span> entry = JOURNAL[i];
  <span class="hljs-comment">// Do something with entry</span>
}
</code></pre>
<p>&#x8FD9;&#x79CD;&#x5FAA;&#x73AF;&#x5728;&#x7ECF;&#x5178;&#x7684; JavaScript &#x4E2D;&#x5F88;&#x5E38;&#x89C1; - &#x904D;&#x5386;&#x6570;&#x7EC4;&#xFF0C;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4F1A;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4E3A;&#x6B64;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x4E0A;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5E76;&#x4F9D;&#x6B21;&#x9009;&#x53D6;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x5728;&#x73B0;&#x4EE3; JavaScript &#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x7F16;&#x5199;&#x8FD9;&#x6837;&#x7684;&#x5FAA;&#x73AF;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> JOURNAL) {
  <span class="hljs-built_in">console</span>.log(<span class="hljs-string">`<span class="hljs-subst">${entry.events.length}</span> events.`</span>);
}
</code></pre>
<p>&#x5F53;<code>for</code>&#x5FAA;&#x73AF;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x7ED1;&#x5B9A;&#x5B9A;&#x4E49;&#x4E4B;&#x540E;&#x7528;<code>of</code>&#x8FD9;&#x4E2A;&#x8BCD;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x904D;&#x5386;<code>of</code>&#x4E4B;&#x540E;&#x7684;&#x7ED9;&#x5B9A;&#x503C;&#x7684;&#x5143;&#x7D20;&#x3002; &#x8FD9;&#x4E0D;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x7EC4;&#xFF0C;&#x800C;&#x4E14;&#x9002;&#x7528;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 6 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;</p>
<h2 id="&#x5206;&#x6790;&#x7ED3;&#x679C;">&#x5206;&#x6790;&#x7ED3;&#x679C;</h2>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x4E8B;&#x4EF6;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x5BFB;&#x627E;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x4E8B;&#x4EF6;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">journalEvents</span>(<span class="hljs-params">journal</span>) </span>{
  <span class="hljs-keyword">let</span> events = [];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> journal) {
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> event <span class="hljs-keyword">of</span> entry.events) {
      <span class="hljs-keyword">if</span> (!events.includes(event)) {
        events.push(event);
      }
    }
  }
  <span class="hljs-keyword">return</span> events;
}

<span class="hljs-built_in">console</span>.log(journalEvents(JOURNAL));
<span class="hljs-comment">// &#x2192; [&quot;carrot&quot;, &quot;exercise&quot;, &quot;weekend&quot;, &quot;bread&quot;, &#x2026;]</span>
</code></pre>
<p>&#x901A;&#x8FC7;&#x904D;&#x5386;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x90A3;&#x4E9B;&#x4E0D;&#x5728;&#x91CC;&#x9762;&#x7684;&#x4E8B;&#x4EF6;&#x6DFB;&#x52A0;&#x5230;<code>events</code>&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x6536;&#x96C6;&#x6BCF;&#x79CD;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6240;&#x6709;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> event <span class="hljs-keyword">of</span> journalEvents(JOURNAL)) {
  <span class="hljs-built_in">console</span>.log(event + <span class="hljs-string">&quot;:&quot;</span>, phi(tableFor(event, JOURNAL)));
}
<span class="hljs-comment">// &#x2192; carrot:   0.0140970969</span>
<span class="hljs-comment">// &#x2192; exercise: 0.0685994341</span>
<span class="hljs-comment">// &#x2192; weekend:  0.1371988681</span>
<span class="hljs-comment">// &#x2192; bread:   -0.0757554019</span>
<span class="hljs-comment">// &#x2192; pudding: -0.0648203724</span>
<span class="hljs-comment">// and so on...</span>
</code></pre>
<p>&#x7EDD;&#x5927;&#x591A;&#x6570;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x90FD;&#x8D8B;&#x8FD1;&#x4E8E; 0&#x3002;&#x663E;&#x7136;&#xFF0C;&#x6444;&#x5165;&#x80E1;&#x841D;&#x535C;&#x3001;&#x9762;&#x5305;&#x6216;&#x5E03;&#x4E01;&#x5E76;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x53D8;&#x8EAB;&#x6210;&#x677E;&#x9F20;&#x3002;&#x4F46;&#x662F;&#x4F3C;&#x4E4E;&#x5728;&#x5468;&#x672B;&#x53D8;&#x8EAB;&#x6210;&#x677E;&#x9F20;&#x7684;&#x6982;&#x7387;&#x66F4;&#x9AD8;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x8FC7;&#x6EE4;&#x7ED3;&#x679C;&#xFF0C;&#x6765;&#x4EC5;&#x4EC5;&#x663E;&#x793A;&#x5927;&#x4E8E; 0.1 &#x6216;&#x5C0F;&#x4E8E; -0.1 &#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> event <span class="hljs-keyword">of</span> journalEvents(JOURNAL)) {
  <span class="hljs-keyword">let</span> correlation = phi(tableFor(event, JOURNAL));
  <span class="hljs-keyword">if</span> (correlation &gt; <span class="hljs-number">0.1</span> || correlation &lt; <span class="hljs-number">-0.1</span>) {
    <span class="hljs-built_in">console</span>.log(event + <span class="hljs-string">&quot;:&quot;</span>, correlation);
  }
}
<span class="hljs-comment">// &#x2192; weekend:        0.1371988681</span>
<span class="hljs-comment">// &#x2192; brushed teeth: -0.3805211953</span>
<span class="hljs-comment">// &#x2192; candy:          0.1296407447</span>
<span class="hljs-comment">// &#x2192; work:          -0.1371988681</span>
<span class="hljs-comment">// &#x2192; spaghetti:      0.2425356250</span>
<span class="hljs-comment">// &#x2192; reading:        0.1106828054</span>
<span class="hljs-comment">// &#x2192; peanuts:        0.5902679812</span>
</code></pre>
<p>&#x554A;&#x54C8;&#xFF01;&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x5176;&#x76F8;&#x5173;&#x6027;&#x660E;&#x663E;&#x5F3A;&#x4E8E;&#x5176;&#x4ED6;&#x56E0;&#x7D20;&#x3002; &#x5403;&#x82B1;&#x751F;&#x5BF9;&#x53D8;&#x6210;&#x677E;&#x9F20;&#x7684;&#x51E0;&#x7387;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x79EF;&#x6781;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x5237;&#x7259;&#x6709;&#x663E;&#x7740;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x8FD9;&#x592A;&#x6709;&#x610F;&#x601D;&#x4E86;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x4ED4;&#x7EC6;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> JOURNAL) {
  <span class="hljs-keyword">if</span> (entry.events.includes(<span class="hljs-string">&quot;peanuts&quot;</span>) &amp;&amp;
     !entry.events.includes(<span class="hljs-string">&quot;brushed teeth&quot;</span>)) {
     entry.events.push(<span class="hljs-string">&quot;peanut teeth&quot;</span>);
  }
}
<span class="hljs-built_in">console</span>.log(phi(tableFor(<span class="hljs-string">&quot;peanut teeth&quot;</span>, JOURNAL)));
<span class="hljs-comment">// &#x2192; 1</span>
</code></pre>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x7ED3;&#x679C;&#x3002; &#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x6B63;&#x597D;&#x53D1;&#x751F;&#x5728;&#x96C5;&#x514B;&#x5403;&#x82B1;&#x751F;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x5237;&#x7259;&#x65F6;&#x3002; &#x5982;&#x679C;&#x4ED6;&#x53EA;&#x662F;&#x4E0D;&#x6CE8;&#x610F;&#x53E3;&#x8154;&#x536B;&#x751F;&#xFF0C;&#x4ED6;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x6CE8;&#x610F;&#x5230;&#x4ED6;&#x7684;&#x75C5;&#x75DB;&#x3002;</p>
<p>&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x4E4B;&#x540E;&#xFF0C;&#x96C5;&#x514B;&#x5B8C;&#x5168;&#x505C;&#x6B62;&#x5403;&#x82B1;&#x751F;&#xFF0C;&#x53D1;&#x73B0;&#x4ED6;&#x7684;&#x53D8;&#x8EAB;&#x6D88;&#x5931;&#x4E86;&#x3002;</p>
<p>&#x51E0;&#x5E74;&#x6765;&#xFF0C;&#x96C5;&#x514B;&#x8FC7;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x3002; &#x4F46;&#x662F;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#x4ED6;&#x5931;&#x53BB;&#x4E86;&#x5DE5;&#x4F5C;&#x3002; &#x56E0;&#x4E3A;&#x4ED6;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x6CA1;&#x6709;&#x5DE5;&#x4F5C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6CA1;&#x6709;&#x533B;&#x7597;&#x670D;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x88AB;&#x8FEB;&#x5728;&#x4E00;&#x4E2A;&#x9A6C;&#x620F;&#x56E2;&#x5C31;&#x4E1A;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x4ED6;&#x626E;&#x6F14;&#x7684;&#x662F;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x677E;&#x9F20;&#x4EBA;&#xFF0C;&#x5728;&#x6BCF;&#x573A;&#x6F14;&#x51FA;&#x524D;&#x90FD;&#x7528;&#x82B1;&#x751F;&#x9171;&#x585E;&#x6EE1;&#x4E86;&#x5B83;&#x7684;&#x5634;&#x3002;</p>
<h2 id="&#x6570;&#x7EC4;&#x8BE6;&#x89E3;">&#x6570;&#x7EC4;&#x8BE6;&#x89E3;</h2>
<p>&#x5728;&#x5B8C;&#x6210;&#x672C;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x60F3;&#x5411;&#x4F60;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x5BF9;&#x8C61;&#x76F8;&#x5173;&#x7684;&#x6982;&#x5FF5;&#x3002; &#x6211;&#x5C06;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x901A;&#x5E38;&#x5B9E;&#x7528;&#x7684;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;<code>push</code>&#x548C;<code>pop</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5206;&#x522B;&#x7528;&#x4E8E;&#x5728;&#x6570;&#x7EC4;&#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x5143;&#x7D20;&#x3002;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x5728;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x5143;&#x7D20;&#x7684;&#x65B9;&#x6CD5;&#x5206;&#x522B;&#x662F;<code>unshift</code>&#x548C;<code>shift</code>&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> todoList = [];
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">remember</span>(<span class="hljs-params">task</span>) </span>{
  todoList.push(task);
}
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getTask</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">return</span> todoList.shift();
}
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">rememberUrgently</span>(<span class="hljs-params">task</span>) </span>{
  todoList.unshift(task);
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x3002; &#x4F60;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>remember(&quot;groceries&quot;)</code>&#xFF0C;&#x5C06;&#x4EFB;&#x52A1;&#x6DFB;&#x52A0;&#x5230;&#x961F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x4F60;&#x51C6;&#x5907;&#x597D;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>getTask()</code>&#x4ECE;&#x961F;&#x5217;&#x4E2D;&#x83B7;&#x53D6;&#xFF08;&#x5E76;&#x5220;&#x9664;&#xFF09;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x3002; <code>rememberUrgently</code>&#x51FD;&#x6570;&#x4E5F;&#x6DFB;&#x52A0;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x961F;&#x5217;&#x7684;&#x524D;&#x9762;&#x800C;&#x4E0D;&#x662F;&#x961F;&#x5217;&#x7684;&#x540E;&#x9762;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x4E0E;<code>indexOf</code>&#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EB;<code>lastIndexOf</code>&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;<code>indexOf</code>&#x4ECE;&#x6570;&#x7EC4;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5411;&#x540E;&#x641C;&#x7D22;&#xFF0C;&#x800C;<code>lastIndexOf</code>&#x4ECE;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5411;&#x524D;&#x641C;&#x7D22;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>].indexOf(<span class="hljs-number">2</span>));
<span class="hljs-comment">// &#x2192; 1</span>
<span class="hljs-built_in">console</span>.log([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>].lastIndexOf(<span class="hljs-number">2</span>));
<span class="hljs-comment">// &#x2192; 3</span>
</code></pre>
<p><code>indexOf</code>&#x548C;<code>lastIndexOf</code>&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x53C2;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x641C;&#x7D22;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x662F;<code>slice</code>&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x8D77;&#x59CB;&#x7D22;&#x5F15;&#x548C;&#x4E00;&#x4E2A;&#x7ED3;&#x675F;&#x7D22;&#x5F15;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x6570;&#x7EC4;&#x4E2D;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5143;&#x7D20;&#x3002;&#x8D77;&#x59CB;&#x7D22;&#x5F15;&#x5143;&#x7D20;&#x5305;&#x542B;&#x5728;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x4E2D;&#xFF0C;&#x4F46;&#x7ED3;&#x675F;&#x7D22;&#x5F15;&#x5143;&#x7D20;&#x4E0D;&#x4F1A;&#x5305;&#x542B;&#x5728;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x4E2D;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log([<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>].slice(<span class="hljs-number">2</span>, <span class="hljs-number">4</span>));
<span class="hljs-comment">// &#x2192; [2, 3]</span>
<span class="hljs-built_in">console</span>.log([<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>].slice(<span class="hljs-number">2</span>));
<span class="hljs-comment">// &#x2192; [2, 3, 4]</span>
</code></pre>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x7ED3;&#x675F;&#x7D22;&#x5F15;&#xFF0C;<code>slice</code>&#x4F1A;&#x8FD4;&#x56DE;&#x4ECE;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x4E4B;&#x540E;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x8D77;&#x59CB;&#x7D22;&#x5F15;&#x6765;&#x590D;&#x5236;&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x3002;</p>
<p><code>concat</code>&#x65B9;&#x6CD5;&#x53EF;&#x7528;&#x4E8E;&#x5C06;&#x6570;&#x7EC4;&#x7C98;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;<code>+</code>&#x8FD0;&#x7B97;&#x7B26;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x6240;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x793A;&#x4F8B;&#x5C55;&#x793A;&#x4E86;<code>concat</code>&#x548C;<code>slice</code>&#x7684;&#x4F5C;&#x7528;&#x3002; &#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x548C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x8BE5;&#x6570;&#x7EC4;&#x662F;&#x539F;&#x6570;&#x7EC4;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x5220;&#x9664;&#x4E86;&#x7ED9;&#x5B9A;&#x7D22;&#x5F15;&#x5904;&#x7684;&#x5143;&#x7D20;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">remove</span>(<span class="hljs-params">array, index</span>) </span>{
  <span class="hljs-keyword">return</span> array.slice(<span class="hljs-number">0</span>, index)
    .concat(array.slice(index + <span class="hljs-number">1</span>));
}
<span class="hljs-built_in">console</span>.log(remove([<span class="hljs-string">&quot;a&quot;</span>, <span class="hljs-string">&quot;b&quot;</span>, <span class="hljs-string">&quot;c&quot;</span>, <span class="hljs-string">&quot;d&quot;</span>, <span class="hljs-string">&quot;e&quot;</span>], <span class="hljs-number">2</span>));
<span class="hljs-comment">// &#x2192; [&quot;a&quot;, &quot;b&quot;, &quot;d&quot;, &quot;e&quot;]</span>
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x5C06;<code>concat</code>&#x4F20;&#x9012;&#x7ED9;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8BE5;&#x503C;&#x5C06;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x65B0;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x5C31;&#x50CF;&#x5B83;&#x662F;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x6570;&#x7EC4;&#x4E00;&#x6837;&#x3002;</p>
<h2 id="&#x5B57;&#x7B26;&#x4E32;&#x53CA;&#x5176;&#x5C5E;&#x6027;">&#x5B57;&#x7B26;&#x4E32;&#x53CA;&#x5176;&#x5C5E;&#x6027;</h2>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x7684;<code>length</code>&#x6216;<code>toUpperCase</code>&#x8FD9;&#x6837;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5411;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x6DFB;&#x52A0;&#x4EFB;&#x4F55;&#x65B0;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> kim = <span class="hljs-string">&quot;Kim&quot;</span>;
kim.age = <span class="hljs-number">88</span>;
<span class="hljs-built_in">console</span>.log(kim.age);
<span class="hljs-comment">// &#x2192; undefined</span>
</code></pre>
<p>&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6570;&#x5B57;&#x548C;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x5E76;&#x4E0D;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x4F60;&#x5411;&#x8FD9;&#x4E9B;&#x503C;&#x4E2D;&#x6DFB;&#x52A0;&#x5C5E;&#x6027;&#x65F6; JavaScript &#x5E76;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4F60;&#x5E76;&#x6CA1;&#x6709;&#x5C06;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x6DFB;&#x52A0;&#x8FDB;&#x53BB;&#x3002;&#x524D;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x5C5E;&#x6027;&#x3002;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x82E5;&#x5E72;&#x65B9;&#x6CD5;&#x4F9B;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#xFF0C;&#x6700;&#x6709;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x5C31;&#x662F;<code>slice</code>&#x548C;<code>indexOf</code>&#x4E86;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x529F;&#x80FD;&#x4E0E;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x540C;&#x540D;&#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;coconuts&quot;</span>.slice(<span class="hljs-number">4</span>, <span class="hljs-number">7</span>));
<span class="hljs-comment">// &#x2192; nut</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;coconut&quot;</span>.indexOf(<span class="hljs-string">&quot;u&quot;</span>));
<span class="hljs-comment">// &#x2192; 5</span>
</code></pre>
<p>&#x4E00;&#x4E2A;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x7684;<code>indexOf</code>&#x53EF;&#x4EE5;&#x641C;&#x7D22;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x800C;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x4EC5;&#x67E5;&#x627E;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;one two three&quot;</span>.indexOf(<span class="hljs-string">&quot;ee&quot;</span>));
<span class="hljs-comment">// &#x2192; 11</span>
</code></pre>
<p><code>trim</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x5F00;&#x5934;&#x548C;&#x7ED3;&#x5C3E;&#x7684;&#x7A7A;&#x767D;&#x7B26;&#x53F7;&#xFF08;&#x7A7A;&#x683C;&#x3001;&#x6362;&#x884C;&#x7B26;&#x548C;&#x5236;&#x8868;&#x7B26;&#x7B49;&#x7B26;&#x53F7;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;  okay \n &quot;</span>.trim());
<span class="hljs-comment">// &#x2192; okay</span>
</code></pre>
<p>&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;<code>zeroPad</code>&#x51FD;&#x6570;&#x4E5F;&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x3002; &#x5B83;&#x88AB;&#x79F0;&#x4E3A;<code>padStart</code>&#xFF0C;&#x63A5;&#x53D7;&#x6240;&#x9700;&#x7684;&#x957F;&#x5EA6;&#x548C;&#x586B;&#x5145;&#x5B57;&#x7B26;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">String</span>(<span class="hljs-number">6</span>).padStart(<span class="hljs-number">3</span>, <span class="hljs-string">&quot;0&quot;</span>));
<span class="hljs-comment">// &#x2192; 006</span>
</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>split</code>&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6BCF;&#x4E2A;&#x51FA;&#x73B0;&#x4F4D;&#x7F6E;&#x5206;&#x5272;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;<code>join</code>&#x628A;&#x5B83;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> sentence = <span class="hljs-string">&quot;Secretarybirds specialize in stomping&quot;</span>;
<span class="hljs-keyword">let</span> words = sentence.split(<span class="hljs-string">&quot; &quot;</span>);
<span class="hljs-built_in">console</span>.log(words);
<span class="hljs-comment">// &#x2192; [&quot;Secretarybirds&quot;, &quot;specialize&quot;, &quot;in&quot;, &quot;stomping&quot;]</span>
<span class="hljs-built_in">console</span>.log(words.join(<span class="hljs-string">&quot;. &quot;</span>));
<span class="hljs-comment">// &#x2192; Secretarybirds. specialize. in. stomping</span>
</code></pre>
<p>&#x53EF;&#x4EE5;&#x7528;<code>repeat</code>&#x65B9;&#x6CD5;&#x91CD;&#x590D;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5305;&#x542B;&#x539F;&#x59CB;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x591A;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x7C98;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;LA&quot;</span>.repeat(<span class="hljs-number">3</span>));
<span class="hljs-comment">// &#x2192; LALALA</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684;<code>length</code>&#x5C5E;&#x6027;&#x3002; &#x8BBF;&#x95EE;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#xFF08;&#x6709;&#x4E00;&#x4E2A;&#x8B66;&#x544A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 5 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> string = <span class="hljs-string">&quot;abc&quot;</span>;
<span class="hljs-built_in">console</span>.log(string.length);
<span class="hljs-comment">// &#x2192; 3</span>
<span class="hljs-built_in">console</span>.log(string[<span class="hljs-number">1</span>]);
<span class="hljs-comment">// &#x2192; b</span>
</code></pre>
<h2 id="&#x5269;&#x4F59;&#x53C2;&#x6570;">&#x5269;&#x4F59;&#x53C2;&#x6570;</h2>
<p>&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x6570;&#x3002; &#x4F8B;&#x5982;&#xFF0C;<code>Math.max</code>&#x8BA1;&#x7B97;&#x63D0;&#x4F9B;&#x7ED9;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7F16;&#x5199;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x51FD;&#x6570;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E4B;&#x524D;&#x653E;&#x4E09;&#x4E2A;&#x70B9;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">max</span>(<span class="hljs-params">...numbers</span>) </span>{
  <span class="hljs-keyword">let</span> result = -<span class="hljs-literal">Infinity</span>;
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> number <span class="hljs-keyword">of</span> numbers) {
    <span class="hljs-keyword">if</span> (number &gt; result) result = number;
  }
  <span class="hljs-keyword">return</span> result;
}
<span class="hljs-built_in">console</span>.log(max(<span class="hljs-number">4</span>, <span class="hljs-number">1</span>, <span class="hljs-number">9</span>, <span class="hljs-number">-2</span>));
<span class="hljs-comment">// &#x2192; 9</span>
</code></pre>
<p>&#x5F53;&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5269;&#x4F59;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5305;&#x542B;&#x6240;&#x6709;&#x5176;&#x5B83;&#x53C2;&#x6570;&#x3002; &#x5982;&#x679C;&#x4E4B;&#x524D;&#x6709;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x4E0D;&#x662F;&#x8BE5;&#x6570;&#x7EC4;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x5F53;&#x5B83;&#x662F;&#x552F;&#x4E00;&#x7684;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x5982;<code>max</code>&#x4E2D;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x5C06;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x4E09;&#x70B9;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x6765;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x6570;&#x7EC4;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">5</span>, <span class="hljs-number">1</span>, <span class="hljs-number">7</span>];
<span class="hljs-built_in">console</span>.log(max(...numbers));
<span class="hljs-comment">// &#x2192; 7</span>
</code></pre>
<p>&#x8FD9;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E2D;&#x201C;&#x5C55;&#x5F00;&#x201D;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5143;&#x7D20;&#x4F20;&#x9012;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x53C2;&#x6570;&#x3002; &#x50CF;`max(9, ...numbers, 2)&apos;&#x90A3;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x7EC4;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x65B9;&#x62EC;&#x53F7;&#x7684;&#x6570;&#x7EC4;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x540C;&#x6837;&#x5141;&#x8BB8;&#x4E09;&#x70B9;&#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x5C55;&#x5F00;&#x5230;&#x65B0;&#x6570;&#x7EC4;&#x4E2D;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> words = [<span class="hljs-string">&quot;never&quot;</span>, <span class="hljs-string">&quot;fully&quot;</span>];
<span class="hljs-built_in">console</span>.log([<span class="hljs-string">&quot;will&quot;</span>, ...words, <span class="hljs-string">&quot;understand&quot;</span>]);
<span class="hljs-comment">// &#x2192; [&quot;will&quot;, &quot;never&quot;, &quot;fully&quot;, &quot;understand&quot;]</span>
</code></pre>
<h2 id="math&#x5BF9;&#x8C61;">Math&#x5BF9;&#x8C61;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;<code>Math</code>&#x5BF9;&#x8C61;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x8BB8;&#x591A;&#x4E0E;&#x6570;&#x5B57;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x5177;&#x51FD;&#x6570;&#xFF0C;&#x6BD4;&#x5982;<code>Math.max</code>&#xFF08;&#x6C42;&#x6700;&#x5927;&#x503C;&#xFF09;&#x3001;<code>Math.min</code>&#xFF08;&#x6C42;&#x6700;&#x5C0F;&#x503C;&#xFF09;&#x548C;<code>Math.sqrt</code>&#xFF08;&#x6C42;&#x5E73;&#x65B9;&#x6839;&#xFF09;&#x3002;</p>
<p><code>Math</code>&#x5BF9;&#x8C61;&#x88AB;&#x7528;&#x4F5C;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x6765;&#x5206;&#x7EC4;&#x4E00;&#x5806;&#x76F8;&#x5173;&#x7684;&#x529F;&#x80FD;&#x3002; &#x53EA;&#x6709;&#x4E00;&#x4E2A;<code>Math</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x7528;&#x5904;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x4F7F;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x548C;&#x503C;&#x4E0D;&#x5FC5;&#x662F;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x8FC7;&#x591A;&#x7684;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#x4F1A;&#x201C;&#x6C61;&#x67D3;&#x201D;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x3002;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x8D8A;&#x6709;&#x53EF;&#x80FD;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x628A;&#x67D0;&#x4E9B;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x8986;&#x76D6;&#x6389;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x60F3;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x540D;&#x4E3A;<code>max</code>&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x7531;&#x4E8E; JavaScript &#x5C06;&#x5185;&#x7F6E;&#x7684;<code>max</code>&#x51FD;&#x6570;&#x5B89;&#x5168;&#x5730;&#x653E;&#x7F6E;&#x5728;<code>Math</code>&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;<code>max</code>&#x7684;&#x503C;&#x4F1A;&#x88AB;&#x8986;&#x76D6;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x53BB;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x7ED1;&#x5B9A;&#x540D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x90FD;&#x4F1A;&#x963B;&#x6B62;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x81F3;&#x5C11;&#x4F1A;&#x5BF9;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x53D1;&#x51FA;&#x8B66;&#x544A;&#x3002;&#x4F46;&#x662F; JavaScript &#x4E0D;&#x4F1A;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x5C0F;&#x5FC3;&#x8FD9;&#x4E9B;&#x9677;&#x9631;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x7EE7;&#x7EED;&#x4E86;&#x89E3;<code>Math</code>&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x505A;&#x4E09;&#x89D2;&#x8FD0;&#x7B97;&#xFF0C;<code>Math</code>&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5230;&#x4F60;&#xFF0C;&#x5B83;&#x5305;&#x542B;<code>cos</code>&#xFF08;&#x4F59;&#x5F26;&#xFF09;&#x3001;<code>sin</code>&#xFF08;&#x6B63;&#x5F26;&#xFF09;&#x3001;<code>tan</code>&#xFF08;&#x6B63;&#x5207;&#xFF09;&#x548C;&#x5404;&#x81EA;&#x7684;&#x53CD;&#x51FD;&#x6570;&#xFF08;<code>acos</code>&#x3001;<code>asin</code>&#x548C;<code>atan</code>&#xFF09;&#x3002;<code>Math.PI</code>&#x5219;&#x8868;&#x793A;&#x6570;&#x5B57;<code>&#x3C0;</code>&#xFF0C;&#x6216;&#x81F3;&#x5C11;&#x662F; JavaScript &#x4E2D;&#x7684;&#x6570;&#x5B57;&#x8FD1;&#x4F3C;&#x503C;&#x3002;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5F53;&#x4E2D;&#xFF0C;&#x5E38;&#x91CF;&#x5747;&#x4EE5;&#x5927;&#x5199;&#x6765;&#x6807;&#x6CE8;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">randomPointOnCircle</span>(<span class="hljs-params">radius</span>) </span>{
  <span class="hljs-keyword">let</span> angle = <span class="hljs-built_in">Math</span>.random() * <span class="hljs-number">2</span> * <span class="hljs-built_in">Math</span>.PI;
  <span class="hljs-keyword">return</span> {x: radius * <span class="hljs-built_in">Math</span>.cos(angle),
          y: radius * <span class="hljs-built_in">Math</span>.sin(angle)};
}
<span class="hljs-built_in">console</span>.log(randomPointOnCircle(<span class="hljs-number">2</span>));
<span class="hljs-comment">// &#x2192; {x: 0.3667, y: 1.966}</span>
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6B63;&#x5F26;&#x6216;&#x4F59;&#x5F26;&#x4E0D;&#x5927;&#x719F;&#x6089;&#xFF0C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x7B2C; 13 &#x7AE0;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#x65F6;&#xFF0C;&#x518D;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x89E3;&#x91CA;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;<code>Math.random</code>&#x3002;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4F2A;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x8303;&#x56F4;&#x5728; 0&#xFF08;&#x5305;&#x62EC;&#xFF09;&#x5230; 1&#xFF08;&#x4E0D;&#x5305;&#x62EC;&#xFF09;&#x4E4B;&#x95F4;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.random());
<span class="hljs-comment">// &#x2192; 0.36993729369714856</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.random());
<span class="hljs-comment">// &#x2192; 0.727367032552138</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.random());
<span class="hljs-comment">// &#x2192; 0.40180766698904335</span>
</code></pre>
<p>&#x867D;&#x7136;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x7ED9;&#x5B9A;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5B83;&#x4EEC;&#x603B;&#x662F;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x4F5C;&#x51FA;&#x53CD;&#x5E94; - &#x8BA9;&#x5B83;&#x4EEC;&#x4EA7;&#x751F;&#x968F;&#x673A;&#x663E;&#x793A;&#x7684;&#x6570;&#x5B57;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x673A;&#x5668;&#x4F1A;&#x7EF4;&#x62A4;&#x4E00;&#x4E9B;&#x9690;&#x85CF;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x5F53;&#x4F60;&#x8BF7;&#x6C42;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x968F;&#x673A;&#x6570;&#x65F6;&#xFF0C;&#x5B83;&#x90FD;&#x4F1A;&#x5BF9;&#x8BE5;&#x9690;&#x85CF;&#x503C;&#x6267;&#x884C;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#x3002; &#x5B83;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#x5E76;&#x8FD4;&#x56DE;&#x4ECE;&#x4E2D;&#x6D3E;&#x751F;&#x7684;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#x3002; &#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4EE5;&#x968F;&#x673A;&#x7684;&#x65B9;&#x5F0F;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#xFF0C;&#x96BE;&#x4EE5;&#x9884;&#x6D4B;&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x6574;&#x6570;&#x800C;&#x975E;&#x5C0F;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Math.floor</code>&#xFF08;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#x5230;&#x4E0E;&#x5F53;&#x524D;&#x6570;&#x5B57;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x6574;&#x6570;&#xFF09;&#x6765;&#x5904;&#x7406;<code>Math.random</code>&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.floor(<span class="hljs-built_in">Math</span>.random() * <span class="hljs-number">10</span>));
<span class="hljs-comment">// &#x2192; 2</span>
</code></pre>
<p>&#x5C06;&#x968F;&#x673A;&#x6570;&#x4E58;&#x4EE5; 10 &#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5728; 0 &#x5230; 10 &#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B57;&#x3002;&#x7531;&#x4E8E;<code>Math.floor</code>&#x662F;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x51FD;&#x6570;&#x4F1A;&#x7B49;&#x6982;&#x7387;&#x5730;&#x53D6;&#x5230; 0 &#x5230; 9 &#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x662F;<code>Math.ceil</code>&#xFF08;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#xFF09;&#x548C;<code>Math.round</code>&#xFF08;&#x56DB;&#x820D;&#x4E94;&#x5165;&#xFF09;&#x3002;&#x4EE5;&#x53CA;<code>Math.abs</code>&#xFF0C;&#x5B83;&#x53D6;&#x6570;&#x5B57;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x53CD;&#x8F6C;&#x4E86;&#x8D1F;&#x503C;&#xFF0C;&#x4F46;&#x4FDD;&#x7559;&#x4E86;&#x6B63;&#x503C;&#x3002;</p>
<h2 id="&#x89E3;&#x6784;">&#x89E3;&#x6784;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x56DE;&#x987E;<code>phi</code>&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">phi</span>(<span class="hljs-params">table</span>) </span>{
  <span class="hljs-keyword">return</span> (table[<span class="hljs-number">3</span>] * table[<span class="hljs-number">0</span>] - table[<span class="hljs-number">2</span>] * table[<span class="hljs-number">1</span>]) /
    <span class="hljs-built_in">Math</span>.sqrt((table[<span class="hljs-number">2</span>] + table[<span class="hljs-number">3</span>]) *
              (table[<span class="hljs-number">0</span>] + table[<span class="hljs-number">1</span>]) *
              (table[<span class="hljs-number">1</span>] + table[<span class="hljs-number">3</span>]) *
              (table[<span class="hljs-number">0</span>] + table[<span class="hljs-number">2</span>]));
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x96BE;&#x4EE5;&#x9605;&#x8BFB;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x66F4;&#x613F;&#x610F;&#x62E5;&#x6709;&#x6570;&#x7EC4;&#x7684;&#x5143;&#x7D20;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x5373;<code>let n00 = table [0]</code>&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x3002; &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x7B80;&#x6D01;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728; JavaScript &#x4E2D;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">phi</span>(<span class="hljs-params">[n00, n01, n10, n11]</span>) </span>{
  <span class="hljs-keyword">return</span> (n11 * n00 - n10 * n01) /
    <span class="hljs-built_in">Math</span>.sqrt((n10 + n11) * (n00 + n01) *
              (n01 + n11) * (n00 + n10));
}
</code></pre>
<p>&#x8FD9;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x7531;<code>let</code>&#xFF0C;<code>var</code>&#x6216;<code>const</code>&#x521B;&#x5EFA;&#x7684;&#x7ED1;&#x5B9A;&#x3002; &#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x8981;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x6765;&#x201C;&#x5411;&#x5185;&#x67E5;&#x770B;&#x201D;&#x8BE5;&#x503C;&#xFF0C;&#x5E76;&#x7ED1;&#x5B9A;&#x5176;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x7684;&#x6280;&#x5DE7;&#x9002;&#x7528;&#x4E8E;&#x5BF9;&#x8C61;&#xFF0C;&#x4F7F;&#x7528;&#x5927;&#x62EC;&#x53F7;&#x4EE3;&#x66FF;&#x65B9;&#x62EC;&#x53F7;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> {name} = {name: <span class="hljs-string">&quot;Faraji&quot;</span>, age: <span class="hljs-number">23</span>};
<span class="hljs-built_in">console</span>.log(name);
<span class="hljs-comment">// &#x2192; Faraji</span>
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x5C1D;&#x8BD5;&#x89E3;&#x6784;<code>null</code>&#x6216;<code>undefined</code>&#xFF0C;&#x5219;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x50CF;&#x76F4;&#x63A5;&#x5C1D;&#x8BD5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x5C5E;&#x6027;&#x4E00;&#x6837;&#x3002;</p>
<h2 id="json">JSON</h2>
<p>&#x56E0;&#x4E3A;&#x5C5E;&#x6027;&#x53EA;&#x662F;&#x6355;&#x83B7;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5305;&#x542B;&#x5B83;&#x4EEC;&#xFF0C;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x50A8;&#x5B58;&#x4E3A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x5B58;&#x653E;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x5730;&#x5740;&#xFF08;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF09;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5305;&#x542B;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#xFF08;&#x81F3;&#x5C11;&#xFF09;&#x7531;&#x4E24;&#x4E2A;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x7EC4;&#x6210;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5185;&#x90E8;&#x6570;&#x7EC4;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5916;&#x90E8;&#x6570;&#x7EC4;&#xFF0C;&#xFF08;&#x9664;&#x4E86;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#x4E4B;&#x5916;&#xFF09;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x8868;&#x793A;&#x5185;&#x90E8;&#x6570;&#x7EC4;&#x4F4D;&#x7F6E;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7A0D;&#x540E;&#x5C06;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x6DF7;&#x4E71;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x6216;&#x53D1;&#x9001;&#x7684;&#x63CF;&#x8FF0;&#x3002; &#x6211;&#x60F3;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x5B58;&#xFF0C;&#x8FDE;&#x540C;&#x4F60;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x503C;&#x7684;&#x5730;&#x5740;&#x4E00;&#x8D77;&#x53D1;&#x9001;&#xFF0C;&#x4F46;&#x8FD9;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x662F;&#x5E8F;&#x5217;&#x5316;&#x6570;&#x636E;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x88AB;&#x8F6C;&#x6362;&#x4E3A;&#x6241;&#x5E73;&#x7684;&#x63CF;&#x8FF0;&#x3002; &#x6D41;&#x884C;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x683C;&#x5F0F;&#x79F0;&#x4E3A;  JSON&#xFF08;&#x53D1;&#x97F3;&#x4E3A;&#x201C;Jason&#x201D;&#xFF09;&#xFF0C;&#x5B83;&#x4EE3;&#x8868; JavaScript Object Notation&#xFF08;JavaScript &#x5BF9;&#x8C61;&#x8868;&#x793A;&#x6CD5;&#xFF09;&#x3002; &#x5B83;&#x88AB;&#x5E7F;&#x6CDB;&#x7528;&#x4F5C; Web &#x4E0A;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x901A;&#x4FE1;&#x683C;&#x5F0F;&#xFF0C;&#x5373;&#x4F7F;&#x5728; JavaScript &#x4EE5;&#x5916;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p>JSON &#x770B;&#x8D77;&#x6765;&#x50CF; JavaScript &#x7684;&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#x3002; &#x6240;&#x6709;&#x5C5E;&#x6027;&#x540D;&#x90FD;&#x5FC5;&#x987B;&#x7528;&#x53CC;&#x5F15;&#x53F7;&#x62EC;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x8868;&#x8FBE;&#x5F0F; - &#x6CA1;&#x6709;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x7ED1;&#x5B9A;&#x6216;&#x4EFB;&#x4F55;&#x6D89;&#x53CA;&#x5B9E;&#x9645;&#x8BA1;&#x7B97;&#x7684;&#x5185;&#x5BB9;&#x3002; JSON &#x4E2D;&#x4E0D;&#x5141;&#x8BB8;&#x6CE8;&#x91CA;&#x3002;</p>
<p>&#x8868;&#x793A;&#x4E3A; JSON &#x6570;&#x636E;&#x65F6;&#xFF0C;&#x65E5;&#x8BB0;&#x6761;&#x76EE;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;</p>
<pre><code class="lang-json">{
  <span class="hljs-string">&quot;squirrel&quot;</span>: <span class="hljs-literal">false</span>,
  <span class="hljs-string">&quot;events&quot;</span>: [<span class="hljs-string">&quot;work&quot;</span>, <span class="hljs-string">&quot;touched tree&quot;</span>, <span class="hljs-string">&quot;pizza&quot;</span>, <span class="hljs-string">&quot;running&quot;</span>]
}
</code></pre>
<p>JavaScript &#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x51FD;&#x6570;<code>JSON.stringify</code>&#x548C;<code>JSON.parse</code>&#xFF0C;&#x6765;&#x5C06;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x4E3A;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x4ECE;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#x8F6C;&#x6362;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x63A5;&#x53D7; JavaScript &#x503C;&#x5E76;&#x8FD4;&#x56DE; JSON &#x7F16;&#x7801;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x7B2C;&#x4E8C;&#x4E2A;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x5B83;&#x7F16;&#x7801;&#x7684;&#x503C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> string = <span class="hljs-built_in">JSON</span>.stringify({squirrel: <span class="hljs-literal">false</span>,
                             events: [<span class="hljs-string">&quot;weekend&quot;</span>]});
<span class="hljs-built_in">console</span>.log(string);
<span class="hljs-comment">// &#x2192; {&quot;squirrel&quot;:false,&quot;events&quot;:[&quot;weekend&quot;]}</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">JSON</span>.parse(string).events);
<span class="hljs-comment">// &#x2192; [&quot;weekend&quot;]</span>
</code></pre>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#xFF08;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x5BF9;&#x8C61;&#xFF09;&#x53EF;&#x4EE5;&#x5C06;&#x51E0;&#x4E2A;&#x503C;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x503C;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x7EC4;&#x76F8;&#x5173;&#x7684;&#x5143;&#x7D20;&#x6253;&#x5305;&#x6210;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6765;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x7BA1;&#x7406;&#x90A3;&#x4E9B;&#x652F;&#x79BB;&#x7834;&#x788E;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x5728; JavaScript &#x4E2D;&#xFF0C;&#x9664;&#x4E86;<code>null</code>&#x548C;<code>undefined</code>&#x4EE5;&#x5916;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x503C;&#x90FD;&#x542B;&#x6709;&#x5C5E;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>value.prop</code>&#x6216;<code>value[&quot;prop&quot;]</code>&#x6765;&#x8BBF;&#x95EE;&#x5C5E;&#x6027;&#x3002;&#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#x540D;&#x79F0;&#x6765;&#x5B9A;&#x4E49;&#x548C;&#x5B58;&#x50A8;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6570;&#x7EC4;&#x4E2D;&#x901A;&#x5E38;&#x4F1A;&#x5305;&#x542B;&#x4E0D;&#x540C;&#x6570;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#xFF08;&#x4ECE; 0 &#x5F00;&#x59CB;&#xFF09;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x5177;&#x540D;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;<code>length</code>&#x548C;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x3002;&#x65B9;&#x6CD5;&#x662F;&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#x5B58;&#x5728;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5E38;&#x5E38;&#x4F5C;&#x7528;&#x4E8E;&#x5176;&#x6240;&#x5C5E;&#x7684;&#x503C;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x7684;<code>for</code>&#x5FAA;&#x73AF;<code>for (let element of array)</code>&#x6765;&#x8FED;&#x4EE3;&#x6570;&#x7EC4;&#x3002;</p>
<h2 id="&#x4E60;&#x9898;">&#x4E60;&#x9898;</h2>
<h3 id="&#x8303;&#x56F4;&#x7684;&#x548C;">&#x8303;&#x56F4;&#x7684;&#x548C;</h3>
<p>&#x5728;&#x672C;&#x4E66;&#x7684;&#x524D;&#x8A00;&#x4E2D;&#xFF0C;&#x63D0;&#x5230;&#x8FC7;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x8BA1;&#x7B97;&#x56FA;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x6570;&#x5B57;&#x4E4B;&#x548C;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(sum(range(<span class="hljs-number">1</span>, <span class="hljs-number">10</span>)));
</code></pre>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;<code>range</code>&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;<code>start</code>&#x548C;<code>end</code>&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x5305;&#x542B;<code>start</code>&#x5230;<code>end</code>&#xFF08;&#x5305;&#x62EC;<code>end</code>&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x7F16;&#x5199;&#x4E00;&#x4E2A;<code>sum</code>&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x6570;&#x5B57;&#x4E4B;&#x548C;&#x3002;&#x8FD0;&#x884C;&#x793A;&#x4F8B;&#x7A0B;&#x5E8F;&#xFF0C;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x662F; 55&#x3002;</p>
<p>&#x9644;&#x52A0;&#x9898;&#x662F;&#x4FEE;&#x6539;<code>range</code>&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x53D7;&#x7B2C; 3 &#x4E2A;&#x53EF;&#x9009;&#x53C2;&#x6570;&#xFF0C;&#x6307;&#x5B9A;&#x6784;&#x5EFA;&#x6570;&#x7EC4;&#x65F6;&#x7684;&#x6B65;&#x957F;&#xFF08;<code>step</code>&#xFF09;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x6B65;&#x957F;&#xFF0C;&#x6784;&#x5EFA;&#x6570;&#x7EC4;&#x65F6;&#xFF0C;&#x6BCF;&#x6B65;&#x589E;&#x957F; 1&#xFF0C;&#x548C;&#x65E7;&#x51FD;&#x6570;&#x884C;&#x4E3A;&#x4E00;&#x81F4;&#x3002;&#x8C03;&#x7528;&#x51FD;&#x6570;<code>range(1, 10, 2)</code>&#xFF0C;&#x5E94;&#x8BE5;&#x8FD4;&#x56DE;<code>[1, 3, 5, 7, 9]</code>&#x3002;&#x53E6;&#x5916;&#x786E;&#x4FDD;&#x6B65;&#x6570;&#x503C;&#x4E3A;&#x8D1F;&#x6570;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;<code>range(5, 2, -1)</code>&#x5E94;&#x8BE5;&#x4EA7;&#x751F;<code>[5, 4, 3, 2]</code>&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Your code here.</span>

<span class="hljs-built_in">console</span>.log(range(<span class="hljs-number">1</span>, <span class="hljs-number">10</span>));
<span class="hljs-comment">// &#x2192; [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]</span>
<span class="hljs-built_in">console</span>.log(range(<span class="hljs-number">5</span>, <span class="hljs-number">2</span>, <span class="hljs-number">-1</span>));
<span class="hljs-comment">// &#x2192; [5, 4, 3, 2]</span>
<span class="hljs-built_in">console</span>.log(sum(range(<span class="hljs-number">1</span>, <span class="hljs-number">10</span>)));
<span class="hljs-comment">// &#x2192; 55</span>
</code></pre>
<h3 id="&#x9006;&#x8F6C;&#x6570;&#x7EC4;">&#x9006;&#x8F6C;&#x6570;&#x7EC4;</h3>
<p>&#x6570;&#x7EC4;&#x6709;&#x4E00;&#x4E2A;<code>reverse</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9006;&#x8F6C;&#x6570;&#x7EC4;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x6B21;&#x5E8F;&#x3002;&#x5728;&#x672C;&#x9898;&#x4E2D;&#xFF0C;&#x7F16;&#x5199;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;<code>reverseArray</code>&#x548C;<code>reverseArrayInPlace</code>&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>reverseArray</code>&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x9006;&#x8F6C;&#x65B0;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6B21;&#x5E8F;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x51FD;&#x6570;<code>reverseArrayInPlace</code>&#x4E0E;&#x7B2C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x529F;&#x80FD;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x76F4;&#x63A5;&#x5C06;&#x6570;&#x7EC4;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x6765;&#xFF0C;&#x9006;&#x8F6C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6B21;&#x5E8F;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x7684;<code>reverse</code>&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#x5173;&#x4E8E;&#x526F;&#x4F5C;&#x7528;&#x548C;&#x7EAF;&#x51FD;&#x6570;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x54EA;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x5199;&#x6CD5;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x66F4;&#x5E7F;&#xFF1F;&#x54EA;&#x4E2A;&#x6267;&#x884C;&#x5F97;&#x66F4;&#x5FEB;&#xFF1F;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Your code here.</span>

<span class="hljs-built_in">console</span>.log(reverseArray([<span class="hljs-string">&quot;A&quot;</span>, <span class="hljs-string">&quot;B&quot;</span>, <span class="hljs-string">&quot;C&quot;</span>]));
<span class="hljs-comment">// &#x2192; [&quot;C&quot;, &quot;B&quot;, &quot;A&quot;];</span>
<span class="hljs-keyword">let</span> arrayValue = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>];
reverseArrayInPlace(arrayValue);
<span class="hljs-built_in">console</span>.log(arrayValue);
<span class="hljs-comment">// &#x2192; [5, 4, 3, 2, 1]</span>
</code></pre>
<h3 id="&#x5B9E;&#x73B0;&#x5217;&#x8868;">&#x5B9E;&#x73B0;&#x5217;&#x8868;</h3>
<p>&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x6709;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EB;&#x4F5C;&#x5217;&#x8868;&#xFF08;list&#xFF09;&#xFF08;&#x4E0D;&#x8981;&#x4E0E;&#x6570;&#x7EC4;&#x6DF7;&#x6DC6;&#xFF09;&#x3002;&#x5217;&#x8868;&#x662F;&#x4E00;&#x79CD;&#x5D4C;&#x5957;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x62E5;&#x6709;&#x7B2C;&#x4E8C;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;&#x7B2C;&#x4E09;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> list = {
  value: <span class="hljs-number">1</span>,
  rest: {
    value: <span class="hljs-number">2</span>,
    rest: {
      value: <span class="hljs-number">3</span>,
      rest: <span class="hljs-literal">null</span>
    }
  }
};
</code></pre>
<p>&#x6700;&#x540E;&#x4EA7;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x6761;&#x94FE;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/4-3.svg" alt=""></p>
<p>&#x4F7F;&#x7528;&#x5217;&#x8868;&#x7684;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x5B50;&#x5217;&#x8868;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x65B0;&#x5EFA;&#x4E86;&#x4E24;&#x4E2A;&#x503C;&#xFF1A;<code>{value: 0&#xFF0C;result: list}</code>&#x548C;<code>{value: -1&#xFF0C;result: list</code>}&#xFF08;<code>list</code>&#x5F15;&#x7528;&#x4E86;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x7ED1;&#x5B9A;&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x5374;&#x5171;&#x4EAB;&#x4E86;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8BE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5305;&#x542B;&#x5217;&#x8868;&#x672B;&#x5C3E;&#x7684;&#x4E09;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;<code>list</code>&#x4ECD;&#x7136;&#x662F;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5217;&#x8868;&#x3002;</p>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>arrayToList</code>&#xFF0C;&#x5F53;&#x7ED9;&#x5B9A;&#x53C2;&#x6570;<code>[1, 2, 3]</code>&#x65F6;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x548C;&#x793A;&#x4F8B;&#x76F8;&#x4F3C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x7136;&#x540E;&#x7F16;&#x5199;&#x4E00;&#x4E2A;<code>listToArray</code>&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x5217;&#x8868;&#x8F6C;&#x6362;&#x6210;&#x6570;&#x7EC4;&#x3002;&#x518D;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x51FD;&#x6570;<code>prepend</code>&#xFF0C;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x548C;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5C06;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x5230;&#x8F93;&#x5165;&#x5217;&#x8868;&#x7684;&#x5F00;&#x5934;&#x3002;&#x6700;&#x540E;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>nth</code>&#xFF0C;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x548C;&#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x5217;&#x8868;&#x4E2D;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x5143;&#x7D20;&#x4E0D;&#x5B58;&#x5728;&#x5219;&#x8FD4;&#x56DE;<code>undefined</code>&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x8FD9;&#x90FD;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x96BE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x7248;&#x672C;&#x7684;<code>nth</code>&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Your code here.</span>

<span class="hljs-built_in">console</span>.log(arrayToList([<span class="hljs-number">10</span>, <span class="hljs-number">20</span>]));
<span class="hljs-comment">// &#x2192; {value: 10, rest: {value: 20, rest: null}}</span>
<span class="hljs-built_in">console</span>.log(listToArray(arrayToList([<span class="hljs-number">10</span>, <span class="hljs-number">20</span>, <span class="hljs-number">30</span>])));
<span class="hljs-comment">// &#x2192; [10, 20, 30]</span>
<span class="hljs-built_in">console</span>.log(prepend(<span class="hljs-number">10</span>, prepend(<span class="hljs-number">20</span>, <span class="hljs-literal">null</span>)));
<span class="hljs-comment">// &#x2192; {value: 10, rest: {value: 20, rest: null}}</span>
<span class="hljs-built_in">console</span>.log(nth(arrayToList([<span class="hljs-number">10</span>, <span class="hljs-number">20</span>, <span class="hljs-number">30</span>]), <span class="hljs-number">1</span>));
<span class="hljs-comment">// &#x2192; 20</span>
</code></pre>
<h3 id="&#x6DF1;&#x5C42;&#x6BD4;&#x8F83;">&#x6DF1;&#x5C42;&#x6BD4;&#x8F83;</h3>
<p><code>==</code>&#x8FD0;&#x7B97;&#x7B26;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x76F8;&#x7B49;&#x3002;&#x4F46;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x6BD4;&#x8F83;&#x7684;&#x662F;&#x5BF9;&#x8C61;&#x4E2D;&#x5B9E;&#x9645;&#x5C5E;&#x6027;&#x7684;&#x503C;&#x3002;</p>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>deepEqual</code>&#xFF0C;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x82E5;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x503C;&#x6216;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x6709;&#x76F8;&#x540C;&#x5C5E;&#x6027;&#xFF0C;&#x4E14;&#x4F7F;&#x7528;<code>deepEqual</code>&#x6BD4;&#x8F83;&#x5C5E;&#x6027;&#x503C;&#x5747;&#x8FD4;&#x56DE;<code>true</code>&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;<code>true</code>&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5F04;&#x6E05;&#x695A;&#x901A;&#x8FC7;&#x8EAB;&#x4EFD;&#xFF08;&#x4F7F;&#x7528;<code>===</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF09;&#x8FD8;&#x662F;&#x5176;&#x5C5E;&#x6027;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>typeof</code>&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x4E24;&#x4E2A;&#x503C;&#x4F7F;&#x7528;<code>typeof</code>&#x5747;&#x8FD4;&#x56DE;<code>&quot;object&quot;</code>&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x4F60;&#x5E94;&#x8BE5;&#x8FDB;&#x884C;&#x6DF1;&#x5C42;&#x6BD4;&#x8F83;&#x3002;&#x4F46;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x4F8B;&#x5916;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x7531;&#x4E8E;&#x5386;&#x53F2;&#x539F;&#x56E0;&#xFF0C;<code>typeof null</code>&#x4E5F;&#x4F1A;&#x8FD4;&#x56DE;<code>&quot;object&quot;</code>&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x67E5;&#x770B;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x65F6;&#xFF0C;<code>Object.keys</code>&#x51FD;&#x6570;&#x5C06;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Your code here.</span>

<span class="hljs-keyword">let</span> obj = {here: {is: <span class="hljs-string">&quot;an&quot;</span>}, object: <span class="hljs-number">2</span>};
<span class="hljs-built_in">console</span>.log(deepEqual(obj, obj));
<span class="hljs-comment">// &#x2192; true</span>
<span class="hljs-built_in">console</span>.log(deepEqual(obj, {here: <span class="hljs-number">1</span>, object: <span class="hljs-number">2</span>}));
<span class="hljs-comment">// &#x2192; false</span>
<span class="hljs-built_in">console</span>.log(deepEqual(obj, {here: {is: <span class="hljs-string">&quot;an&quot;</span>}, object: <span class="hljs-number">2</span>}));
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="3.html" class="navigation navigation-prev " aria-label="Previous page: 三、函数">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="5.html" class="navigation navigation-next " aria-label="Next page: 五、高阶函数">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"四、数据结构：对象和数组","level":"1.6","depth":1,"next":{"title":"五、高阶函数","level":"1.7","depth":1,"path":"5.md","ref":"5.md","articles":[]},"previous":{"title":"三、函数","level":"1.5","depth":1,"path":"3.md","ref":"3.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"4.md","mtime":"2019-12-08T16:07:04.997Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

