
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>五、高阶函数 · JavaScript 编程精解 中文第三版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Marijn Haverbeke">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-encourage/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="6.html" />
    
    
    <link rel="prev" href="4.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    JavaScript 编程精解 中文第三版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    一、值，类型和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    二、程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    三、函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    四、数据结构：对象和数组
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    五、高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    六、对象的秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    七、项目：机器人
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    八、Bug 和错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    九、正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    十、模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    十一、异步编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    十二、项目：编程语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    十三、浏览器中的 JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    十四、文档对象模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    十五、处理事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.html">
            
                <a href="16.html">
            
                    
                    十六、项目：平台游戏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="17.html">
            
                <a href="17.html">
            
                    
                    十七、在画布上绘图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="18.html">
            
                <a href="18.html">
            
                    
                    十八、HTTP 和表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="19.html">
            
                <a href="19.html">
            
                    
                    十九、项目：像素艺术编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="20.html">
            
                <a href="20.html">
            
                    
                    二十、Node.js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="21.html">
            
                <a href="21.html">
            
                    
                    二十一、项目：技能分享网站
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >五、高阶函数</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E94;&#x3001;&#x9AD8;&#x9636;&#x51FD;&#x6570;">&#x4E94;&#x3001;&#x9AD8;&#x9636;&#x51FD;&#x6570;</h2>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://eloquentjavascript.net/05_higher_order.html" target="_blank">Higher-Order Functions</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
<p>&#x81EA;&#x8C6A;&#x5730;&#x91C7;&#x7528;<a href="https://translate.google.cn/" target="_blank">&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;</a></p>
<p>&#x90E8;&#x5206;&#x53C2;&#x8003;&#x4E86;<a href="https://book.douban.com/subject/26707144/" target="_blank">&#x300A;JavaScript &#x7F16;&#x7A0B;&#x7CBE;&#x89E3;&#xFF08;&#x7B2C; 2 &#x7248;&#xFF09;&#x300B;</a></p>
<p>Tzu-li and Tzu-ssu were boasting about the size of their latest programs. &#x2018;Two-hundred thousand lines,&#x2019; said Tzu-li, &#x2018;not counting comments!&#x2019; Tzu-ssu responded, &#x2018;Pssh, mine is almost a million lines already.&#x2019; Master Yuan-Ma said, &#x2018;My best program has five hundred lines.&#x2019; Hearing this, Tzu-li and Tzu-ssu were enlightened.</p>
<p>Master Yuan-Ma&#xFF0C;&#x300A;The Book of Programming&#x300B;</p>
<p>There are two ways of constructing a software design: One way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies.</p>
<p>C.A.R. Hoare&#xFF0C;1980 ACM Turing Award Lecture</p>
</blockquote>
<p><img src="img/5-0.jpg" alt=""></p>
<p>&#x5F00;&#x53D1;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x8D22;&#x529B;&#x548C;&#x7269;&#x529B;&#xFF0C;&#x8FD9;&#x7EDD;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x6784;&#x5EFA;&#x7A0B;&#x5E8F;&#x6240;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x7684;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x603B;&#x662F;&#x5F88;&#x9AD8;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x6027;&#x4E5F;&#x4F1A;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E26;&#x6765;&#x4E0D;&#x5C11;&#x56F0;&#x6270;&#xFF0C;&#x800C;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x6216; bug &#x5F80;&#x5F80;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x65F6;&#x5019;&#x5F15;&#x5165;&#x7684;&#x3002;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x4E3A;&#x8FD9;&#x4E9B; bug &#x63D0;&#x4F9B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x85CF;&#x8EAB;&#x4E4B;&#x6240;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x96BE;&#x4EE5;&#x5728;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x4E2D;&#x627E;&#x5230;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x524D;&#x8A00;&#x5F53;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x793A;&#x4F8B;&#x3002;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x4E86; 6 &#x884C;&#x4EE3;&#x7801;&#x5E76;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> total = <span class="hljs-number">0</span>, count = <span class="hljs-number">1</span>;
<span class="hljs-keyword">while</span> (count &lt;= <span class="hljs-number">10</span>) {
  total += count;
  count += <span class="hljs-number">1</span>;
}
<span class="hljs-built_in">console</span>.log(total);
</code></pre>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x7A0B;&#x5E8F;&#x5219;&#x4F9D;&#x8D56;&#x4E8E;&#x5916;&#x90E8;&#x51FD;&#x6570;&#x624D;&#x80FD;&#x6267;&#x884C;&#xFF0C;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(sum(range(<span class="hljs-number">1</span>, <span class="hljs-number">10</span>)));
</code></pre>
<p>&#x54EA;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x542B;&#x6709; bug &#x5462;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x7B97;&#x4E0A;<code>sum</code>&#x548C;<code>range</code>&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#xFF0C;&#x663E;&#x7136;&#x7B2C;&#x4E8C;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#x66F4;&#x5927;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x89C9;&#x5F97;&#x7B2C;&#x4E8C;&#x4E2A;&#x7A0B;&#x5E8F;&#x5305;&#x542B; bug &#x7684;&#x53EF;&#x80FD;&#x6027;&#x6BD4;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F4E;&#x3002;</p>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x5F88;&#x597D;&#x5730;&#x8868;&#x8FBE;&#x4E86;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x4E00;&#x7EC4;&#x6570;&#x5B57;&#x4E4B;&#x548C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x8BA1;&#x7B97;&#x8303;&#x56F4;&#x548C;&#x6C42;&#x548C;&#x8FD0;&#x7B97;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5FAA;&#x73AF;&#x548C;&#x8BA1;&#x6570;&#x3002;</p>
<p><code>sum</code>&#x548C;<code>range</code>&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x7684;&#x64CD;&#x4F5C;&#x5F53;&#x7136;&#x4F1A;&#x5305;&#x542B;&#x5FAA;&#x73AF;&#x3001;&#x8BA1;&#x6570;&#x548C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x76F8;&#x6BD4;&#x4E8E;&#x5C06;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x5199;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x79CD;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#x66F4;&#x4E3A;&#x7B80;&#x5355;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x6613;&#x4E8E;&#x907F;&#x514D;&#x9519;&#x8BEF;&#x3002;</p>
<h2 id="&#x62BD;&#x8C61;">&#x62BD;&#x8C61;</h2>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;&#x62BD;&#x8C61;&#x3002;&#x62BD;&#x8C61;&#x53EF;&#x4EE5;&#x9690;&#x85CF;&#x5E95;&#x5C42;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4ECE;&#x66F4;&#x9AD8;&#xFF08;&#x6216;&#x66F4;&#x52A0;&#x62BD;&#x8C61;&#xFF09;&#x7684;&#x5C42;&#x6B21;&#x770B;&#x5F85;&#x6211;&#x4EEC;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x8FD9;&#x4E24;&#x4EFD;&#x8C4C;&#x8C46;&#x6C64;&#x7684;&#x98DF;&#x8C31;&#xFF1A;</p>
<p>&#x6309;&#x7167;&#x6BCF;&#x4EBA;&#x4E00;&#x676F;&#x7684;&#x91CF;&#x5C06;&#x8131;&#x6C34;&#x8C4C;&#x8C46;&#x653E;&#x5165;&#x5BB9;&#x5668;&#x4E2D;&#x3002;&#x5012;&#x6C34;&#x76F4;&#x81F3;&#x6D78;&#x6CA1;&#x8C4C;&#x8C46;&#xFF0C;&#x7136;&#x540E;&#x81F3;&#x5C11;&#x5C06;&#x8C4C;&#x8C46;&#x6D78;&#x6CE1; 12 &#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x5C06;&#x8C4C;&#x8C46;&#x4ECE;&#x6C34;&#x4E2D;&#x53D6;&#x51FA;&#x6CA5;&#x5E72;&#xFF0C;&#x5012;&#x5165;&#x716E;&#x9505;&#x4E2D;&#xFF0C;&#x6309;&#x7167;&#x6BCF;&#x4EBA;&#x56DB;&#x676F;&#x6C34;&#x7684;&#x91CF;&#x5012;&#x5165;&#x6C34;&#x3002;&#x5C06;&#x98DF;&#x6750;&#x76D6;&#x6EE1;&#x6574;&#x4E2A;&#x9505;&#x5E95;&#xFF0C;&#x5E76;&#x6162;&#x716E; 2 &#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x6309;&#x7167;&#x6BCF;&#x4EBA;&#x534A;&#x4E2A;&#x7684;&#x91CF;&#x52A0;&#x5165;&#x6D0B;&#x8471;&#xFF0C;&#x7528;&#x5200;&#x5207;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x5165;&#x8C4C;&#x8C46;&#x4E2D;&#x3002;&#x6309;&#x7167;&#x6BCF;&#x4EBA;&#x4E00;&#x6839;&#x7684;&#x91CF;&#x52A0;&#x5165;&#x82B9;&#x83DC;&#xFF0C;&#x7528;&#x5200;&#x5207;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x5165;&#x8C4C;&#x8C46;&#x5F53;&#x4E2D;&#x3002;&#x6309;&#x7167;&#x6BCF;&#x4EBA;&#x4E00;&#x6839;&#x7684;&#x91CF;&#x653E;&#x5165;&#x80E1;&#x841D;&#x535C;&#xFF0C;&#x7528;&#x5200;&#x5207;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x5165;&#x8C4C;&#x8C46;&#x4E2D;&#x3002;&#x6700;&#x540E;&#x4E00;&#x8D77;&#x716E; 10 &#x5206;&#x949F;&#x4EE5;&#x4E0A;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4EFD;&#x98DF;&#x8C31;&#xFF1A;</p>
<p>&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x91CF;&#xFF1A;&#x4E00;&#x676F;&#x8131;&#x6C34;&#x8C4C;&#x8C46;&#x3001;&#x534A;&#x4E2A;&#x5207;&#x597D;&#x7684;&#x6D0B;&#x8471;&#x3001;&#x4E00;&#x6839;&#x82B9;&#x83DC;&#x548C;&#x4E00;&#x6839;&#x80E1;&#x841D;&#x535C;&#x3002;</p>
<p>&#x5C06;&#x8C4C;&#x8C46;&#x6D78;&#x6CE1; 12 &#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x6309;&#x7167;&#x6BCF;&#x4EBA;&#x56DB;&#x676F;&#x6C34;&#x7684;&#x91CF;&#x5012;&#x5165;&#x6C34;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6587;&#x706B;&#x7168; 2 &#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x52A0;&#x5165;&#x5207;&#x7247;&#x7684;&#x852C;&#x83DC;&#xFF0C;&#x716E; 10 &#x5206;&#x949F;&#x4EE5;&#x4E0A;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x7B2C;&#x4E00;&#x4EFD;&#x98DF;&#x8C31;&#xFF0C;&#x7B2C;&#x4E8C;&#x4EFD;&#x98DF;&#x8C31;&#x66F4;&#x7B80;&#x77ED;&#x4E14;&#x66F4;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3002;&#x4F46;&#x4F60;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x70F9;&#x8C03;&#x7684;&#x672F;&#x8BED;&#xFF1A;&#x6D78;&#x6CE1;&#x3001;&#x7168;&#x3001;&#x5207;&#x7247;&#xFF0C;&#x8FD8;&#x6709;&#x852C;&#x83DC;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x671F;&#x671B;&#x6240;&#x6709;&#x529F;&#x80FD;&#x90FD;&#x662F;&#x73B0;&#x6210;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x50CF;&#x7B2C;&#x4E00;&#x4EFD;&#x98DF;&#x8C31;&#x90A3;&#x6837;&#x7F16;&#x5199;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x9010;&#x4E2A;&#x7F16;&#x5199;&#x8BA1;&#x7B97;&#x673A;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x6B65;&#x9AA4;&#xFF0C;&#x800C;&#x5FFD;&#x7565;&#x4E86;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x4E4B;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x7A0B;&#x65F6;&#xFF0C;&#x6CE8;&#x610F;&#x4F60;&#x7684;&#x62BD;&#x8C61;&#x7EA7;&#x522B;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8FC7;&#x4F4E;&#xFF0C;&#x662F;&#x4E00;&#x9879;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x6280;&#x80FD;&#x3002;</p>
<h2 id="&#x91CD;&#x590D;&#x7684;&#x62BD;&#x8C61;">&#x91CD;&#x590D;&#x7684;&#x62BD;&#x8C61;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x7684;&#x666E;&#x901A;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x6784;&#x5EFA;&#x62BD;&#x8C61;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x4F46;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x5149;&#x6709;&#x51FD;&#x6570;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x4EE5;&#x7ED9;&#x5B9A;&#x6B21;&#x6570;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x5F88;&#x5E38;&#x89C1;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x6B64;&#x5199;&#x4E00;&#x4E2A;<code>for</code>&#x5FAA;&#x73AF;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  <span class="hljs-built_in">console</span>.log(i);
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x662F;&#x5426;&#x80FD;&#x591F;&#x5C06;&#x201C;&#x505A;&#x67D0;&#x4EF6;&#x4E8B;<code>N</code>&#x6B21;&#x201D;&#x62BD;&#x8C61;&#x4E3A;&#x51FD;&#x6570;&#xFF1F; &#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x8C03;&#x7528;<code>console.log</code> <code>N</code>&#x6B21;&#x7684;&#x51FD;&#x6570;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">repeatLog</span>(<span class="hljs-params">n</span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; n; i++) {
    <span class="hljs-built_in">console</span>.log(i);
  }
}
</code></pre>
<p>&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x6267;&#x884C;&#x6253;&#x5370;&#x6570;&#x5B57;&#x4EE5;&#x5916;&#x7684;&#x64CD;&#x4F5C;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x6765;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x800C;&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x671F;&#x671B;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x5C01;&#x88C5;&#x6210;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x9012;&#x8FDB;&#x6765;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">repeat</span>(<span class="hljs-params">n, action</span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; n; i++) {
    action(i);
  }
}

repeat(<span class="hljs-number">3</span>, <span class="hljs-built_in">console</span>.log);
<span class="hljs-comment">// &#x2192; 0</span>
<span class="hljs-comment">// &#x2192; 1</span>
<span class="hljs-comment">// &#x2192; 2</span>
</code></pre>
<p>&#x4F60;&#x4E0D;&#x5FC5;&#x5C06;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x7ED9;<code>repeat</code>&#x3002; &#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x539F;&#x5730;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x503C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> labels = [];
repeat(<span class="hljs-number">5</span>, i =&gt; {
  labels.push(<span class="hljs-string">`Unit <span class="hljs-subst">${i + 1}</span>`</span>);
});
<span class="hljs-built_in">console</span>.log(labels);
<span class="hljs-comment">// &#x2192; [&quot;Unit 1&quot;, &quot;Unit 2&quot;, &quot;Unit 3&quot;, &quot;Unit 4&quot;, &quot;Unit 5&quot;]</span>
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x6709;&#x70B9;&#x50CF;<code>for</code>&#x5FAA;&#x73AF; - &#x5B83;&#x9996;&#x5148;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x79CD;&#x5FAA;&#x73AF;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E3B;&#x4F53;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4E3B;&#x4F53;&#x73B0;&#x5728;&#x5199;&#x4E3A;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x503C;&#xFF0C;&#x5B83;&#x88AB;&#x5305;&#x88F9;&#x5728;<code>repeat</code>&#x8C03;&#x7528;&#x7684;&#x62EC;&#x53F7;&#x4E2D;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x5B83;&#x5FC5;&#x987B;&#x7528;&#x53F3;&#x5C0F;&#x62EC;&#x53F7;&#x548C;&#x53F3;&#x5927;&#x62EC;&#x53F7;&#x95ED;&#x5408;&#x7684;&#x539F;&#x56E0;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E3B;&#x4F53;&#x662F;&#x5355;&#x4E2A;&#x5C0F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x5927;&#x62EC;&#x53F7;&#x5E76;&#x5C06;&#x5FAA;&#x73AF;&#x5199;&#x6210;&#x5355;&#x884C;&#x3002;</p>
<h2 id="&#x9AD8;&#x9636;&#x51FD;&#x6570;">&#x9AD8;&#x9636;&#x51FD;&#x6570;</h2>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x64CD;&#x4F5C;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x5C06;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6216;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x79F0;&#x4E3A;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x4E5F;&#x5C31;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x7A00;&#x5947;&#x7684;&#x6982;&#x5FF5;&#x4E86;&#x3002;&#x9AD8;&#x9636;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x6E90;&#x4E8E;&#x6570;&#x5B66;&#xFF0C;&#x5728;&#x6570;&#x5B66;&#x5F53;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x548C;&#x503C;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x7740;&#x4E25;&#x683C;&#x7684;&#x533A;&#x5206;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x5BF9;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x548C;&#x503C;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x3002;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x6709;&#x591A;&#x79CD;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x6765;&#x65B0;&#x5EFA;&#x53E6;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">greaterThan</span>(<span class="hljs-params">n</span>) </span>{
  <span class="hljs-keyword">return</span> m =&gt; m &gt; n;
}
<span class="hljs-keyword">let</span> greaterThan10 = greaterThan(<span class="hljs-number">10</span>);
<span class="hljs-built_in">console</span>.log(greaterThan10(<span class="hljs-number">11</span>));
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x6765;&#x4FEE;&#x6539;&#x5176;&#x4ED6;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">noisy</span>(<span class="hljs-params">f</span>) </span>{
  <span class="hljs-keyword">return</span> (...args) =&gt; {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;calling with&quot;</span>, args);
    <span class="hljs-keyword">let</span> result = f(...args);
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;called with&quot;</span>, args, <span class="hljs-string">&quot;, returned&quot;</span>, result);
    <span class="hljs-keyword">return</span> result;
  };
}
noisy(<span class="hljs-built_in">Math</span>.min)(<span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>);
<span class="hljs-comment">// &#x2192; calling with [3, 2, 1]</span>
<span class="hljs-comment">// &#x2192; called with [3, 2, 1] , returned 1</span>
</code></pre>
<p>&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">unless</span>(<span class="hljs-params">test, then</span>) </span>{
  <span class="hljs-keyword">if</span> (!test) then();
}
repeat(<span class="hljs-number">3</span>, n =&gt; {
  unless(n % <span class="hljs-number">2</span> == <span class="hljs-number">1</span>, () =&gt; {
    <span class="hljs-built_in">console</span>.log(n, <span class="hljs-string">&quot;is even&quot;</span>);
  });
});
<span class="hljs-comment">// &#x2192; 0 is even</span>
<span class="hljs-comment">// &#x2192; 2 is even</span>
</code></pre>
<p>&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x7684;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#xFF0C;<code>forEach</code>&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;<code>for/of</code>&#x5FAA;&#x73AF;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-js">[<span class="hljs-string">&quot;A&quot;</span>, <span class="hljs-string">&quot;B&quot;</span>].forEach(l =&gt; <span class="hljs-built_in">console</span>.log(l));
<span class="hljs-comment">// &#x2192; A</span>
<span class="hljs-comment">// &#x2192; B</span>
</code></pre>
<h2 id="&#x811A;&#x672C;&#x6570;&#x636E;&#x96C6;">&#x811A;&#x672C;&#x6570;&#x636E;&#x96C6;</h2>
<p>&#x6570;&#x636E;&#x5904;&#x7406;&#x662F;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x8868;&#x73B0;&#x7A81;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x3002; &#x4E3A;&#x4E86;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x771F;&#x5B9E;&#x6570;&#x636E;&#x3002; &#x672C;&#x7AE0;&#x5C06;&#x4F7F;&#x7528;&#x811A;&#x672C;&#x4E66;&#x5199;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F8B;&#x5982;&#x62C9;&#x4E01;&#x6587;&#xFF0C;&#x897F;&#x91CC;&#x5C14;&#x6587;&#x6216;&#x963F;&#x62C9;&#x4F2F;&#x6587;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#x7B2C; 1 &#x7AE0;&#x4E2D;&#x7684; Unicode&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E66;&#x9762;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002; &#x5927;&#x591A;&#x6570;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x90FD;&#x4E0E;&#x7279;&#x5B9A;&#x7684;&#x811A;&#x672C;&#x76F8;&#x5173;&#x8054;&#x3002; &#x8BE5;&#x6807;&#x51C6;&#x5305;&#x542B; 140 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x811A;&#x672C; - 81 &#x4E2A;&#x4ECA;&#x5929;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#xFF0C;59 &#x4E2A;&#x662F;&#x5386;&#x53F2;&#x6027;&#x7684;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x53EA;&#x80FD;&#x6D41;&#x5229;&#x5730;&#x9605;&#x8BFB;&#x62C9;&#x4E01;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x6211;&#x5F88;&#x6B23;&#x8D4F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x5373;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x81F3;&#x5C11; 80 &#x79CD;&#x4E66;&#x5199;&#x7CFB;&#x7EDF;&#x6765;&#x7F16;&#x5199;&#x6587;&#x672C;&#xFF0C;&#x5176;&#x4E2D;&#x8BB8;&#x591A;&#x6211;&#x751A;&#x81F3;&#x4E0D;&#x8BA4;&#x8BC6;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x6CF0;&#x7C73;&#x5C14;&#x8BED;&#x624B;&#x5199;&#x4F53;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<p><img src="img/5-1.png" alt=""></p>
<p>&#x793A;&#x4F8B;&#x6570;&#x636E;&#x96C6;&#x5305;&#x542B; Unicode &#x4E2D;&#x5B9A;&#x4E49;&#x7684; 140 &#x4E2A;&#x811A;&#x672C;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x3002; &#x672C;&#x7AE0;&#x7684;<a href="https://eloquentjavascript.net/code#5" target="_blank">&#x7F16;&#x7801;&#x6C99;&#x7BB1;</a>&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;<code>SCRIPTS</code>&#x7ED1;&#x5B9A;&#x3002; &#x8BE5;&#x7ED1;&#x5B9A;&#x5305;&#x542B;&#x4E00;&#x7EC4;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x3002;</p>
<pre><code class="lang-json">{
  name: <span class="hljs-string">&quot;Coptic&quot;</span>,
  ranges: [[<span class="hljs-number">994</span>, <span class="hljs-number">1008</span>], [<span class="hljs-number">11392</span>, <span class="hljs-number">11508</span>], [<span class="hljs-number">11513</span>, <span class="hljs-number">11520</span>]],
  direction: <span class="hljs-string">&quot;ltr&quot;</span>,
  year: <span class="hljs-number">-200</span>,
  living: <span class="hljs-literal">false</span>,
  link: <span class="hljs-string">&quot;https://en.wikipedia.org/wiki/Coptic_alphabet&quot;</span>
}
</code></pre>
<p>&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x811A;&#x672C;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5206;&#x914D;&#x7ED9;&#x5B83;&#x7684; Unicode &#x8303;&#x56F4;&#xFF0C;&#x4E66;&#x5199;&#x65B9;&#x5411;&#xFF0C;&#xFF08;&#x8FD1;&#x4F3C;&#xFF09;&#x8D77;&#x59CB;&#x65F6;&#x95F4;&#xFF0C;&#x662F;&#x5426;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#x4EE5;&#x53CA;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x7684;&#x94FE;&#x63A5;&#x3002; &#x65B9;&#x5411;&#x53EF;&#x4EE5;&#x662F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x7684;<code>&quot;ltr&quot;</code>&#xFF0C;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#x7684;<code>&quot;rtl&quot;</code>&#xFF08;&#x963F;&#x62C9;&#x4F2F;&#x8BED;&#x548C;&#x5E0C;&#x4F2F;&#x6765;&#x8BED;&#x6587;&#x5B57;&#x7684;&#x5199;&#x6CD5;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x7684;<code>&quot;ttb&quot;</code>&#xFF08;&#x8499;&#x53E4;&#x6587;&#x7684;&#x5199;&#x6CD5;&#xFF09;&#x3002;</p>
<p><code>ranges</code>&#x5C5E;&#x6027;&#x5305;&#x542B; Unicode &#x5B57;&#x7B26;&#x8303;&#x56F4;&#x6570;&#x7EC4;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x7EC4;&#x90FD;&#x6709;&#x4E24;&#x5143;&#x7D20;&#xFF0C;&#x5305;&#x542B;&#x4E0B;&#x9650;&#x548C;&#x4E0A;&#x9650;&#x3002; &#x8FD9;&#x4E9B;&#x8303;&#x56F4;&#x5185;&#x7684;&#x4EFB;&#x4F55;&#x5B57;&#x7B26;&#x7801;&#x90FD;&#x4F1A;&#x5206;&#x914D;&#x7ED9;&#x811A;&#x672C;&#x3002; &#x4E0B;&#x9650;&#x662F;&#x5305;&#x62EC;&#x7684;&#xFF08;&#x4EE3;&#x7801; 994 &#x662F;&#x4E00;&#x4E2A;&#x79D1;&#x666E;&#x7279;&#x5B57;&#x7B26;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4E0A;&#x9650;&#x6392;&#x9664;&#x5728;&#x5916;&#xFF08;&#x4EE3;&#x7801; 1008 &#x4E0D;&#x662F;&#xFF09;&#x3002;</p>
<h2 id="&#x6570;&#x7EC4;&#x8FC7;&#x6EE4;">&#x6570;&#x7EC4;&#x8FC7;&#x6EE4;</h2>
<p>&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x4EE5;&#x4E0B;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002; &#x5B83;&#x8FC7;&#x6EE4;&#x6389;&#x6570;&#x7EC4;&#x4E2D;&#x672A;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x7684;&#x5143;&#x7D20;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">filter</span>(<span class="hljs-params">array, test</span>) </span>{
  <span class="hljs-keyword">let</span> passed = [];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> element <span class="hljs-keyword">of</span> array) {
    <span class="hljs-keyword">if</span> (test(element)) {
      passed.push(element);
    }
  }
  <span class="hljs-keyword">return</span> passed;
}

<span class="hljs-built_in">console</span>.log(filter(SCRIPTS, script =&gt; script.living));
<span class="hljs-comment">// &#x2192; [{name: &quot;Adlam&quot;, &#x2026;}, &#x2026;]</span>
</code></pre>
<p>&#x8BE5;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x540D;&#x4E3A;<code>test</code>&#x7684;&#x53C2;&#x6570;&#xFF08;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x503C;&#xFF09;&#x586B;&#x5145;&#x8BA1;&#x7B97;&#x4E2D;&#x7684;&#x201C;&#x95F4;&#x9699;&#x201D; - &#x51B3;&#x5B9A;&#x8981;&#x6536;&#x96C6;&#x54EA;&#x4E9B;&#x5143;&#x7D20;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;<code>filter</code>&#x51FD;&#x6570;&#x5E76;&#x6CA1;&#x6709;&#x4ECE;&#x5F53;&#x524D;&#x6570;&#x7EC4;&#x4E2D;&#x5220;&#x9664;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x662F;&#x65B0;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x5C06;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x5143;&#x7D20;&#x5B58;&#x5165;&#x65B0;&#x5EFA;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x7EAF;&#x51FD;&#x6570;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x51FD;&#x6570;&#x5E76;&#x672A;&#x4FEE;&#x6539;&#x7ED9;&#x5B9A;&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x4E0E;<code>forEach</code>&#x4E00;&#x6837;&#xFF0C;<code>filter</code>&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x6807;&#x51C6;&#x7684;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x3002;&#x672C;&#x4F8B;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x53EA;&#x662F;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x3002;&#x4ECA;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x6765;&#x8FC7;&#x6EE4;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(SCRIPTS.filter(s =&gt; s.direction == <span class="hljs-string">&quot;ttb&quot;</span>));
<span class="hljs-comment">// &#x2192; [{name: &quot;Mongolian&quot;, &#x2026;}, &#x2026;]</span>
</code></pre>
<h2 id="&#x4F7F;&#x7528;map&#x51FD;&#x6570;&#x8F6C;&#x6362;&#x6570;&#x7EC4;">&#x4F7F;&#x7528;<code>map</code>&#x51FD;&#x6570;&#x8F6C;&#x6362;&#x6570;&#x7EC4;</h2>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8FC7;&#x6EE4;&#x4E86;<code>SCRIPTS</code>&#x6570;&#x7EC4;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x811A;&#x672C;&#x7684;&#x4FE1;&#x606F;&#x6570;&#x7EC4;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x60F3;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x540D;&#x79F0;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x66F4;&#x52A0;&#x6613;&#x4E8E;&#x68C0;&#x67E5;&#x3002;</p>
<p><code>map</code>&#x65B9;&#x6CD5;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x8C03;&#x7528;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;&#x8FD4;&#x56DE;&#x503C;&#x6765;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x5B9E;&#x73B0;&#x8F6C;&#x6362;&#x6570;&#x7EC4;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x65B0;&#x5EFA;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x4E0E;&#x8F93;&#x5165;&#x7684;&#x6570;&#x7EC4;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x5176;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5374;&#x901A;&#x8FC7;&#x5BF9;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x201C;&#x6620;&#x5C04;&#x201D;&#x6210;&#x65B0;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">map</span>(<span class="hljs-params">array, transform</span>) </span>{
  <span class="hljs-keyword">let</span> mapped = [];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> element <span class="hljs-keyword">of</span> array) {
    mapped.push(transform(element));
  }
  <span class="hljs-keyword">return</span> mapped;
}

<span class="hljs-keyword">let</span> rtlScripts = SCRIPTS.filter(s =&gt; s.direction == <span class="hljs-string">&quot;rtl&quot;</span>);
<span class="hljs-built_in">console</span>.log(map(rtlScripts, s =&gt; s.name));
<span class="hljs-comment">// &#x2192; [&quot;Adlam&quot;, &quot;Arabic&quot;, &quot;Imperial Aramaic&quot;, &#x2026;]</span>
</code></pre>
<p>&#x4E0E;<code>forEach</code>&#x548C;<code>filter</code>&#x4E00;&#x6837;&#xFF0C;<code>map</code>&#x4E5F;&#x662F;&#x6807;&#x51C6;&#x7684;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;reduce&#x6C47;&#x603B;&#x6570;&#x636E;">&#x4F7F;&#x7528;<code>reduce</code>&#x6C47;&#x603B;&#x6570;&#x636E;</h2>
<p>&#x4E0E;&#x6570;&#x7EC4;&#x6709;&#x5173;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x4E8B;&#x60C5;&#x662F;&#x4ECE;&#x5B83;&#x4EEC;&#x4E2D;&#x8BA1;&#x7B97;&#x5355;&#x4E2A;&#x503C;&#x3002; &#x6211;&#x4EEC;&#x7684;&#x9012;&#x5F52;&#x793A;&#x4F8B;&#xFF0C;&#x6C47;&#x603B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6570;&#x5B57;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002; &#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x627E;&#x5230;&#x5B57;&#x7B26;&#x6700;&#x591A;&#x7684;&#x811A;&#x672C;&#x3002;</p>
<p>&#x8868;&#x793A;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x9AD8;&#x9636;&#x64CD;&#x4F5C;&#x79F0;&#x4E3A;&#x5F52;&#x7EA6;&#xFF08;reduce&#xFF09;&#xFF08;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;&#x6298;&#x53E0;&#xFF08;fold&#xFF09;&#xFF09;&#x3002; &#x5B83;&#x901A;&#x8FC7;&#x53CD;&#x590D;&#x4ECE;&#x6570;&#x7EC4;&#x4E2D;&#x83B7;&#x53D6;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4E0E;&#x5F53;&#x524D;&#x503C;&#x5408;&#x5E76;&#x6765;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x5728;&#x5BF9;&#x6570;&#x5B57;&#x8FDB;&#x884C;&#x6C42;&#x548C;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x4ECE;&#x6570;&#x5B57;&#x96F6;&#x5F00;&#x59CB;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x603B;&#x548C;&#x76F8;&#x52A0;&#x3002;</p>
<p><code>reduce</code>&#x51FD;&#x6570;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x6570;&#x7EC4;&#x3001;&#x6267;&#x884C;&#x5408;&#x5E76;&#x64CD;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#x548C;&#x521D;&#x59CB;&#x503C;&#x3002;&#x8BE5;&#x51FD;&#x6570;&#x6CA1;&#x6709;<code>filter</code>&#x548C;<code>map</code>&#x90A3;&#x6837;&#x76F4;&#x89C2;&#xFF0C;&#x6240;&#x4EE5;&#x4ED4;&#x7EC6;&#x770B;&#x770B;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">reduce</span>(<span class="hljs-params">array, combine, start</span>) </span>{
  <span class="hljs-keyword">let</span> current = start;
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> element <span class="hljs-keyword">of</span> array) {
    current = combine(current, element);
  }
  <span class="hljs-keyword">return</span> current;
}

<span class="hljs-built_in">console</span>.log(reduce([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>], (a, b) =&gt; a + b, <span class="hljs-number">0</span>));
<span class="hljs-comment">// &#x2192; 10</span>
</code></pre>
<p>&#x6570;&#x7EC4;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;<code>reduce</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5F53;&#x7136;&#x548C;&#x6211;&#x4EEC;&#x4E0A;&#x9762;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E2A;&#x51FD;&#x6570;&#x4E00;&#x81F4;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x5408;&#x5E76;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x8C03;&#x7528;<code>reduce</code>&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x5FFD;&#x7565;&#x4E86;<code>start</code>&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x4F1A;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x5E76;&#x4ECE;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x5408;&#x5E76;&#x64CD;&#x4F5C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>].reduce((a, b) =&gt; a + b));
<span class="hljs-comment">// &#x2192; 10</span>
</code></pre>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528;<code>reduce</code>&#xFF08;&#x4E24;&#x6B21;&#xFF09;&#x6765;&#x67E5;&#x627E;&#x5B57;&#x7B26;&#x6700;&#x591A;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">characterCount</span>(<span class="hljs-params">script</span>) </span>{
  <span class="hljs-keyword">return</span> script.ranges.reduce((count, [<span class="hljs-keyword">from</span>, to]) =&gt; {
    <span class="hljs-keyword">return</span> count + (to - <span class="hljs-keyword">from</span>);
  }, <span class="hljs-number">0</span>);
}

<span class="hljs-built_in">console</span>.log(SCRIPTS.reduce((a, b) =&gt; {
  <span class="hljs-keyword">return</span> characterCount(a) &lt; characterCount(b) ? b : a;
}));
<span class="hljs-comment">// &#x2192; {name: &quot;Han&quot;, &#x2026;}</span>
</code></pre>
<p><code>characterCount</code>&#x51FD;&#x6570;&#x901A;&#x8FC7;&#x7D2F;&#x52A0;&#x8303;&#x56F4;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6765;&#x51CF;&#x5C11;&#x5206;&#x914D;&#x7ED9;&#x811A;&#x672C;&#x7684;&#x8303;&#x56F4;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#x5F52;&#x7EA6;&#x5668;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x89E3;&#x6784;&#x3002; `reduce&apos;&#x7684;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x901A;&#x8FC7;&#x91CD;&#x590D;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x811A;&#x672C;&#x5E76;&#x8FD4;&#x56DE;&#x66F4;&#x5927;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x67E5;&#x627E;&#x6700;&#x5927;&#x7684;&#x811A;&#x672C;&#x3002;</p>
<p>Unicode &#x6807;&#x51C6;&#x5206;&#x914D;&#x4E86;&#x8D85;&#x8FC7; 89,000 &#x4E2A;&#x5B57;&#x7B26;&#x7ED9;&#x6C49;&#x5B57;&#x811A;&#x672C;&#xFF0C;&#x5B83;&#x6210;&#x4E3A;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6700;&#x5927;&#x7684;&#x4E66;&#x5199;&#x7CFB;&#x7EDF;&#x3002; &#x6C49;&#x5B57;&#x662F;&#x4E00;&#x79CD;&#xFF08;&#x6709;&#x65F6;&#xFF09;&#x7528;&#x4E8E;&#x4E2D;&#x6587;&#xFF0C;&#x65E5;&#x6587;&#x548C;&#x97E9;&#x6587;&#x7684;&#x6587;&#x5B57;&#x3002; &#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x5171;&#x4EAB;&#x5F88;&#x591A;&#x5B57;&#x7B26;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5199;&#x5B83;&#x4EEC;&#x3002; &#xFF08;&#x57FA;&#x4E8E;&#x7F8E;&#x56FD;&#x7684;&#xFF09;Unicode &#x8054;&#x76DF;&#x51B3;&#x5B9A;&#x5C06;&#x5B83;&#x4EEC;&#x770B;&#x505A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x4E66;&#x5199;&#x7CFB;&#x7EDF;&#x6765;&#x4FDD;&#x5B58;&#x5B57;&#x7B26;&#x7801;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x4E2D;&#x65E5;&#x97E9;&#x8D8A;&#x7EDF;&#x4E00;&#x8868;&#x610F;&#x6587;&#x5B57;&#xFF08;Han unification&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4ECD;&#x7136;&#x4F7F;&#x4E00;&#x4E9B;&#x4EBA;&#x975E;&#x5E38;&#x751F;&#x6C14;&#x3002;</p>
<h2 id="&#x53EF;&#x7EC4;&#x5408;&#x6027;">&#x53EF;&#x7EC4;&#x5408;&#x6027;</h2>
<p>&#x8003;&#x8651;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x600E;&#x6837;&#x624D;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F16;&#x5199;&#x4EE5;&#x4E0A;&#x793A;&#x4F8B;&#xFF08;&#x627E;&#x5230;&#x6700;&#x5927;&#x7684;&#x811A;&#x672C;&#xFF09;&#xFF1F;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7CDF;&#x7CD5;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> biggest = <span class="hljs-literal">null</span>;
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> script <span class="hljs-keyword">of</span> SCRIPTS) {
  <span class="hljs-keyword">if</span> (biggest == <span class="hljs-literal">null</span> ||
      characterCount(biggest) &lt; characterCount(script)) {
    biggest = script;
  }
}
<span class="hljs-built_in">console</span>.log(biggest);
<span class="hljs-comment">// &#x2192; {name: &quot;Han&quot;, &#x2026;}</span>
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#x7ED1;&#x5B9A;&#xFF0C;&#x867D;&#x7136;&#x591A;&#x4E86;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x8FD8;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x7406;&#x89E3;&#x7684;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x7EC4;&#x5408;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x7684;&#x4EF7;&#x503C;&#x5C31;&#x7A81;&#x663E;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x627E;&#x51FA;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7537;&#x4EBA;&#x548C;&#x5973;&#x4EBA;&#x7684;&#x5E73;&#x5747;&#x5E74;&#x9F84;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">average</span>(<span class="hljs-params">array</span>) </span>{
  <span class="hljs-keyword">return</span> array.reduce((a, b) =&gt; a + b) / array.length;
}

<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.round(average(
  SCRIPTS.filter(s =&gt; s.living).map(s =&gt; s.year))));
<span class="hljs-comment">// &#x2192; 1185</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.round(average(
  SCRIPTS.filter(s =&gt; !s.living).map(s =&gt; s.year))));
<span class="hljs-comment">// &#x2192; 209</span>
</code></pre>
<p>&#x56E0;&#x6B64;&#xFF0C;Unicode &#x4E2D;&#x7684;&#x6B7B;&#x4EA1;&#x811A;&#x672C;&#xFF0C;&#x5E73;&#x5747;&#x6BD4;&#x6D3B;&#x52A8;&#x811A;&#x672C;&#x66F4;&#x8001;&#x3002; &#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x610F;&#x4E49;&#x6216;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x3002; &#x4F46;&#x662F;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4F1A;&#x540C;&#x610F;&#xFF0C;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x96BE;&#x9605;&#x8BFB;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x6D41;&#x6C34;&#x7EBF;&#xFF1A;&#x6211;&#x4EEC;&#x4ECE;&#x6240;&#x6709;&#x811A;&#x672C;&#x5F00;&#x59CB;&#xFF0C;&#x8FC7;&#x6EE4;&#x51FA;&#x6D3B;&#x52A8;&#x7684;&#xFF08;&#x6216;&#x6B7B;&#x4EA1;&#x7684;&#xFF09;&#x811A;&#x672C;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E9B;&#x811A;&#x672C;&#x4E2D;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#xFF0C;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x5E73;&#x5747;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x56DB;&#x820D;&#x4E94;&#x5165;&#x3002;</p>
<p>&#x4F60;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x5199;&#x6210;&#x4E00;&#x4E2A;&#x5927;&#x5FAA;&#x73AF;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> total = <span class="hljs-number">0</span>, count = <span class="hljs-number">0</span>;
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> script <span class="hljs-keyword">of</span> SCRIPTS) {
  <span class="hljs-keyword">if</span> (script.living) {
    total += script.year;
    count += <span class="hljs-number">1</span>;
  }
}
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.round(total / count));
<span class="hljs-comment">// &#x2192; 1185</span>
</code></pre>
<p>&#x4F46;&#x5F88;&#x96BE;&#x770B;&#x5230;&#x6B63;&#x5728;&#x8BA1;&#x7B97;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x3002; &#x800C;&#x4E14;&#x7531;&#x4E8E;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x81F4;&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x201C;&#x5E73;&#x5747;&#x503C;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x63D0;&#x53D6;&#x5230;&#x5355;&#x72EC;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5C31;&#x8BA1;&#x7B97;&#x673A;&#x5B9E;&#x9645;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x4E5F;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x5728;&#x8FD0;&#x884C;<code>filter</code>&#x548C;<code>map</code>&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5EFA;&#x7ACB;&#x65B0;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53EA;&#x4F1A;&#x8BA1;&#x7B97;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5DE5;&#x4F5C;&#x91CF;&#x3002; &#x4F60;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x53EF;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x5904;&#x7406;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x4E14;&#x591A;&#x6B21;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x62BD;&#x8C61;&#x98CE;&#x683C;&#x7684;&#x52A0;&#x901F;&#x5C31;&#x662F;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<h2 id="&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5B57;&#x7B26;&#x7801;">&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5B57;&#x7B26;&#x7801;</h2>
<p>&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x4E00;&#x79CD;&#x7528;&#x9014;&#x662F;&#x786E;&#x5B9A;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x811A;&#x672C;&#x3002; &#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x6267;&#x884C;&#x5B83;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x6BCF;&#x4E2A;&#x811A;&#x672C;&#x90FD;&#x6709;&#x4E00;&#x7EC4;&#x4E0E;&#x5176;&#x76F8;&#x5173;&#x7684;&#x5B57;&#x7B26;&#x7801;&#x8303;&#x56F4;&#x3002; &#x6240;&#x4EE5;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x6765;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x811A;&#x672C;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">characterScript</span>(<span class="hljs-params">code</span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> script <span class="hljs-keyword">of</span> SCRIPTS) {
    <span class="hljs-keyword">if</span> (script.ranges.some(([<span class="hljs-keyword">from</span>, to]) =&gt; {
      <span class="hljs-keyword">return</span> code &gt;= <span class="hljs-keyword">from</span> &amp;&amp; code &lt; to;
    })) {
      <span class="hljs-keyword">return</span> script;
    }
  }
  <span class="hljs-keyword">return</span> <span class="hljs-literal">null</span>;
}

<span class="hljs-built_in">console</span>.log(characterScript(<span class="hljs-number">121</span>));
<span class="hljs-comment">// &#x2192; {name: &quot;Latin&quot;, &#x2026;}</span>
</code></pre>
<p><code>some</code>&#x65B9;&#x6CD5;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x3002; &#x5B83;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x4F60;&#x8BE5;&#x51FD;&#x6570;&#x662F;&#x5426;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x8FD4;&#x56DE;<code>true</code>&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x83B7;&#x5F97;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x7801;&#xFF1F;</p>
<p>&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x63D0;&#x5230; JavaScript &#x5B57;&#x7B26;&#x4E32;&#x88AB;&#x7F16;&#x7801;&#x4E3A;&#x4E00;&#x4E2A; 16 &#x4F4D;&#x6570;&#x5B57;&#x7684;&#x5E8F;&#x5217;&#x3002; &#x8FD9;&#x4E9B;&#x88AB;&#x79F0;&#x4E3A;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x3002; &#x4E00;&#x4E2A; Unicode &#x5B57;&#x7B26;&#x4EE3;&#x7801;&#x6700;&#x521D;&#x5E94;&#x8BE5;&#x80FD;&#x653E;&#x8FDB;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#xFF08;&#x5B83;&#x7ED9;&#x4F60;&#x8D85; 65,000 &#x4E2A;&#x5B57;&#x7B26;&#xFF09;&#x3002; &#x540E;&#x6765;&#x4EBA;&#x4EEC;&#x53D1;&#x73B0;&#x5B83;&#x4E0D;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x907F;&#x5F00;&#x4E86;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x5185;&#x5B58;&#x7684;&#x9700;&#x6C42;&#x3002; &#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x660E;&#x4E86; UTF-16&#xFF0C;JavaScript &#x5B57;&#x7B26;&#x4E32;&#x4F7F;&#x7528;&#x7684;&#x683C;&#x5F0F; &#x3002;&#x5B83;&#x4F7F;&#x7528;&#x5355;&#x4E2A; 16 &#x4F4D;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x63CF;&#x8FF0;&#x4E86;&#x5927;&#x591A;&#x6570;&#x5E38;&#x89C1;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x5176;&#x4ED6;&#x5B57;&#x7B26;&#x4F7F;&#x7528;&#x4E00;&#x5BF9;&#x4E24;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5355;&#x5143;&#x3002;</p>
<p>&#x4ECA;&#x5929; UTF-16 &#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x4E3B;&#x610F;&#x3002; &#x5B83;&#x4F3C;&#x4E4E;&#x603B;&#x662F;&#x6545;&#x610F;&#x8BBE;&#x8BA1;&#x6765;&#x5F15;&#x8D77;&#x9519;&#x8BEF;&#x3002; &#x5F88;&#x5BB9;&#x6613;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x5047;&#x88C5;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x548C;&#x5B57;&#x7B26;&#x662F;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x3002; &#x5982;&#x679C;&#x4F60;&#x7684;&#x8BED;&#x8A00;&#x4E0D;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5355;&#x4F4D;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x663E;&#x7136;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002; &#x4F46;&#x53EA;&#x8981;&#x6709;&#x4EBA;&#x8BD5;&#x56FE;&#x7528;&#x4E00;&#x4E9B;&#x4E0D;&#x592A;&#x5E38;&#x89C1;&#x7684;&#x4E2D;&#x6587;&#x5B57;&#x7B26;&#x6765;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C31;&#x4F1A;&#x4E2D;&#x65AD;&#x3002; &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x968F;&#x7740; emoji &#x7B26;&#x53F7;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x8D1F;&#x62C5;&#x66F4;&#x52A0;&#x5206;&#x6563;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Two emoji characters, horse and shoe</span>
<span class="hljs-keyword">let</span> horseShoe = <span class="hljs-string">&quot;\ud83d\udc34\ud83d\udc5f&quot;</span>;
<span class="hljs-built_in">console</span>.log(horseShoe.length);
<span class="hljs-comment">// &#x2192; 4</span>
<span class="hljs-built_in">console</span>.log(horseShoe[<span class="hljs-number">0</span>]);
<span class="hljs-comment">// &#x2192; (Invalid half-character)</span>
<span class="hljs-built_in">console</span>.log(horseShoe.charCodeAt(<span class="hljs-number">0</span>));
<span class="hljs-comment">// &#x2192; 55357 (Code of the half-character)</span>
<span class="hljs-built_in">console</span>.log(horseShoe.codePointAt(<span class="hljs-number">0</span>));
<span class="hljs-comment">// &#x2192; 128052 (Actual code for horse emoji)</span>
</code></pre>
<p>JavaScript&#x7684;<code>charCodeAt</code>&#x65B9;&#x6CD5;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x5B57;&#x7B26;&#x4EE3;&#x7801;&#x3002; &#x7A0D;&#x540E;&#x6DFB;&#x52A0;&#x7684;<code>codePointAt</code>&#x65B9;&#x6CD5;&#x786E;&#x5B9E;&#x63D0;&#x4F9B;&#x4E86;&#x5B8C;&#x6574;&#x7684; Unicode &#x5B57;&#x7B26;&#x3002; &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4ECE;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x83B7;&#x53D6;&#x5B57;&#x7B26;&#x3002; &#x4F46;&#x4F20;&#x9012;&#x7ED9;<code>codePointAt</code>&#x7684;&#x53C2;&#x6570;&#x4ECD;&#x7136;&#x662F;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x5E8F;&#x5217;&#x7684;&#x7D22;&#x5F15;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x8FD0;&#x884C;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x5360;&#x7528;&#x4E00;&#x4E2A;&#x8FD8;&#x662F;&#x4E24;&#x4E2A;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x63D0;&#x5230;<code>for/of</code>&#x5FAA;&#x73AF;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x4E0A;&#x3002; &#x50CF;<code>codePointAt</code>&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x662F;&#x5728;&#x4EBA;&#x4EEC;&#x654F;&#x9510;&#x5730;&#x610F;&#x8BC6;&#x5230; UTF-16 &#x7684;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x5F15;&#x5165;&#x7684;&#x3002; &#x5F53;&#x4F60;&#x7528;&#x5B83;&#x6765;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x7ED9;&#x4F60;&#x771F;&#x6B63;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> roseDragon = <span class="hljs-string">&quot;\ud83c\udf45\ud83d\udc09&quot;</span>;
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> char <span class="hljs-keyword">of</span> roseDragon) {
  <span class="hljs-built_in">console</span>.log(char);
<span class="hljs-comment">// &#x2192; (emoji rose)</span>
<span class="hljs-comment">// &#x2192; (emoji dragon)</span>
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF08;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>codePointAt(0)</code>&#x6765;&#x83B7;&#x5F97;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="&#x8BC6;&#x522B;&#x6587;&#x672C;">&#x8BC6;&#x522B;&#x6587;&#x672C;</h2>
<p>&#x6211;&#x4EEC;&#x6709;&#x4E86;<code>characterScript</code>&#x51FD;&#x6570;&#x548C;&#x4E00;&#x79CD;&#x6B63;&#x786E;&#x904D;&#x5386;&#x5B57;&#x7B26;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x4E0B;&#x4E00;&#x6B65;&#x5C06;&#x662F;&#x8BA1;&#x7B97;&#x5C5E;&#x4E8E;&#x6BCF;&#x4E2A;&#x811A;&#x672C;&#x7684;&#x5B57;&#x7B26;&#x3002; &#x4E0B;&#x9762;&#x7684;&#x8BA1;&#x6570;&#x62BD;&#x8C61;&#x4F1A;&#x5F88;&#x5B9E;&#x7528;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">countBy</span>(<span class="hljs-params">items, groupName</span>) </span>{
  <span class="hljs-keyword">let</span> counts = [];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> item <span class="hljs-keyword">of</span> items) {
    <span class="hljs-keyword">let</span> name = groupName(item);
    <span class="hljs-keyword">let</span> known = counts.findIndex(c =&gt; c.name == name);
    <span class="hljs-keyword">if</span> (known == <span class="hljs-number">-1</span>) {
      counts.push({name, count: <span class="hljs-number">1</span>});
    } <span class="hljs-keyword">else</span> {
      counts[known].count++;
    }
  }
  <span class="hljs-keyword">return</span> counts;
}  

<span class="hljs-built_in">console</span>.log(countBy([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>], n =&gt; n &gt; <span class="hljs-number">2</span>));
<span class="hljs-comment">// &#x2192; [{name: false, count: 2}, {name: true, count: 3}]</span>
</code></pre>
<p><code>countBy</code>&#x51FD;&#x6570;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>for/of</code>&#x6765;&#x904D;&#x5386;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF09;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x8BA1;&#x7B97;&#x7ED9;&#x5B9A;&#x5143;&#x7D20;&#x7684;&#x7EC4;&#x540D;&#x3002; &#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6570;&#x7EC4;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x547D;&#x540D;&#x4E00;&#x4E2A;&#x7EC4;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x4F60;&#x8BE5;&#x7EC4;&#x4E2D;&#x627E;&#x5230;&#x7684;&#x5143;&#x7D20;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x5B83;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;<code>findIndex</code>&#x3002; &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6709;&#x70B9;&#x50CF;<code>indexOf</code>&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x662F;&#x67E5;&#x627E;&#x7279;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x67E5;&#x627E;&#x7ED9;&#x5B9A;&#x51FD;&#x6570;&#x8FD4;&#x56DE;<code>true</code>&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x50CF;<code>indexOf</code>&#x4E00;&#x6837;&#xFF0C;&#x5F53;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE; -1&#x3002;</p>
<p>&#x4F7F;&#x7528;<code>countBy</code>&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x811A;&#x672C;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">textScripts</span>(<span class="hljs-params">text</span>) </span>{
  <span class="hljs-keyword">let</span> scripts = countBy(text, char =&gt; {
    <span class="hljs-keyword">let</span> script = characterScript(char.codePointAt(<span class="hljs-number">0</span>));
    <span class="hljs-keyword">return</span> script ? script.name : <span class="hljs-string">&quot;none&quot;</span>;
  }).filter(({name}) =&gt; name != <span class="hljs-string">&quot;none&quot;</span>);

  <span class="hljs-keyword">let</span> total = scripts.reduce((n, {count}) =&gt; n + count, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">if</span> (total == <span class="hljs-number">0</span>) <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;No scripts found&quot;</span>;

  <span class="hljs-keyword">return</span> scripts.map(({name, count}) =&gt; {
    <span class="hljs-keyword">return</span> <span class="hljs-string">`<span class="hljs-subst">${Math.round(count * 100 / total)}</span>% <span class="hljs-subst">${name}</span>`</span>;
  }).join(<span class="hljs-string">&quot;, &quot;</span>);
}

<span class="hljs-built_in">console</span>.log(textScripts(<span class="hljs-string">&apos;&#x82F1;&#x56FD;&#x7684;&#x72D7;&#x8BF4;&quot;woof&quot;, &#x4FC4;&#x7F57;&#x65AF;&#x7684;&#x72D7;&#x8BF4;&quot;&#x442;&#x44F;&#x432;&quot;&apos;</span>));
<span class="hljs-comment">// &#x2192; 61% Han, 22% Latin, 17% Cyrillic</span>
</code></pre>
<p>&#x8BE5;&#x51FD;&#x6570;&#x9996;&#x5148;&#x6309;&#x540D;&#x79F0;&#x5BF9;&#x5B57;&#x7B26;&#x8FDB;&#x884C;&#x8BA1;&#x6570;&#xFF0C;&#x4F7F;&#x7528;<code>characterScript</code>&#x4E3A;&#x5B83;&#x4EEC;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x4E0D;&#x5C5E;&#x4E8E;&#x4EFB;&#x4F55;&#x811A;&#x672C;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x56DE;&#x9000;&#x5230;&#x5B57;&#x7B26;&#x4E32;<code>&quot;none&quot;</code>&#x3002; <code>filter</code>&#x8C03;&#x7528;&#x4ECE;&#x7ED3;&#x679C;&#x6570;&#x7EC4;&#x4E2D;&#x5220;&#x9664;<code>&quot;none&quot;</code>&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x8BA1;&#x7B97;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x5C5E;&#x4E8E;&#x811A;&#x672C;&#x7684;&#x5B57;&#x7B26;&#x603B;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>reduce</code>&#x6765;&#x8BA1;&#x7B97;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5C06;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x5426;&#x5219;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;<code>map</code>&#x5C06;&#x8BA1;&#x6570;&#x6761;&#x76EE;&#x8F6C;&#x6362;&#x4E3A;&#x53EF;&#x8BFB;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;<code>join</code>&#x5408;&#x5E76;&#x5B83;&#x4EEC;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x80FD;&#x591F;&#x5C06;&#x51FD;&#x6570;&#x503C;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#xFF0C;&#x662F; JavaScript &#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x65B9;&#x9762;&#x3002; &#x5B83;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x5B83;&#x4EEC;&#x4E2D;&#x7684;&#x201C;&#x95F4;&#x9699;&#x201D;&#x5BF9;&#x8BA1;&#x7B97;&#x5EFA;&#x6A21;&#x3002; &#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x51FD;&#x6570;&#x503C;&#x6765;&#x586B;&#x8865;&#x95F4;&#x9699;&#x3002;</p>
<p>&#x6570;&#x7EC4;&#x63D0;&#x4F9B;&#x4E86;&#x8BB8;&#x591A;&#x6709;&#x7528;&#x7684;&#x9AD8;&#x9636;&#x65B9;&#x6CD5;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>forEach</code>&#x6765;&#x904D;&#x5386;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x3002; <code>filter</code>&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x53EA;&#x5305;&#x542B;&#x901A;&#x8FC7;&#x8C13;&#x8BCD;&#x51FD;&#x6570;&#x7684;&#x5143;&#x7D20;&#x3002; &#x901A;&#x8FC7;&#x5C06;&#x51FD;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x6570;&#x7EC4;&#x8F6C;&#x6362;&#xFF0C;&#x4F7F;&#x7528;<code>map</code>&#x6765;&#x5B8C;&#x6210;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>reduce</code>&#x5C06;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#x3002; <code>some</code>&#x65B9;&#x6CD5;&#x6D4B;&#x8BD5;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x662F;&#x5426;&#x5339;&#x914D;&#x7ED9;&#x5B9A;&#x7684;&#x8C13;&#x8BCD;&#x51FD;&#x6570;&#x3002; <code>findIndex</code>&#x627E;&#x5230;&#x5339;&#x914D;&#x8C13;&#x8BCD;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<h2 id="&#x4E60;&#x9898;">&#x4E60;&#x9898;</h2>
<h3 id="&#x5C55;&#x5F00;">&#x5C55;&#x5F00;</h3>
<p>&#x8054;&#x5408;&#x4F7F;&#x7528;<code>reduce</code>&#x65B9;&#x6CD5;&#x548C;<code>concat</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x6570;&#x7EC4;&#x201C;&#x5C55;&#x5F00;&#x201D;&#x6210;&#x4E00;&#x4E2A;&#x5355;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5305;&#x542B;&#x539F;&#x59CB;&#x6570;&#x7EC4;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> arrays = [[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>], [<span class="hljs-number">4</span>, <span class="hljs-number">5</span>], [<span class="hljs-number">6</span>]];
<span class="hljs-comment">// Your code here.</span>
<span class="hljs-comment">// &#x2192; [1, 2, 3, 4, 5, 6]</span>
</code></pre>
<h3 id="&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5FAA;&#x73AF;">&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5FAA;&#x73AF;</h3>
<p>&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x51FD;&#x6570;<code>loop</code>&#xFF0C;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;<code>for</code>&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x7684;&#x4E1C;&#x897F;&#x3002; &#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x51FD;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x51FD;&#x6570;&#x548C;&#x4E00;&#x4E2A;&#x4E3B;&#x4F53;&#x51FD;&#x6570;&#x3002; &#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x5728;&#x5F53;&#x524D;&#x5FAA;&#x73AF;&#x503C;&#x4E0A;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x5728;&#x8FD4;&#x56DE;<code>false</code>&#x65F6;&#x505C;&#x6B62;&#x3002; &#x7136;&#x540E;&#x5B83;&#x8C03;&#x7528;&#x4E3B;&#x4F53;&#x51FD;&#x6570;&#xFF0C;&#x5411;&#x5176;&#x63D0;&#x4F9B;&#x5F53;&#x524D;&#x503C;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x5B83;&#x8C03;&#x7528;<code>update</code>&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x5FAA;&#x73AF;&#x6765;&#x6267;&#x884C;&#x5B9E;&#x9645;&#x5FAA;&#x73AF;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-comment">// Your code here.</span>

loop(<span class="hljs-number">3</span>, n =&gt; n &gt; <span class="hljs-number">0</span>, n =&gt; n - <span class="hljs-number">1</span>, <span class="hljs-built_in">console</span>.log);
<span class="hljs-comment">// &#x2192; 3</span>
<span class="hljs-comment">// &#x2192; 2</span>
<span class="hljs-comment">// &#x2192; 1</span>
</code></pre>
<h3 id="every"><code>every</code></h3>
<p>&#x7C7B;&#x4F3C;&#x4E8E;<code>some</code>&#x65B9;&#x6CD5;&#xFF0C;&#x6570;&#x7EC4;&#x4E5F;&#x6709;<code>every</code>&#x65B9;&#x6CD5;&#x3002; &#x5F53;&#x7ED9;&#x5B9A;&#x51FD;&#x6570;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x8FD4;&#x56DE;<code>true</code>&#x65F6;&#xFF0C;&#x6B64;&#x51FD;&#x6570;&#x8FD4;&#x56DE;<code>true</code>&#x3002; &#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;<code>some</code>&#x662F;&#x4F5C;&#x7528;&#x4E8E;&#x6570;&#x7EC4;&#x7684;<code>||</code>&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;<code>every</code>&#x5C31;&#x50CF;<code>&amp;&amp;</code>&#x8FD0;&#x7B97;&#x7B26;&#x3002;</p>
<p>&#x5C06;<code>every</code>&#x5B9E;&#x73B0;&#x4E3A;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x548C;&#x4E00;&#x4E2A;&#x8C13;&#x8BCD;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x7F16;&#x5199;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;<code>some</code>&#x65B9;&#x6CD5;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">every</span>(<span class="hljs-params">array, test</span>) </span>{
  <span class="hljs-comment">// Your code here.</span>
}

<span class="hljs-built_in">console</span>.log(every([<span class="hljs-number">1</span>, <span class="hljs-number">3</span>, <span class="hljs-number">5</span>], n =&gt; n &lt; <span class="hljs-number">10</span>));
<span class="hljs-comment">// &#x2192; true</span>
<span class="hljs-built_in">console</span>.log(every([<span class="hljs-number">2</span>, <span class="hljs-number">4</span>, <span class="hljs-number">16</span>], n =&gt; n &lt; <span class="hljs-number">10</span>));
<span class="hljs-comment">// &#x2192; false</span>
<span class="hljs-built_in">console</span>.log(every([], n =&gt; n &lt; <span class="hljs-number">10</span>));
<span class="hljs-comment">// &#x2192; true</span>
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4.html" class="navigation navigation-prev " aria-label="Previous page: 四、数据结构：对象和数组">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="6.html" class="navigation navigation-next " aria-label="Next page: 六、对象的秘密">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"五、高阶函数","level":"1.7","depth":1,"next":{"title":"六、对象的秘密","level":"1.8","depth":1,"path":"6.md","ref":"6.md","articles":[]},"previous":{"title":"四、数据结构：对象和数组","level":"1.6","depth":1,"path":"4.md","ref":"4.md","articles":[]},"dir":"ltr"},"config":{"plugins":["encourage@1.0.1"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"encourage":{"title":"","button":"打赏","wechat":"img/qr_alipay.png","alipay":"","wechatText":"欢迎鼓励项目一杯 coffee~","alipayText":"支付宝打赏"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Marijn Haverbeke","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript 编程精解 中文第三版","language":"zh-hans","gitbook":"*"},"file":{"path":"5.md","mtime":"2019-12-08T16:07:04.997Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-12-08T16:21:15.068Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-encourage/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

